Repository: GNOME/libgda
Catalog: tools/browser/help/*/*.po
Languages: sv

# _
source: translator-credits
sv: Sebastian Rasmussen <sebras@gmail.com>, 2019 Anders Jonsson <anders.jonsson@norsjovallen.se>, 2020

source: Actions
sv: Åtgärder

source: Actions are bits of SQL code which depends on variables and can be executed from the contextual menu of any data set presented in a grid.
sv: Åtgärder är bitar av SQL-kod som beror på variabler och kan köras från en kontextmeny för en datamängd som presenteras i ett rutnät.

source: For example if there is a table "products" which lists some kind of products and a table "comments" which lists all the comments left by users on a product (presumably the "comments" table will have a foreign key on the "products" table to reference it).
sv: Om det till exempel finns en tabell ”produkter” som listar några olika produkter och en tabell ”kommentarer” som listar vilka kommentarer till en produkt som lämnats av användare (förmodligen kommer tabellen ”kommentarer” att ha en främmande nyckel som refererar till tabellen ”produkter”).

source: An action can be defined to show all the entries in the "comments" table provided the key is defining a product. Then anytime a product is listed in a result set, the contextual menu will allow the user to execute this action and thus display all the comments on the selected product. This situation is illustrated in the following figures.
sv: En åtgärd kan definieras för att visa alla poster i tabellen ”kommentarer” givet att nyckeln definierar en produkt. Sedan, närhelst en produkt listas i en resultatmängd kommer kontextmenyn att låta användaren köra denna åtgärd och därför visa alla kommentarerna för den valda produkten. Denna situation illustreras i följande figurer.

source: The first step is to define an action, which is just a favorite in the <link xref="query-execution-perspective">query execution</link> perspective which is defined as an action: bring up the properties for the favorite, and make sure the "Is action" toggle is checked:
sv: Det första steget är att definiera en åtgärd vilken bara är en favorit i perspektivet <link xref="query-execution-perspective">frågekörning</link> vilken definieras som en åtgärd: slå upp egenskaperna för favoriten, och säkerställ att växelknappen ”Är åtgärd” är ikryssad:

source: Action - define an action
sv: Åtgärd - definiera en åtgärd

source: Define the action to list the comments for a product, from the query execution perspective
sv: Definiera åtgärden för att lista kommentarerna för en produkt från frågekörningsperspektivet

source: Action - display a list of products
sv: Åtgärd - visa en lista av produkter

source: In the query execution perspective, let's select all the products. Notice that there are here two defined actions: "Add comment on product" and "List comments for product"
sv: I frågekörningsperspektivet, låt oss markera alla produkterna. Notera att det här finns två definierade åtgärder: ”Lägg till kommentar till produkt” och ”Lista kommentarer för produkt”

source: Now let's pop up the contextual menu:
sv: Låt oss nu visa kontextmenyn:

source: Action - contextual menu
sv: Åtgärd - kontextmeny

source: Pop up the contextual menu and select <guiseq><gui>Execute action</gui><gui>List comments for product</gui></guiseq>
sv: Visa kontextmenyn och välj <guiseq><gui>Kör åtgärd</gui><gui>Lista kommentarer för produkt</gui></guiseq>

source: After a confirmation of the parameters to execute the action, the result is there:
sv: Efter en bekräftelse av parametrarna för att köra åtgärden återfinns resultatet:

source: Action - executed
sv: Åtgärd - körd

source: The action is now executed
sv: Åtgärden är nu körd

source: The data manager perspective
sv: Datahanterarperspektivet

source: Use the data manager perspective to navigate through the database's data. To switch to this perspective, use the <guiseq><gui>Perspective</gui><gui>Data Manager</gui></guiseq> menu, or the <keyseq><key>Ctrl</key><key>D</key></keyseq> shortcut.
sv: Använd datahanterarperspektivet för att navigera genom en databas data. För att växla till detta perspektiv, använd menyn <guiseq><gui>Perspektiv</gui><gui>Datahanterare</gui></guiseq>, eller genvägen <keyseq><key>Ctrl</key><key>D</key></keyseq>.

source: The workflow in this perspective is organized around the definition of one or more <em>data sources</em> (which selects data in the database) which, when executed, result in a data set displayed in a tabular view.
sv: Arbetsflödet i detta perspektiv organiseras runt definitionen av en eller flera <em>datakällor</em> (som väljer data i databasen), vilka när de körs, resulterar i en datamängd som visas i en tabellvy.

source: The perspective is divided in two horizontal panes: the left pane to keep favorite data sources set's definitions, and the right pane being the action area, where each data source is executed and the results presented in a tabular view.
sv: Perspektivet delas upp i två horisontella paneler: den vänstra panelen håller definitionerna för favoritdatakällor och den högra panelen är åtgärdsområdet, där varje datakälla körs och resultaten presenteras i en tabellvy.

source: Data manager perspective
sv: Datahanterarperspektivet

source: The data manager perspective, with two data sources
sv: Datahanterarperspektivet med två datakällor

source: In the figure above, there are two data sources: one for the 'customers' table and one for the 'orders' table (which here lists the orders from a customer), the later data source depending on the former one as there is a foreign key from the 'orders' table which references the 'customers' table. The two data sources have been executed and the result is composed of two tabular views side by side.
sv: I figuren ovan finns det två datakällor: en för tabellen ”kunder” och en för tabellen ”ordrar” (vilket här listas som ordrar från en kund), den senare datakällan beror på den föregående då det finns en främmande nyckel från tabellen ”ordrar” som refererar till tabellen ”kunder”. De två datakällorna har körts och resultatet består av två tabellvyer sida vid sida.

source: Because the 'orders' data source depends on the 'customers' data source, its corresponding view is on the right of the one corresponding to the 'customers' data source. Also when the row selection of the 'customers' view changes, the whole contents of the 'orders' view is refreshed.
sv: Eftersom datakällan ”ordrar” beror på datakällan ”kunder” är dess motsvarande vy till höger om den som motsvarar datakällan ”kunder”. Dessutom när de markerade raderna i vyn ”kunder” ändras kommer hela innehållet i vyn ”ordrar” att uppdateras.

source: Defining data sources
sv: Definiera datakällor

source: The simplest data source is a data source which represents all the data from a table, displayed when executed as a single tabular view, as if one executed the <code>SELECT * FROM mytable</code> statement in the <link xref="query-execution-perspective"/>.
sv: Den enklaste datakällan är en datakälla som representerar alla data från en tabell, som visas som en enstaka tabellvy när den körs, som om man kört satsen <code>SELECT * FROM mintabell</code> i <link xref="query-execution-perspective"/>.

source: The following figure shows the data sources editing mode (switch to editing mode using the <media type="image" mime="image/png" src="figures/data-man-mode.png"/> toolbar button).
sv: Följande figur visar redigeringsläget för datakällor (växla till redigeringsläge via verktygsfältsknappen <media type="image" mime="image/png" src="figures/data-man-mode.png"/>).

source: Data sources can be defined using an <link xref="data-manager-xml-syntax">XML syntax</link>, or using the <link xref="data-manager-source-editor">default interface</link>.
sv: Datakällor kan definieras via <link xref="data-manager-xml-syntax">XML-syntax</link>, eller via <link xref="data-manager-source-editor">standardgränssnittet</link>.

source: Data sources edition
sv: Redigering av datakällor

source: Editing data sources in the data manager perspective, from the XML syntax
sv: Redigering av datakällor i datahanteringsperspektivet från XML-syntaxen

source: Editing data sources in the data manager perspective, using the default interface: two data sources are defined, which list the contents of the "customers" and "orders" tables. The setup is the same as the figure above showing the XML syntax
sv: Redigering av datakällor i datahanteringsperspektivet via standardgränssnittet: två datakällor är definierade, vilka listar innehållet i tabellerna ”kunder” och ”ordrar”. Uppställningen är densamma som i figuren ovan som visar XML-syntaxen

source: The commands available through the command buttons are:
sv: Kommandona som är tillgängliga via kommandoknapparna är:

source: <gui>Reset</gui>: resets the XML editor to a default XML template, only available when the XML view is currently displayed
sv: <gui>Återställ</gui>: återställer XML-redigeraren till en standard-XML-mall, endast tillgänglig när XML-vyn visas

source: <gui>Add</gui>: displays a popup menu with shortcuts to quickly define new data sources as whole table contents (also analyses the database schema to propose relevant choices), only available when the XML edition mode is not selected
sv: <gui>Lägg till</gui>: visar en popuppmeny med genvägar för att snabbt definiera nya datakällor som hela tabellinnehåll (vilket också analyserar databasschemat för att föreslå relevanta alternativ), endast tillgänglig när XML-redigeringsläget inte används

source: <gui>Variables</gui>: shows/hide the <link xref="variables-syntax">variables</link> panel where you can give values to the variables present in the SQL code of any data source's definition. The panel is automatically shown when a variable is detected in the SQL code.
sv: <gui>Variabler</gui>: visar/döljer panelen <link xref="variables-syntax">variabler</link> där du kan ange värden för variablerna som finns i SQL-koden för någon datakällas definition. Panelen visas automatiskt när en variabel detekteras i SQL-koden.

source: <gui>Execute</gui>: executes the defined data sources
sv: <gui>Kör</gui>: kör de definierade datakällorna

source: <gui>View XML</gui>: toggles between the XML editor and the UI editor
sv: <gui>Visa XML</gui>: växlar mellan XML-redigerare och gränssnittsredigerare

source: <gui>Help</gui>: shows some help
sv: <gui>Hjälp</gui>: visar hjälpen

source: Executing defined data sources
sv: Köra definierade datakällor

source: To execute a defined set of data sources, simply switch to execute mode using the <media type="image" mime="image/png" src="figures/data-man-mode.png"/> toolbar button or the <gui>Execute</gui> button.
sv: För att köra en definierad mängd datakällor, växla över till körläge med hjälp av verktygsfältsknappen <media type="image" mime="image/png" src="figures/data-man-mode.png"/> eller knappen <gui>Kör</gui>.

source: The layout of tabular views for each data source is automatically generated in columns using the following rule: if a data source B depends on a data source A, then its tabular view is displayed on the right of the one for A.
sv: Layouten för tabellvyerna för varje datakälla genereras automatiskt som kolumner enligt följande regler: om en datakälla B beror på en datakälla A, då kommer dess tabellvy att visas till höger om den för A.

source: Also if you change the selected row of tabular view of a data source A, then the tabular views of all the data sources depending on A will also have their tabular view refreshed.
sv: Om du ändrar de markerade raderna för en tabellvy för en datakälla A, då kommer tabellvyerna för alla datakällor som beror på A också att uppdateras.

source: The data manager's XML syntax
sv: Datahanterarens XML-syntax

source: The XML tree's root node must be a <code>&lt;data&gt;</code>, which is allowed to contain one or more data source definitions. Each data source is defined by <code>&lt;query&gt;</code> or <code>&lt;table&gt;</code> nodes, both accepting the following optional attributes:
sv: XML-trädets rotnod måste vara <code>&lt;data&gt;</code>, vilken får innehålla en eller flera definitioner av datakällor. Varje datakälla definieras av <code>&lt;query&gt;</code>- eller <code>&lt;table&gt;</code>-noder, båda hanterar följande valfria attribut:

source: "id" to specify a data source string ID, used when linking data sources one to another;
sv: ”id” för att ange ID-sträng för en datakälla, används när datakällor länkas ihop;

source: "title" to specify a title.
sv: ”title” för att ange en titel.

source: It is of course possible to use both the <code>&lt;query&gt;</code> or <code>&lt;table&gt;</code> tags in the same data sources specifications.
sv: Det är så klart möjligt att använda både <code>&lt;query&gt;</code>- och <code>&lt;table&gt;</code>-taggar i samma datastrukturspecifikationer.

source: Exported variables
sv: Exporterade variabler

source: Each data source exports some variables which can be reused by other data sources to introduce a dependency. When the data sources are executed, the contents of these exported variables are reset depending on the row actually selected in the resulting tabular view. If no row is selected then the variable is unset.
sv: Varje datakälla exporterar några variabler som kan återanvändas av andra datakällor för att introducera ett beroende. Då datakällorna exekveras återställs innehållet i dessa exporterade variabler beroende på raden som faktiskt valts i den resulterande tabellvyn. Om ingen rad valts så är variabeln inte inställd.

source: Any data source depending on a variable is executed again when the variable changes, and in case the variable is unset, the data source's execution result is an empty data set.
sv: En datakälla som beror på en variabel exekveras igen då variabeln ändras, och om variabeln inte har ställts in så är resultatet av datakällans exekvering en tom datamängd.

source: The <code>&lt;query&gt;</code> tag
sv: Taggen <code>&lt;query&gt;</code>

source: Use the <code>&lt;query&gt;</code> tag to specify an SQL SELECT statement, as the contents of the tag. Linkage to other data sources can be achieved using <link xref="variables-syntax">variables</link> in the SELECT's SQL.
sv: Använd taggen <code>&lt;query&gt;</code> för att ange en SQL SELECT-sats, som taggens innehåll. Länkning till andra datakällor kan uppnås med <link xref="variables-syntax">variabler</link> i SQL-koden för SELECT.

source: &lt;data&gt; &lt;query title="Customers" id="customers"&gt; SELECT id, name FROM customers where name like ##name::string &lt;/query&gt; &lt;query title="Customer's details" id="cust_details"&gt; SELECT * FROM customers WHERE id=##customers@id::int &lt;/query&gt; &lt;/data&gt;
sv: &lt;data&gt; &lt;query title="Kunder" id="customers"&gt; SELECT id, name FROM customers where name like ##name::string &lt;/query&gt; &lt;query title="Kunddetaljer" id="cust_details"&gt; SELECT * FROM customers WHERE id=##customers@id::int &lt;/query&gt; &lt;/data&gt;

source: For example the previous XML specification defines two data sources:
sv: Den föregående XML-specifikationen definierar till exempel två datakällor:

source: the <code>customers</code> data source which selects some fields from the <em>customers</em> table, and which depends on a string variable named <code>name</code>. This variable has to be set when the data sources are executed because it won't be exported by any data source in this specification.
sv: datakällan <code>customers</code> som väljer några fält från tabellen <em>customers</em>, och vilken beror på en strängvariabel med namn <code>name</code>. Denna variabel måste ställas in när datakällorna exekveras eftersom den inte kommer att exporteras av någon datakälla i denna specifikation.

source: the <code>cust_details</code> data source which selects all the details of a customer specified using its ID. This second data source depends on the previous one because the <code>customers@id</code> variable is exported from the <code>customers</code> data source.
sv: datakällan <code>cust_details</code> som väljer alla detaljer för en kund som anges med sitt ID. Denna andra datakälla beror på den föregående eftersom variabeln <code>customers@id</code> exporteras från datakällan <code>customers</code>.

source: Executing this data sources specification will create two tabular views: one where you can select a customer, and one which displays all the attributes for the selected customer.
sv: Att exekvera denna datakällspecifiktion kommer skapa två tabellvyer: en där du kan välja en kund, och en som visar alla attribut för den valda kunden.

source: Each data source defined by a <code>&lt;query&gt;</code> tag exports the following variable for each column of the resulting data set (the variable's type is the same as the column's type):
sv: Varje datakälla som definieras av en <code>&lt;query&gt;</code>-tagg exporterar följande variabel för varje kolumn i den resulterande datamängden (variabelns typ är samma som kolumnens typ):

source: <code>&lt;data source ID&gt;@&lt;column position&gt;</code> where the column's position starts at 1
sv: <code>&lt;datakäll-ID&gt;@&lt;kolumnposition&gt;</code> där kolumnens position startar vid 1

source: <code>&lt;data source ID&gt;@&lt;column name&gt; if the data set's column is a table column</code>
sv: <code>&lt;datakäll-ID&gt;@&lt;kolumnnamn&gt;</code> om datamängdens kolumn är en tabellkolumn

source: The <code>&lt;table&gt;</code> tag
sv: Taggen <code>&lt;table&gt;</code>

source: Use the <code>&lt;table&gt;</code> tag to define a data source which will display the contents of a table. This tag:
sv: Använd taggen <code>&lt;table&gt;</code> för att definiera en datakälla som kommer visa innehållet för en tabell. Denna tagg:

source: requires the "name" attribute which represents the table name.
sv: kräver attributet ”name” som representerar tabellnamnet.

source: can have a "id" attribute corresponding to the data source's ID. If not present, and ID will be assigned automatically.
sv: kan ha ett attribut ”id” som motsvarar datakällans ID. Om ej närvarande kommer ett ID att tilldelas automatiskt.

source: can contain a <code>&lt;depend&gt;</code> tag which defines a dependency on another data source with the "foreign_key_table" attribute defining the name of the table to which there are foreign keys used to determine the dependency, and the "id" attribute can specify a data source ID if different than the aforementioned table
sv: kan innehålla en tagg <code>&lt;depend&gt;</code> som definierar ett beroende på en annan datakälla med attributet ”foreign_key_table” som definierar namnet på tabellen till vilken det finns främmande nycklar som används för att avgöra beroendet, och attributet ”id” kan ange ett datakäll-ID om det skiljer sig från tidigare nämnd tabell

source: The <code>&lt;depend&gt;</code> tag, which, for a data source from a table, defines a dependency to another data source from a table:
sv: Taggen <code>&lt;depend&gt;</code>, som för en datakälla från en tabell definierar ett beroende till en annan datakälla från en tabell:

source: requires the "foreign_key_table" attribute defining the name of the table to which there are foreign keys used to determine the dependency
sv: kräver att attributet ”foreign_key_table” definierar namnet på tabellen till vilken det finns främmande nycklar som används för att avgöra beroendet

source: can have a "id" attribute corresponding to the ID of the referenced data source. If not provided, then the dependency may fail if there is no data source which ID is the"foreign_key_table" attribute.
sv: kan ha ett attribut ”id” som motsvarar ID för den refererade datakällan. Om detta inte tillhandahålls kan beroendet misslyckas om det inte finns någon datakälla vars ID är attributet ”foreign_key_table”.

source: can contain one or more <code>&lt;column&gt;</code> tag which contents define the columns to identify the foreign key to use; this is necessary if there are multiple foreign keys, and can be omitted if there is only one possible foreign key. The listed columns are the one from the table where the foreign key exists.
sv: kan innehålla en eller flera <code>&lt;column&gt;</code>-taggar vars innehåll definierar kolumnerna som identifierar den främmande nyckeln att använda: detta är nödvändigt om det finns flera främmande nycklar, och kan skippas om det bara finns en möjlig främmande nyckel. De listade kolumnerna är de från tabellen där den främmande nyckeln finns.

source: the <code>customers</code> data source which selects all the contents of the <em>customers</em> table.
sv: datakällan <code>customers</code> som väljer allt innehåll i tabellen <em>customers</em>.

source: the <code>orders</code> data source which selects among contents of the <code>orders</code> table, the rows which correspond to a row in the <code>customers</code> table using the foreign key on table orders which involves the "orders.customer_id" column and the primary key of the customers table. The "id" attribute of the <code>&lt;depend&gt;</code> tag is necessary here to identify referenced the data source.
sv: datakällan <code>orders</code> som väljer bland innehållet för tabellen <code>orders</code>, raderna som motsvarar en rad i tabellen <code>customers</code> med den främmande nyckeln på tabellen orders vilken involverar kolumnen ”orders.customer_id” och den primära nyckeln för kundtabellen. Attributet ”id” för taggen <code>&lt;depend&gt;</code> är nödvändigt här för att identifiera den refererade datakällan.

source: Note in this example that:
sv: Observera i detta exempel att:

source: you don't have to specify the fields involved in the foreign key linking the <code>orders</code> and <code>customers</code> tables
sv: du inte behöver ange fälten som är involverade i att den främmande nyckeln länkar tabellerna <code>orders</code> och <code>customers</code>

source: the data sources IDs have been assigned the names of the selected tables as no "id" attribute has been specified for the <code>&lt;table&gt;</code> tags.
sv: datakällornas ID:n har tilldelats namnen på de valda tabellerna då inget attribut ”id” har angivits för <code>&lt;table&gt;</code>-taggarna.

source: Each data source defined by a <code>&lt;query&gt;</code> tag exports the following variable for each table's column (the variable's type is the same as the column's type):
sv: Varje datakälla som definieras av en <code>&lt;query&gt;</code>-tagg exporterar följande variabel för varje tabells kolumn (variabelns typ är samma som kolumnens typ):

source: <code>&lt;data source ID&gt;@&lt;column name&gt;</code>
sv: <code>&lt;datakäll-ID&gt;@&lt;kolumnnamn&gt;</code>

source: The data manager's data sources editor
sv: Datahanterarens redigerare för datakällor

source: To be done.
sv: Väntar på att göras.

source: Declared foreign keys
sv: Deklarerade främmande nycklar

source: All the foreign key constraints (where the contents of one or more columns in a table is constrained to be among the values of one or more columns of another table) are analysed and reported in the <link xref="schema-browser-perspective">Schema Browser perspective</link>. Foreign key constraints help understand the database schema and is automatically used where appropriate by the application.
sv: Alla främmande nyckelbegränsningar (där innehållet av en eller flera kolumner i en tabell begränsas till att vara bland värdena av en eller flera kolumner i en annan tabell) analyseras och rapporteras i <link xref="schema-browser-perspective">schemabläddrarperspektivet</link>. Främmande nyckelbegränsningar hjälper till att förstå databasschemat och används automatiskt av programmet där så är lämpligt.
