Repository: GNOME/libgda
Catalog: tools/browser/help/*/*.po
Languages: sv

source: LDAP connections are different than other connections in a way that an LDAP database stores data in a hierarchical way, in the DIT (Directory Information Tree), whereas other databases accessible using the <app>gda-browser</app> application are relational databases.
sv: LDAP-anslutningar skiljer sig från andra anslutningar på det sätt att en LDAP-databas lagrar data på ett hierarkiskt sätt, i kataloginformationsträdet DIT (Directory Information Tree), medan andra databaser som är åtkomliga med <app>gda-browser</app> är relationsdatabaser.

source: As a consequence, LDAP connections are treaded specially: as normal connections with tables (see the table mapping explained next), and through the presence of the <link xref="ldap-browser-perspective"> LDAP browser perspective</link>
sv: Som en konsekvens av detta hanteras LDAP-anslutningar speciellt: som normala anslutningar med tabeller (se tabellmappningen förklarad härnäst), och genom närvaron av <link xref="ldap-browser-perspective"> LDAP-bläddrarperspektivet</link>

source: Note that LDAP connections may not be available is either the LDAP database provider is not installed or if the LDAP support was disabled during the compilation.
sv: Observera att LDAP-anslutningar kanske inte är tillgängliga om antingen LDAP-databasleverantören inte installerats eller om LDAP-stödet inaktiverades under kompilering.

source: LDAP table's mapping
sv: Mappning för LDAP-tabell

source: Within an LDAP connection, it is possible to declare virtual tables which are mapped to an LDAP search. These virtual tables can then later be used like any other table. The first column of each LDAP virtual table will always be the DN (Distinguished Name) of the entry represented in the row; the other columns depend on the table definition.
sv: I en LDAP-anslutning är det möjligt att deklarera virtuella tabeller som mappas till en LDAP-sökning. Dessa virtuella tabeller kan sedan användas som vilken annan tabell som helst. Den första kolumnen för varje LDAP-virtuell tabell kommer alltid vara DN (Distinguished Name) för posten som representeras i raden, de andra kolumnerna beror på tabelldefinitionen.

source: An LDAP virtual table is defined by the following attributes:
sv: En LDAP-virtuell tabell definieras av följande attribut:

source: a table name
sv: ett tabellnamn

source: the base DN for the search: the LDAP entry at which the search begins (if not specified then the top level entry of the LDAP connection is used)
sv: bas-DN för sökningen: LDAP-posten vid vilken sökningen börjar (om ej angiven så används toppnivåposten för LDAP-anslutningen)

source: the search filter: a valid LDAP search filter (if none is provided then the default search filter is "(objectClass=*)", requesting any LDAP entry).
sv: sökfiltret: ett giltigt LDAP-sökfilter (om inget har angivits så är standardsökfiltret ”(objectClass=*)”, vilket begär alla LDAP-poster).

source: the attributes: the attributes to retrieve, each attribute will be mapped to a column of the table. The attributes must be a comma separated list of attributes, where each attribute can optionally be assigned a type and a multi value option (see below).
sv: attributen: attributen att erhålla, varje attribut kommer att mappas till en kolumn i tabellen. Attributen måste vara en kommaseparerad lista över attribut, där varje attribut valfritt kan tilldelas en typ och ett alternativ för flera värden (se nedan).

source: the scope: the search scope, "subtree" (to search the base DN and the entire sub tree below), "onelevel" (to search the immediate children of the base DN entry only), or "base" (to search the base DN only)
sv: scope: sökningens omfattning, ”subtree” (för att söka bas-DN och hela underträdet), ”onelevel” (för att endast söka omedelbara barn till bas-DN-posten), eller ”base” (för att endast söka bas-DN)

source: LDAP table's properties
sv: En LDAP-tabells egenskaper

source: For example in the figure above, the "users" table will "contain" all the LDAP entries from the top level LDAP entry of the connection, and have 3 columns: the DN, the "cn" and the "jpegPhoto".
sv: I figuren ovan kommer exempelvis tabellen ”users” att ”innehålla” alla LDAP-poster från LDAP-toppnivåposten för anslutningen, och ha 3 kolumner: DN, ”cn” samt ”jpegPhoto”.

source: Attributes to columns mapping
sv: Mappning av attribut till kolumner

source: As mentioned in the previous section, each attribute will be mapped to a column. The column type is normally automatically determined (string, number, ...) but can be forced by appending to the attribute name the "::&lt;type&gt;" for the requested type.
sv: Som nämndes i föregående avsnitt så kommer varje attribut att mappas till en kolumn. Kolumntypen avgörs vanligen automatiskt (sträng, tal, …) men kan tvingas genom att till attributnamnet lägga till "::&lt;typ&gt;" för den begärda typen.

source: Also, because some attributes can have multiple values, the table construction handles multi-valued attributes in different ways, depending on each attribute's options. An option can be specified by appending the "::&lt;option&gt;" to the attribute name. Valid options are:
sv: Då vissa attribut även kan ha flera värden, så hanterar tabellkonstruktionen flervärda attribut på olika sätt, beroende på alternativen för varje attribut. Ett alternativ kan anges genom att lägga till ”::&lt;alternativ&gt;” till attributnamnet. Giltiga alternativ är:

source: "NULL" or "0": a NULL value will be returned for the attribute
sv: ”NULL” eller ”0”: ett NULL-värde kommer att returneras för attributet

source: "CSV": a comma separated value with all the values of the attribute will be returned. This only works for string attribute types.
sv: ”CSV”: ett kommaseparerat värde med alla värden för attributet kommer att returneras. Detta fungerar endast för strängattributtyper.

source: "MULT" or "*": a row will be returned for each value of the attribute, effectively multiplying the number of returned rows
sv: ”MULT” eller ”*”: en rad kommer returneras för varje värde på attributet, vilket multiplicerar antalet returnerade rader

source: "1": only the first value of the attribute will be used, the other values ignored
sv: ”1”: endast attributets första värde kommer att användas, de andra värdena ignoreras

source: "CONCAT": the attributes' values are concatenated (with a newline char between each value)
sv: ”CONCAT”: attributens värden konkateneras (med ett nyradstecken mellan varje värde)

source: "ERROR": an error value will be returned (this is the default behaviour)
sv: ”ERROR”: ett felvärde kommer att returneras (detta är standardbeteendet)

source: SQL usable with LDAP connections
sv: SQL användbar med LDAP-anslutningar

source: You can use the SQL understood by <link href="http://sqlite.org/lang.html">SQLite</link> in any LDAP connection. Be aware however that if you define database objects (outside of the extended SQL presented next section), they will be lost the next time the LDAP connection is opened.
sv: Du kan använda SQL som förstås av <link href="http://sqlite.org/lang.html">SQLite</link> i alla LDAP-anslutningar. Var dock medveten om att ifall du definierar databasobjekt (utanför den utökade SQL som presenteras i nästa avsnitt), så kommer de att gå förlorade nästa gång LDAP-anslutningen öppnas.

source: So it is perfectly safe for example to create a table to store some LDAP data which may require a long operation to obtain, but after closing the LDAP connection, the table and its data will be lost.
sv: Så det är exempelvis helt säkert att skapa en tabell för att lagra lite LDAP-data som kan kräva en lång operation för att erhålla, men efter att LDAP-anslutningen stängs kommer tabellen och dess data att gå förlorade.

source: SQL extension to handle LDAP tables
sv: SQL-utökning för att hantera LDAP-tabeller

source: LDAP tables can be created using an extended set of SQL commands:
sv: LDAP-tabeller kan skapas med en utökad uppsättning SQL-kommandon:

source: <code>CREATE LDAP TABLE &lt;table_name&gt; [BASE='&lt;base_dn&gt;'] [FILTER='&lt;filter&gt;'] [ATTRIBUTES='&lt;filter&gt;'] [SCOPE='&lt;filter&gt;']</code> to declare a new LDAP virtual table
sv: <code>CREATE LDAP TABLE &lt;tabellnamn&gt; [BASE='&lt;bas-dn&gt;'] [FILTER='&lt;filter&gt;'] [ATTRIBUTES='&lt;filter&gt;'] [SCOPE='&lt;filter&gt;']</code> för att deklarera en ny LDAP-virtuell tabell

source: <code>DESCRIBE LDAP TABLE &lt;table_name&gt;</code> to show LDAP virtual table's definition
sv: <code>DESCRIBE LDAP TABLE &lt;tabellnamn&gt;</code> för att visa definition för LDAP-virtuell tabell

source: <code>ALTER LDAP TABLE &lt;table_name&gt; [BASE='&lt;base_dn&gt;'] [FILTER='&lt;filter&gt;'] [ATTRIBUTES='&lt;filter&gt;'] [SCOPE='&lt;filter&gt;']</code> to modify an LDAP virtual table's definition (only the specified part is actually modified)
sv: <code>ALTER LDAP TABLE &lt;tabellnamn&gt; [BASE='&lt;bas-dn&gt;'] [FILTER='&lt;filter&gt;'] [ATTRIBUTES='&lt;filter&gt;'] [SCOPE='&lt;filter&gt;']</code> för att ändra en LDAP-virtuell tabells definition (endast den angivna delen ändras)

source: <code>DROP LDAP TABLE &lt;table_name&gt;</code> to remove an LDAP virtual table. Note that the usual <code>DROP TABLE &lt;table_name&gt;</code> can also be used instead.
sv: <code>DROP LDAP TABLE &lt;tabellnamn&gt;</code> för att ta bort en LDAP-virtuell tabell. Observera att den vanliga <code>DROP TABLE &lt;tabellnamn&gt;</code> också kan användas istället.

source: For example the following SQL code:
sv: Till exempel bör följande SQL-kod:

source: should display twice the same results, which list all the LDAP entries of the "inetOrgPerson" class with a CommonName (cn) containing the "john" string.
sv: visa samma resultat två gånger, vilket listar alla LDAP-poster för klassen ”inetOrgPerson” med ett CommonName (cn) som innehåller strängen ”john”.
