Repository: GNOME/libgda
Catalog: tools/browser/help/*/*.po
Languages: sv

source: Note that any given history item can also be removed individually using the <key>Suppr</key> key.
sv: Observera att ett givet historikobjekt också kan tas bort individuellt med knappen <key>Super</key>.

source: Execution results
sv: Exekveringsresultat

source: The Execution results part displays the execution result of the currently selected execution history item, as a table for SELECT statement, giving information for other types of statement, or giving the execution error notice if the execution failed.
sv: Delen för exekveringsresultat visar exekveringsresultatet för den för närvarande valda exekveringshistorikposten, som en tabell för en SELECT-sats, med information för andra sorters satser, eller en anteckning om exekveringsfelet om exekveringen misslyckades.

source: The schema browser perspective
sv: Schemabläddrarperspektivet

source: Use the schema browser perspective to understand the database's organisation (schema). To switch to this perspective, use the <guiseq><gui>Perspective</gui><gui>Schema browser</gui></guiseq> menu, or the <keyseq><key>Ctrl</key><key>B</key></keyseq> shortcut.
sv: Använd schemabläddrarperspektivet för att förstå databasens organisation (schema). För att växla till detta perspektiv, använd menyn <guiseq><gui>Perspektiv</gui><gui>Schemabläddrare</gui></guiseq>, eller kortkommandot <keyseq><key>Ctrl</key><key>B</key></keyseq>.

source: The perspective is divided in two horizontal panes: the left pane for the user defined favorites, and the right pane being the action area.
sv: Perspektivet delas upp i två horisontella paneler: den vänstra panelen för användardefinierade favoriter, och högerpanelen är åtgärdsområdet.

source: Schema browser perspective's default view
sv: Standardvy för schemabläddrarperspektivet

source: The default Schema browser perspective
sv: Standardschemabläddrarperspektivet

source: The left part of the perspective lists the favorite database objects or diagrams. Double clicking on a favorite opens its properties in the right pane.
sv: Den vänstra delen av perspektivet listar databasobjekten och diagrammen som är favoriter. Att dubbelklicka på en favorit öppnar dess egenskaper i högerpanelen.

source: The right pane is composed of several types of tabs:
sv: Högerpanelen består av flera sorters flikar:

source: a tab listing all the database's tables and views, in a <em>cloud</em> view where the tables with the more relations to other tables being displayed in a larger font; this tab is always present
sv: en flik som listar databasens alla tabeller och vyer, i en <em>moln</em>-vy där tabellerna med fler relationer till andra tabeller visas i ett större typsnitt; denna flik är alltid närvarande

source: zero or more tabs representing a table or views' properties: the list of columns, the list of constraints (primary or foreign keys, and unique constraints), a <link xref="diagram">diagram</link> showing the related tables, and an area to define display preferences for each column's data
sv: noll eller flera flikar som representerar en tabells eller vys egenskaper: listan över kolumner, listan över begränsningar (primära eller främmande nycklar, och unika begränsningar), ett <link xref="diagram">diagram</link> som visar de relaterade tabellerna, och ett område för att definiera visningsinställningar för varje kolumns data

source: zero or more <link xref="diagram">diagrams</link> in which any number of tables can be represented, where they are linked using their relations (as foreign key constraints)
sv: noll eller flera <link xref="diagram">diagram</link> i vilka ett godtyckligt antal tabeller kan representeras, där de länkas med sina relationer (som främmande nyckelbegränsningar)

source: Tab showing information about a table
sv: Flik som visar information om en tabell

source: Example of information displayed for each table, note the difference between foreign keys implemented in the database and <link xref="declared-fk">declared foreign keys</link>
sv: Exempel på information som visas för varje tabell, observera skillnaden mellan främmande nycklar som är implementerade i databasen och <link xref="declared-fk">deklarerade främmande nycklar</link>

source: Transactions
sv: Transaktioner

source: Transactions can be started, committed or rolled back on a per connection basis:
sv: Transaktioner kan startas, checkas in eller rullas tillbaka per anslutning:

source: use the <media type="image" mime="image/png" src="figures/trans-begin.png"/> toolbar button to start a transaction
sv: använd verktygsfältsknappen <media type="image" mime="image/png" src="figures/trans-begin.png"/> för att starta en transaktion

source: use the <media type="image" mime="image/png" src="figures/trans-commit.png"/> toolbar button to commit the current transaction (apply all the changes)
sv: använd verktygsfältsknappen <media type="image" mime="image/png" src="figures/trans-commit.png"/> för att checka in aktuell transaktion (tillämpa alla ändringarna)

source: use the <media type="image" mime="image/png" src="figures/trans-rollback.png"/> toolbar button to abort the current transaction (forget all the changes)
sv: använd verktygsfältsknappen <media type="image" mime="image/png" src="figures/trans-rollback.png"/> för att avbryta aktuell transaktion (glöm alla ändringar)

source: A transaction may be started automatically when executing a SELECT statement which involves binary objects (BLOBs), and the transaction may be locked while the resulting data set is kept in memory (to get rid of a data set in a <link xref="query-execution-perspective">query execution perspective</link>, clear the history item relating to the data set).
sv: En transaktion kan startas automatiskt vid exekvering av en SELECT-sats som involverar binära objekt (BLOB-objekt), och transaktionen kan låsas medan resulterande datamängd hålls i minnet (för att bli av med en datamängd i ett <link xref="query-execution-perspective">frågeexekveringsperspektiv</link>, rensa historikobjektet som är relaterat till datamängden).

source: Inserting data in a table
sv: Infoga data i en tabell

source: From the <link xref="schema-browser-perspective">schema browser perspective</link>, when a table's properties is displayed in a tab, use the <guiseq><gui>Table</gui><gui>Insert data</gui></guiseq> menu to have a popup appear containing a data entry for each column of the table to insert data into.
sv: Från <link xref="schema-browser-perspective">schemabläddrarperspektivet</link>, när en tabells egenskaper visas i en flik, använd menyn <guiseq><gui>Tabell</gui><gui>Infoga data</gui></guiseq> för att visa en poppupp som innehåller ett datafält för varje kolumn i tabellen att infoga data i.

source: A popup similar to the following will appear:
sv: En poppupp liknande den nedan kommer att visas:

source: Popup to insert data into table
sv: Poppupp för att infoga data i en tabell

source: A popup to insert data in a table
sv: En poppupp för att infoga data i en tabell

source: The noticeable points here are:
sv: Punkter vi kan se här:

source: There is one data entry per column in the table, with the exception (not shown in this figure) of multiple foreign key fields for which a single drop down choice widget is shown;
sv: Det finns ett datafält per kolumn i tabellen, med undantag (inte visat i figuren) för flera fält för främmande nycklar för vilka en ensam rullgardinsvalkomponent visas;

source: Each data entry has a small button on the right giving information about the corresponding data entry, and allowing you to reset the data entry's value to the value it had before any modification done, to set it to NULL or to set it to a default value. The button's color has the following signification:
sv: Varje datafält har en liten knapp till höger som ger information om motsvarande datafält, och låter dig återställa datafältets värde till värdet det hade innan någon ändring gjordes, för att ställa in det till NULL eller ett standardvärde. Knappens färg har följande betydelse:

source: Red: means the current value in the data entry is invalid
sv: Röd: betyder att aktuellt värde i datafältet är ogiltigt

source: Blue: means the current value in the data entry is unused and the column's default value will be used instead (useful for example for auto incremented columns)
sv: Blå: betyder att aktuellt värde i datafältet är oanvänt och kolumnens standardvärde kommer att användas istället (exempelvis användbart för automatiskt inkrementerade kolumner)

source: Green: means the current value in the data entry is NULL
sv: Grön: betyder att aktuellt värde i dataposten är NULL

source: Same color as the rest of the UI: means none of the above situations apply
sv: Samma färg som resten av användargränssnittet: betyder att ingen av situationerna ovan är tillämpliga

source: Columns which are foreign keys to other tables are presented as a drop down combo box where you can only choose among the values in the referenced table (hint: to have that values list refreshed you should close the popup dialog and reopen it);
sv: Kolumner som är främmande nycklar till andra tabeller presenteras som en rullgardinskombinationsruta där du endast kan välja bland värdena i den refererade tabellen (tips: för att uppdatera värdelistan kan du stänga poppuppdialogen och öppna den på nytt);

source: Variables in SQL code
sv: Variabler i SQL-kod

source: Variables (sometimes refered to as <em>placeholders</em>) are places in SQL code which are replaced by actual values when the SQL code is executed. The benefits are faster execution times (as the SQL code is parsed only once) and a protection against SQL injection vulnerabilities.
sv: Variabler (ibland refererade till som <em>platshållare</em>) är platser i SQL-kod som ersätts av faktiska värden när SQL-koden exekveras. Fördelarna är snabbare exekveringstid (då SQL-koden endast behöver tolkas en gång) och skydd mot SQL-injektionssårbarheter.

source: Variables can be used in any SQL code, and are defined using the following syntax:
sv: Variabler kan användas i all SQL-kod, och definieras med följande syntax:

source: ##&lt;variable name&gt;[::&lt;variable type&gt;[::NULL]]
sv: ##&lt;variabelnamn&gt;[::&lt;variabeltyp&gt;[::NULL]]

source: the <em>variable name</em> can contain any SQL identifier character or among the <code>+-.|@?</code>characters (no space allowed)
sv: <em>variabelnamnet</em> kan innehålla alla SQL-identifierartecken eller tecknen <code>+-.|@?</code> (inga blanksteg tillåtna)

source: the <em>variable type</em> can be among: <code>string</code>, <code>boolean</code>, <code>int</code>, <code>date</code>, <code>time</code>, <code>timestamp</code>, <code>guint</code>, <code>blob</code> and <code>binary</code>
sv: <em>Variabeltypen</em> kan vara någon av: <code>string</code>, <code>boolean</code>, <code>int</code>, <code>date</code>, <code>time</code>, <code>timestamp</code>, <code>guint</code>, <code>blob</code> och <code>binary</code>

source: the <code>::NULL</code> can be appended to specify that the variable may take the special <code>NULL</code> value.
sv: <code>::NULL</code> kan läggas till för att ange att variabeln kan ta det speciella värdet <code>NULL</code>.

source: Examples:
sv: Exempel:

source: Connections binding (i.e. virtual connections)
sv: Anslutningsbindning (d.v.s. virtuella anslutningar)

source: Connection binding is a feature which allows to "bind" several connections and/or imported data sets into a single connection, which can be used almost like a regular connection.
sv: Anslutningsbindning är en funktion som låter dig ”binda” flera anslutningar och/eller importerade datamängder till en enskild anslutning, vilken kan användas nästan som en vanlig anslutning.

source: This feature is useful when one needs to execute an SQL command (for example to extract data) taking into account data actually stored in different databases. Without this feature, the way to achieve the same result is by exporting the necessary data from each database and work on the data outside of the databases.
sv: Denna funktion är användbar när man behöver exekvera ett SQL-kommando (exempelvis för att extrahera data) och ta i beräkning data som faktiskt lagras i olika databaser. Utan denna funktion är sättet att åstadkomma samma resultat att exportera nödvändiga data från varje databas och sedan arbeta med dessa data utanför databaserna.

source: To create a new "bound" connection (or "virtual" connection), use the <guiseq><gui>Connection</gui><gui>Bind connection</gui></guiseq> menu, or the <keyseq><key>Ctrl</key><key>i</key></keyseq> shortcut. This pops up a new dialog window from which elements to be included in the "bound" connection can be defined as shown below.
sv: För att skapa en ny ”bunden” (eller ”virtuell”) anslutning, använd menyn <guiseq><gui>Anslutning</gui><gui>Bind anslutning</gui></guiseq>, eller kortkommandot <keyseq><key>Ctrl</key><key>i</key></keyseq>. Detta poppar upp ett nytt dialogfönster från vilket element som ska inkluderas i den ”bundna” anslutningen kan definieras på det sätt som visas nedan.

source: Dialog to create a new virtual connection
sv: Dialogruta för att skapa en ny virtuell anslutning

source: Here the current connection (c1) will be bound in the "c1" schema
sv: Här kommer aktuell anslutning (c1) att bindas till schemat ”c1”

source: Use the <guiseq><gui>Add binding</gui></guiseq> button to either:
sv: Använd knappen <guiseq><gui>Lägg till bindning</gui></guiseq> för att antingen:

source: bind a connection to include all the tables of that connection: use the <guiseq><gui>Bind a connection</gui></guiseq> option. This option simply adds a new element in the dialog, to specify a schema name and select an existing connection
sv: binda en anslutning för att inkludera alla tabeller för den anslutningen: använd alternativet <guiseq><gui>Bind en anslutning</gui></guiseq>. Detta alternativ lägger helt enkelt till ett nytt element i dialogrutan, för att ange ett schemanamn och välja en befintlig anslutning

source: bind a data set to import data from a text file as a single table: use the <guiseq><gui>Bind a data set</gui></guiseq> option. See section below for more information.
sv: binda en datamängd för att importera data från en textfil som en ensam tabell: använd alternativet <guiseq><gui>Bind en datamängd</gui></guiseq>. Se avsnittet nedan för mer information.

source: Use case for virtual connections
sv: Användningsfall för virtuella anslutningar

source: To illustrate virtual connection usage, let's define a simple use case and see how it's useful. Suppose you have a database which contains the list of servers which you are responsible for. For simplicity, let's assume that the database contains a table named "server" with the following definition:
sv: Låt oss definiera ett enkelt användningsfall för att illustrera användning av virtuella anslutningar och hur de kan vara användbara. Anta att du har en databas vilken innehåller listan över servrar som du är ansvarig för. Låt oss för enkelhets skull anta att databasen innehåller en tabell med namnet ”server” med följande definition:

source: Let's suppose this table contains the following information:
sv: Låt oss anta att denna tabell innehåller följande information:

source: Now let's assume you have a third party program which gives you a list of servers for which there might be a problem, the output of this program is a CSV file with a column for the server name, a column for the error code, and a column describing the problem. Let's assume the CSV file has the following contents:
sv: Anta nu att du har ett tredjepartsprogram som ger dig en lista över servrar för vilka det kan finnas problem. Utdata för detta program är en CSV-fil med en kolumn för servernamnet, en kolumn för felkoden, och en kolumn som beskriver problemet. Låt oss anta att CSV-filen har följande innehåll:

source: Let's suppose now you want to know all the servers, where they are located where there is a problem with error code 0. The solution is to bind the connection to the database (for example in the "c1" schema), import the problems CSV file (for example in the "tab" table), and execute the following SQL command:
sv: Anta nu att du vill känna till alla servrar och var de finns, då de har ett problem med felkod 0. Lösningen är att binda anslutningen till databasen (exempelvis schemat ”c1”), importera CSV-filen med problem (exempelvis i tabellen ”tab”), och exekvera följande SQL-kommando:

source: Which returns the expected results as shown in the following figure:
sv: Vilket returnerar de förväntade resultaten som visas i följande figur:

source: Expected results from virtual connection
sv: Förväntade resultat från virtuell anslutning

source: Importing a data set into a virtual connection
sv: Importera en datamängd till en virtuell anslutning

source: To import a data set into a table in the virtual connection (for example to import the "problems.csv" file from the use case), use the <guiseq><gui>Bind a data set</gui></guiseq> option from the virtual connection creation dialog:
sv: För att importera en datamängd till en tabell i den virtuella anslutningen (till exempel för att importera filen ”problems.csv” i användningsfallet), använd alternativet <guiseq><gui>Bind en datamängd</gui></guiseq> dialogrutan för skapande av virtuell anslutning:

source: Import a data set into a virtual connection - 1
sv: Importera en datamängd till en virtuell anslutning - 1

source: From there use the <guiseq><gui>Import</gui></guiseq> button which allows you to select a file to import and also define some import options (file encoding, file type, ...) After this step, the virtual connection is ready to be used:
sv: Använd därifrån knappen <guiseq><gui>Importera</gui></guiseq> vilken låter dig välja en fil att importera samt även definiera några importalternativ (filkodning, filtyp, …) Efter detta steg är den virtuella anslutningen klar att användas:

source: Import a data set into a virtual connection - 2
sv: Importera en datamängd till en virtuell anslutning - 2

source: The resulting virtual connection, identified as "c2" here is opened in its own new window:
sv: Den resulterande virtuella anslutningen, här identifierad som ”c2” öppnas i ett eget nytt fönster:

source: New opened virtual connection
sv: Ny öppnad virtuell anslutning

source: SQL usable with virtual connections
sv: SQL som går använda med virtuella anslutningar

source: You can use the SQL understood by <link href="http://sqlite.org/lang.html">SQLite</link> in any virtual connection. Be aware however that if you define database objects (outside of the extended SQL presented next section), they will be lost the next time the virtual connection is opened.
sv: Du kan använda SQL som förstås av <link href="http://sqlite.org/lang.html">SQLite</link> i alla virtuella anslutningar. Var dock medveten om att ifall du definierar databasobjekt (utanför den utökade SQL som presenteras i nästa avsnitt), så kommer de att gå förlorade nästa gång den virtuella anslutningen öppnas.

source: See the <link xref="sql-sqlite">SQL understood by LDAP connections and virtual connections</link> section for more information.
sv: Se avsnittet <link xref="sql-sqlite">SQL som förstås av LDAP-anslutningar och virtuella anslutningar</link> för mer information.

source: The LDAP browser perspective
sv: LDAP-bläddrarperspektivet

source: Use the LDAP browser perspective to view and manipulate data stored in an LDAP directory. To switch to this perspective, use the <guiseq><gui>Perspective</gui><gui>LDAP browser</gui></guiseq> menu, or the <keyseq><key>Ctrl</key><key>P</key></keyseq> shortcut. This perspective is of course only available when the opened connection is an <link xref="ldap-connection">LDAP connection</link>.
sv: Använd LDAP-bläddrarperspektivet för att visa och manipulera data som lagrats i en LDAP-katalog. För att växla till detta perspektiv, använd menyn <guiseq><gui>Perspektiv</gui><gui>LDAP-bläddrare</gui></guiseq>, eller kortkommandot <keyseq><key>Ctrl</key><key>P</key></keyseq>. Detta perspektiv är förstås bara tillgängligt när den öppnade anslutningen är en <link xref="ldap-connection">LDAP-anslutning</link>.

source: The perspective is divided in two horizontal panes: the left pane for the user defined favorites (to hold references to specific LDAP entries or specific LDAP classes), and the right pane being the action area.
sv: Perspektivet delas upp i två horisontella paneler: vänsterpanelen för användardefinierade favoriter (för att hålla referenser till specifika LDAP-poster eller specifika LDAP-klasser), och högerpanelen är åtgärdsområdet.

source: LDAP browser's entry tab
sv: Postflik för LDAP-bläddraren

source: LDAP entries tab
sv: LDAP-postflik

source: The left part of the perspective lists the favorite LDAP entries or classes. Double clicking on a favorite opens its properties in the right pane. Note that the LDAP entries favorites will always appear before the classes favorites.
sv: Den vänstra delen av perspektivet listar LDAP-posterna och klasserna som är favoriter. Att dubbelklicka på en favorit öppnar dess egenskaper i högerpanelen. Observera att LDAP-posterna som är favoriter alltid kommer att listas före klassfavoriterna.

source: tabs to explore the LDAP DIT (Directory Information Tree): when an entry is selected from the tree, its attributes are displayed (only the valued attributes are displayed, the ones with no value are hidden), and the entry's DN (Distinguished Name) is always displayed first. Also note that the children of each entry are only fetched when necessary to avoid unnecessary requests to the LDAP server.
sv: flikar för att utforska LDAP:s kataloginformationsträd DIT (Directory Information Tree): då en post väljs från trädet så visas dess attribut (endast attributen med värde visas, de utan värden är dolda), och postens DN (Distinguished Name) visas alltid först. Observera också att varje posts barn endast hämtas när nödvändigt för att undvika onödiga förfrågningar till LDAP-servern.

source: tabs to explore the LDAP's classes, see figure below. For a selected class, all the information regarding the class is displayed (description, OID, type, ...)
sv: flikar för att utforska LDAP:s klasser, se figur nedan. För en vald klass visas all information om klassen (beskrivning, OID, typ, …)

source: tabs to perform LDAP searches, see figure below. An LDAP search definition can be saved as a virtual table, see the <link xref="ldap-connection#ldap-table-mapping">LDAP table's mapping</link>.
sv: flikar för att utföra LDAP-sökningar, se figur nedan. En LDAP-sökdefinition kan sparas som en virtuell tabell, se <link xref="ldap-connection#ldap-table-mapping">mappning för LDAP-tabell</link>.

source: LDAP browser's classes tab
sv: Klassflik för LDAP-bläddraren

source: LDAP classes tab
sv: LDAP-klassflik

source: LDAP browser's search tab
sv: Sökflik för LDAP-bläddraren

source: LDAP search tab
sv: LDAP-sökflik

source: Links in these tabs (identified by blue and underlined text) open a new tab, or use the first tab next to the current tab to display information about the selected link. For example in the figure above illustrating an LDAP entries tab, clicking on the "inetOrgPerson" will open a new "LDAP classes" tab and display the information about that class.
sv: Länkar i dessa flikar (identifierade av blå, understruken text) öppnar en ny flik, eller använder den första fliken intill den aktuella fliken för att visa information om den valda länken. Till exempel i figuren ovan som illustrerar en LDAP-postflik kommer att klicka på ”inetOrgPerson” att öppna en ny flik ”LDAP-klasser” och visa informationen om den klassen.

source: LDAP connections
sv: LDAP-anslutningar
