Repository: GNOME/libgda
Catalog: tools/browser/help/*/*.po
Languages: sv

source: However sometimes the designer of a database has forgotten or did not whish to use foreign key constraints, and so it is possible to "declare foreign keys" which are only declaration to the tool and not actually defined in the database.
sv: Ibland har dock designern av en databas glömt eller inte velat använda främmande nyckelbegränsningar, så därför är det möjligt att ”deklarera främmande nycklar” som endast deklareras för verktyget och inte faktiskt definierats i databasen.

source: Declared foreign keys in diagrams
sv: Deklarerade främmande nycklar i diagram

source: When displayed in diagrams, declared foreign keys are represented using a dashed line instead of a solid line for actual foreign keys
sv: Då de visas i diagram representeras deklarerade främmande nycklar med en streckad linje istället för en hel linje för faktiska främmande nycklar

source: Notes:
sv: Att notera:

source: the (foreign key name, table, referenced table) triplet uniquely identifies a declared foreign key and thus declaring a new foreign key with the same triplet will remove any previously declared one.
sv: trippeln (namn på främmande nyckel, tabell, refererad tabell) identifierar unikt en deklarerad främmande nyckel och därmed kommer en deklaration av en ny främmande nyckel med samma trippel att ta bort eventuella tidigare deklarerade sådana.

source: If the same constraint is actually represented by a real foreign key and also by a declared foreign key, then the real foreign key definition will mask the declared one
sv: Om samma begränsning faktiskt representeras av en riktig främmande nyckel samt även av en deklarerad främmande nyckel, så kommer definitionen för den riktiga främmande nyckeln att maskera den deklarerade

source: Declared foreign key don't have any policy to determine what action to perform on UPDATE or DELETE situations, so the reported policy will always be "not enforced"
sv: Deklarerade främmande nycklar har ingen policy för att avgöra vilken åtgärd som ska utföras vid UPDATE- eller DELETE-situationer, så den rapporterade policyn kommer alltid att vara ”not enforced”

source: Declaring a new foreign key
sv: Deklarera en ny främmande nyckel

source: A new foreign key can be declared from the <link xref="schema-browser-perspective">Schema Browser perspective</link> using the <guiseq><gui>Table</gui><gui>Declare foreign key</gui></guiseq> menu which is present when a table's properties are shown in the current tab.
sv: En ny främmande nyckel kan deklareras från <link xref="schema-browser-perspective">schemabläddrarperspektivet</link> med menyn <guiseq><gui>Tabell</gui><gui>Deklarera främmande nyckel</gui></guiseq> som finns när en tabells egenskaper visas i den aktuella fliken.

source: Another way of declaring a foreign key is using the contextual menu on a table in a diagram, and selecting the <guiseq><gui>Declare foreign key for this table</gui></guiseq> option.
sv: Ett annat sätt att deklarera en främmande nyckel är att använda kontextmenyn på en tabell i ett diagram, och välja alternativet <guiseq><gui>Deklarera främmande nyckel för denna tabell</gui></guiseq>.

source: In any way, to declare a new foreign key, the following information must be provided:
sv: Hur som helst så måste följande information tillhandahållas för att deklarera en ny främmande nyckel:

source: A foreign key name
sv: Ett namn på en främmande nyckel

source: The referenced table
sv: Den refererade tabellen

source: Columns and referenced columns for each column involved in the foreign key
sv: Kolumner och refererade kolumner för varje kolumn som är involverad i den främmande nyckeln

source: Information to declare a new foreign key
sv: Information för att deklarera en ny främmande nyckel

source: UI dialog poping up to declare a new foreign key. Here the referenced table is 'warehouses', and the involved columns are 'country' and 'city'.
sv: Dialogruta som poppar upp i användargränssnittet för att deklarera en ny främmande nyckel. Här är den refererade tabellen ”warehouses”, och de involverade kolumnerna är ”country” och ”city”.

source: Remove a declared foreign key
sv: Ta bort en deklarerad främmande nyckel

source: A declared foreign key can be removed by clicking on the <guiseq><gui>(Remove)</gui></guiseq> link displayed below each declared foreign key properties in the table's properties (in the <link xref="schema-browser-perspective">Schema Browser perspective</link>).
sv: En deklarerad främmande nyckel kan tas bort genom att klicka på länken <guiseq><gui>(Ta bort)</gui></guiseq> som visas under egenskaperna för varje deklarerad främmande nyckel i tabellens egenskaper (i <link xref="schema-browser-perspective">schemabläddrarperspektivet</link>).

source: Another way to remove a declared foreign key is in a <link xref="diagram">diagram</link> page through the contextual menu associated with the dashed line representing the declared foreign key, selecting the <guiseq><gui>Remove this declared foreign key</gui></guiseq> option.
sv: Ett annat sätt att ta bort en deklarerad främmande nyckel är i en <link xref="diagram">diagram</link>sida genom kontextmenyn som är associerad med den streckade linjen som representerar den deklarerade främmande nyckeln, genom att välja alternativet <guiseq><gui>Ta bort denna deklarerade främmande nyckel</gui></guiseq>.

source: Diagrams are present throughout the <app>gda-browser</app>, and are made of a canvas on which graphical items are displayed (like tables for example).
sv: Diagram finns över hela <app>gda-browser</app>, och utgörs av en rityta på vilka grafiska objekt visas (som exempelvis tabeller).

source: Diagram showing some tables and their relations represented by foreign key constraints (also see <link xref="declared-fk">the declared foreign keys</link>)
sv: Diagram som visar några tabeller och deras relationer representerade av främmande nyckelbegränsningar (se även <link xref="declared-fk">de deklarerade främmande nycklarna</link>)

source: The items can be moved around on the canvas (note that as long as the whole diagram fits in the canvas, it remains centered on it). Other manipulations are possible:
sv: Objekten kan flyttas runt på ritytan (observera att så länge som hela diagrammet ryms i ritytan så förblir det centrerat på den). Annan manipulation är möjlig:

source: zooming in and out using the mouse's wheel, or through the contextual menu (right click on the canvas); a zoom to fit the canvas is also available in the contextual menu
sv: in- och utzoomning med mushjulet, eller genom kontextmenyn (högerklicka på ritytan), en zoom för att passa ritytan finns också tillgänglig i kontextmenyn

source: bring closer or moving away items from one another using the mouse's wheel while holding the <key>Shift</key> key
sv: flytta objekt närmare eller längre från varandra genom att använda mushjulet medan du håller ner <key>Skift</key>-tangenten

source: arranging items linearly or radially, through the contextual menu
sv: arrangera objekt linjärt eller radiellt genom kontextmenyn

source: printing, through the contextual menu
sv: utskrift, genom kontextmenyn

source: exporting as PNG or SVG images, through the contextual menu
sv: export som PNG- eller SVG-bilder, genom kontextmenyn

source: adding items, through the contextual menu
sv: tillägg av objekt, genom kontextmenyn

source: removing items, through the items's contextual menu
sv: borttagning av objekt, genom objektets kontextmeny

source: Features
sv: Funktioner

source: <app>gda-browser</app>'s current features are:
sv: Funktionerna för <app>gda-browser</app> är för närvarande:

source: General user interface
sv: Allmänt användargränssnitt

source: multi threaded: each connection is handled in it own thread, meaning that no single connection can lock the application
sv: flertrådat: varje anslutning hanteras i en egen tråd, vilket betyder att ingen enskild anslutning kan låsa programmet

source: several windows can be opened for a single connection
sv: flera fönster kan öppnas för en enskild anslutning

source: full screen mode accessible to maximize the screen space usage
sv: helskärmsläge finns tillgängligt för att maximera användningen av skärmutrymme

source: Connection management
sv: Anslutningshantering

source: multiple simultaneous connections can be opened at once
sv: flera samtidiga anslutningar kan öppnas på en gång

source: connections binding: it is possible to <link type="topic" xref="virtual-connections">"bind"</link> several connections into one to execute SQL commands on several connections at once
sv: anslutningsbindning: det är möjligt att <link type="topic" xref="virtual-connections">”binda”</link> ihop flera anslutningar till en för att exekvera SQL-kommandon på flera anslutningar samtidigt

source: Activities
sv: Aktiviteter

source: The activities are grouped by theme around the notion of <link type="topic" xref="general-ui">perspectives</link>, the following are currently implemented:
sv: Aktiviteterna grupperas efter tema runt begreppet <link type="topic" xref="general-ui">perspektiv</link>, där följande för närvarande finns implementerade:

source: analyse the database schema (tables, relations, ...), see the <link xref="schema-browser-perspective">Schema browser perspective</link>
sv: analysera databasschemat (tabeller, relationer, …), se <link xref="schema-browser-perspective">schemabläddrarperspektivet</link>

source: execute SQL commands, see the <link xref="query-execution-perspective">Query execution perspective</link>
sv: exekvera SQL-kommandon, se <link xref="query-execution-perspective">frågeexekveringsperspektivet</link>

source: analyse the table's contents, see the <link xref="data-manager-perspective">Data manager perspective</link>
sv: analysera tabellens innehåll, se <link xref="data-manager-perspective">datahanterarperspektivet</link>

source: for <link xref="ldap-connection">LDAP connections</link>, manage the hierarchical data in the LDAP tree, see the <link xref="ldap-browser-perspective">LDAP browser perspective</link>
sv: för <link xref="ldap-connection">LDAP-anslutningar</link>, hantera hierarkiska data i LDAP-trädet, se <link xref="ldap-browser-perspective">LDAP-bläddrarperspektivet</link>

source: See also the section about <link xref="actions">actions</link>
sv: Se även avsnittet om <link xref="actions">åtgärder</link>

source: Openness
sv: Öppenhet

source: CSV and other text files can be imported and used in conjunction with <link type="topic" xref="virtual-connections">connection binding</link>
sv: CSV och andra textfiler kan importeras och användas tillsammans med <link type="topic" xref="virtual-connections">anslutningsbindning</link>

source: the general framework is opened enough to add new integrated features; specifically anyone can develop new <link type="topic" xref="general-ui">perspectives</link>
sv: det allmänna ramverket är öppet nog för att lägga till nya integrerade funktioner, mer specifikt så kan vem som helst utveckla nya <link type="topic" xref="general-ui">perspektiv</link>

source: General interface organization
sv: Organisation av det allmänna gränssnittet

source: The <app>gda-browser</app> is composed of one or more top level windows, each window relating to a single connection (which name is in its title). For any given connection, several windows can be opened (use the <guiseq><gui>Window</gui><gui>New window</gui></guiseq> menu or the <keyseq><key>Ctrl</key><key>N</key></keyseq> shortcut).
sv: <app>gda-browser</app> består av en eller flera toppnivåfönster, där varje fönster är relaterat till en enskild anslutning (vars namn är i namnlisten). För alla anslutningar kan flera fönster öppnas (använd menyn <guiseq><gui>Fönster</gui><gui>Nytt fönster</gui></guiseq> eller kortkommandot <keyseq><key>Ctrl</key><key>N</key></keyseq>).

source: A connection window
sv: Ett anslutningsfönster

source: Window opened for the 'c1' connection (and the Schema browser perspective)
sv: Fönster som är öppnat för anslutningen ”c1” (och schemabläddrarperspektivet)

source: Within each window, several <em>perspectives</em> are available which are adapted to different activities:
sv: I varje fönster finns flera <em>perspektiv</em> tillgängliga vilka är anpassade för olika aktiviteter:

source: the <link xref="schema-browser-perspective">Schema browser perspective</link> to help understand the database's layout
sv: <link xref="schema-browser-perspective">Schemabläddrarperspektivet</link> för att hjälpa till förstå databasens layout

source: the <link xref="query-execution-perspective">Query execution perspective</link> to execute any SQL command
sv: <link xref="query-execution-perspective">Frågeexekveringsperspektivet</link> för att exekvera SQL-kommandon

source: the <link xref="data-manager-perspective">Data manager perspective</link> to navigate through the database's contents
sv: <link xref="data-manager-perspective">Datahanterarperspektivet</link> för att navigera genom databasens innehåll

source: The currently displayed perspective can be changed individually for each window, and, as all perspectives have an action area composed of tabs, tabs can be moved from one window to the other if the source and destination window are for the same connection, and display the same perspective (simply drag and drop a tab from one window to the other using the tab's label as a handle).
sv: Perspektivet som för närvarande visas kan ändras individuellt för varje fönster, och eftersom alla perspektiv har ett åtgärdsområde som består av flikar, så kan flikar flyttas från ett fönster till ett annat om käll- och målfönstret är för samma anslutning, och visar samma perspektiv (dra och släpp helt enkelt en flik från ett fönster till ett annat med flikens etikett som handtag).

source: Gda Browser Help
sv: Hjälp för Gda Browser

source: <app>gda-browser</app> is a tool for database administrators: they can analyse database's schemas to understand how data is organized, run SQL commands interactively, and in a broader way manage the data contained in the databases.
sv: <app>gda-browser</app> är ett verktyg för databasadministratörer: de kan analysera databasers scheman för att förstå hur data organiseras, köra SQL-kommandon interaktivt, och mer allmänt hantera data som finns i databaserna.

source: Several connections to databases can be opened at once, allowing the user to work on multiple databases at once (it is also possible to execute commands on several connections at the same time).
sv: Flera anslutningar till databaser kan öppnas samtidigt, vilket låter användaren arbeta med flera databaser samtidigt (det är också möjligt att exekvera kommandon på flera anslutningar samtidigt).

source: As <app>gda-browser</app> uses the <app>libgda</app> library, it can open connections to databases for which a database driver (provider) exists in <app>libgda</app> (<link href="http://www.oracle.com">Oracle</link>, <link href="http://www.mysql.org">MySQL</link>, <link href="http://www.postgresql.org/">PostgreSQL</link>, <link href="http://www.sqlite.org">SQLite</link>, MS Access (through the <link href="http://sourceforge.net/projects/mdbtools/">MDBTools</link> library), <link href="http://en.wikipedia.org/wiki/LDAP">LDAP</link> and <link href="http://java.sun.com/docs/books/tutorial/jdbc/index.html">JDBC</link> are supported at the moment).
sv: Eftersom <app>gda-browser</app> använder biblioteket <app>libgda</app> så kan det öppna anslutningar för vilka en databasdrivrutin (leverantör) existerar i <app>libgda</app> (<link href="http://www.oracle.com">Oracle</link>, <link href="http://www.mysql.org">MySQL</link>, <link href="http://www.postgresql.org/">PostgreSQL</link>, <link href="http://www.sqlite.org">SQLite</link>, MS Access (genom biblioteket <link href="http://sourceforge.net/projects/mdbtools/">MDBTools</link>), <link href="http://en.wikipedia.org/wiki/LDAP">LDAP</link> och <link href="http://java.sun.com/docs/books/tutorial/jdbc/index.html">JDBC</link> har stöd för tillfället).

source: Perspectives
sv: Perspektiv

source: Connections management
sv: Anslutningshantering

source: Creative Commons Attribution-Share Alike 3.0 Unported License
sv: Creative Commons Erkännande-DelaLika 3.0 Unported

source: This work is licensed under a <_:link-1/>.
sv: Detta verk är licensierat under licensen <_:link-1/>.

source: As a special exception, the copyright holders give you permission to copy, modify, and distribute the example code contained in this document under the terms of your choosing, without restriction.
sv: Som ett speciellt undantag ger upphovsrättsinnehavarna dig tillåtelse att kopiera, modifiera och distribuera exempelkoden som finns i detta dokument under de villkor som du väljer, utan restriktioner.

source: The query execution perspective
sv: Frågeexekveringsperspektivet

source: Use the query perspective to execute SQL statements. To switch to this perspective, use the <guiseq><gui>Perspective</gui><gui>Query execution (SQL)</gui></guiseq> menu, or the <keyseq><key>Ctrl</key><key>S</key></keyseq> shortcut.
sv: Använd frågeexekveringsperspektivet för att exekvera SQL-satser. För att växla till detta perspektiv, använd menyn <guiseq><gui>Perspektiv</gui><gui>Frågeexekvering (SQL)</gui></guiseq>, eller kortkommandot <keyseq><key>Ctrl</key><key>S</key></keyseq>.

source: Query exec perspective
sv: Frågeexekveringsperspektiv

source: The query exec perspective with one SELECT statement executed
sv: Frågeexekveringsperspektivet med en SELECT-sats exekverad

source: The perspective is divided in two horizontal panes: the left pane for the user defined favorite statements, and the right pane being the action area.
sv: Perspektivet delas in i två horisontella paneler: vänsterpanelen för användardefinierade favoritsatser, och högerpanelen är åtgärdsområdet.

source: In the figure above, there are two favorites: a SELECT statement (named "List customers") and an INSERT statement (named "New customer ..."). The INSERT statement needs one "name" parameter, whereas the SELECT statement does not require any parameter to be executed.
sv: I figuren ovan finns det två favoriter: en SELECT-sats (med namnet ”List customers” och en INSERT-sats (med namnet ”New customer …”. INSERT-satsen kräver en parameter ”name”, medan SELECT-satsen inte kräver någon parameter för att exekveras.

source: The icon difference between the two illustrates the fact that the INSERT favorite is also marked to be an <link xref="actions">action</link>: it will be proposed as an action to be executed when the contextual menu is brought up in any grid representation of a resultset.
sv: Ikonskillnaden mellan de två illustrerar att INSERT-favoriten även är markerad att vara en <link xref="actions">åtgärd</link>: den kommer att föreslås som en åtgärd att exekvera när kontextmenyn tas fram i en rutnätsrepresentation av en resultatmängd.

source: The left part of the perspective lists the favorite statements which have been user defined. Activating a favorite (double clicking) resets the SQL text area's contents to the selected statement's SQL.
sv: Vänsterdelen av perspektivet listar favoritsatserna som som har definierats av användare. Att aktivera en favorit (dubbelklick) återställer SQL-textområdets innehåll till den valda satsens SQL.

source: The right pane is composed of zero or more tabs where the SQL is entered and executed. In each tab there is:
sv: Högerpanelen består av noll eller flera flikar där SQL matas in och exekveras. I varje flik finns:

source: an SQL area in the top left part
sv: ett SQL-område i övre vänstra delen

source: command buttons in the top right part
sv: kommandoknappar i övre högra delen

source: execution history in the lower left part
sv: exekveringshistorik i nedre vänstra delen

source: execution results in the lower right part
sv: exekveringsresultat i nedre högra delen

source: SQL area
sv: SQL-område

source: The SQL area is an SQL editor. The SQL can be any SQL understood by the database, with the exception of <link xref="variables-syntax">variables</link> (which must have a specific syntax).
sv: SQL-området är en SQL-redigerare. Denna SQL kan vara valfri SQL som förstås av databasen, med undantag för <link xref="variables-syntax">variabler</link> (vilka måste ha specifik syntax).

source: The keyboard shortcuts in the SQL editor are:
sv: Tangentbordsgenvägarna i SQL-redigeraren är:

source: <keyseq><key>Ctrl</key><key>SPACE</key></keyseq> to obtain a completion list
sv: <keyseq><key>Ctrl</key><key>Blanksteg</key></keyseq> för att erhålla en kompletteringslista

source: <keyseq><key>Ctrl</key><key>ENTER</key></keyseq> to execute the SQL code
sv: <keyseq><key>Ctrl</key><key>Retur</key></keyseq> för att exekvera SQL-koden

source: <keyseq><key>Ctrl</key><key>l</key></keyseq> to clear the editor
sv: <keyseq><key>Ctrl</key><key>l</key></keyseq> för att tömma redigeraren

source: <keyseq><key>Ctrl</key><key>Up</key></keyseq> and <keyseq><key>Ctrl</key><key>Down</key></keyseq> to navigate through the editor's history
sv: <keyseq><key>Ctrl</key><key>Upp</key></keyseq> Och <keyseq><key>Ctrl</key><key>Ned</key></keyseq> för att navigera genom redigerarens historik

source: Command buttons
sv: Kommandoknappar

source: <gui>Clear</gui>: clears the editor (similar to the <keyseq><key>Ctrl</key><key>l</key></keyseq> shortcut)
sv: <gui>Rensa</gui>: tömmer redigeraren (liknande kortkommandot <keyseq><key>Ctrl</key><key>l</key></keyseq>)

source: <gui>Variables</gui>: shows or hides the <link xref="variables-syntax">variables</link> panel where you can give values to the variables present in the SQL code. The panel is automatically shown when a variable is detected in the SQL code
sv: <gui>Variabler</gui>: visar eller döljer panelen <link xref="variables-syntax">variabler</link> där du kan ge värden till variablerna som finns i SQL-koden. Panelen visas automatiskt när en variabel upptäcks i SQL-koden

source: <gui>Execute</gui>: executes the SQL code. If the SQL code contains some variables which have not been set, then a popup first appears requesting the variables to be given values. This is similar to the <keyseq><key>Ctrl</key><key>ENTER</key></keyseq> shortcut
sv: <gui>Kör</gui>: exekverar SQL-koden. Om SQL-koden innehåller några variabler som inte har ställts in så visas först ett fönster som ber att variablerna ska ges värden. Detta liknar kortkommandot <keyseq><key>Ctrl</key><key>Retur</key></keyseq>

source: <gui>Indent</gui>: re-indents the SQL code (warning: this removes any comments)
sv: <gui>Indentera</gui>: om-indenterar SQL-koden (varning: detta tar bort alla kommentarer)

source: <gui>Favorites</gui>: adds the current SQL code to the favorites
sv: <gui>Favoriter</gui>: lägger till aktuell SQL-kod till favoriterna

source: Execution history
sv: Exekveringshistorik

source: The execution history part contains a list of the past executed statements, ordered by execution date along with an indication when the statement was executed (11 minutes in the figure above). Selecting an history item displays the corresponding result in the execution results part.
sv: Delen för exekveringshistorik innehåller en lista över de senast exekverade satserna, ordnade efter exekveringsdatum tillsammans med en indikation på när satsen exekverades (11 minuter i figuren ovan). Att välja ett historikobjekt visar motsvarande resultat i delen för exekveringsresultat.

source: The <gui>Copy</gui> button copies the currently selected history item's SQL code to the SQL editor, and the <gui>Clear</gui> button removes all the history items.
sv: Knappen <gui>Kopiera</gui> kopierar det för närvarande valda historikobjektets SQL-kod till SQL-redigeraren, och knappen <gui>Rensa</gui> tar bort alla historikobjekt.
