Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Could not update the internal schema's version. Statement execution fails
ca: No s'ha pogut actualitzar la versió de l'esquema intern. Ha fallat l'execució d'una declaració
tr: İç şemanın sürümü güncellenemedi. İfade yürütme başarısız
uk: Не вдалося оновити версію внутрішньої схеми. Виконання інструкції зазнало невдачі

source: Schema description does not contain the object '%s', check installation
ca: La descripció de l'esquema no conté l'objecte «%s». Comproveu la instal·lació
ro: Descrierea schemei nu conține obiectul „%s”, verificați instalarea
tr: Şema tanımlaması '%s' nesnesini içermiyor, kurulumu denetleyin
uk: У описі схеми не міститься об'єкта «%s», перевірте, чи встановлено потрібні компоненти

source: Could not find description for column named '%s'
ca: No s'ha pogut trobar la descripció de la columna anomenada «%s»
ro: Nu s-a putut găsi descrierea pentru obiectul cu numele „%s”
tr: '%s' sütunu için tanımlama bulunamadı
uk: Не вдалося знайти опис для стовпчика з назвою «%s»

source: Could not get the internal schema's version
ca: No s'ha pogut obtenir la versió interna de l'esquema
ro: Nu s-a putut obține versiunea schemei interne
tr: İç şema sürümü alınamadı
uk: Не вдалося отримати версію внутрішньої схеми

source: More than one SQL statement
ca: Més d'una declaració SQL
ro: Mai mult de o comandă SQL
tr: Birden fazla SQL ifadesi
uk: Декілька інструкцій SQL

source: Parameter '%s' is not present in statement
ca: El paràmetre «%s» no està present a la declaració
ro: Parametrul „%s” nu este prezent în comandă
tr: İfade için '%s' parametresi yok
uk: Параметра «%s» немає в інструкції

source: While extracting data from Meta Store: %s
ca: En extreure les dades del Meta Store: %s
tr: Meta Mağazasından veri çıkartırken: %s
uk: Під час видобування даних метасховища: %s

source: No value set for parameter '%s'
ca: No hi ha cap valor definit per al paràmetre «%s»
ro: Nicio valoare stabilită pentru parametrul „%s”
tr: '%s' parametresi için ayarlanacak değer yok
uk: Не встановлено значення параметра «%s»

source: While extracting data from store: %s
ca: En extreure les dades del magatzem: %s
tr: Mağazadan veri çıkarırken: %s
uk: Під час видобування даних з джерела: %s

source: Internal error, while updating internal meta store table '%s': Parameter value type error: %s
ca: Error intern en actualitzar la taula de meta emmagatzematge interna «%s»: error de tipus de valor de paràmetre: %s
tr: İç meta depo tablosu güncellenirken iç hata '%s': Parametre değer tipi hatası: %s
uk: Внутрішня помилка під час оновлення таблиці внутрішнього метасховища «%s»: помилка типу значення параметра: %s

source: Data models should have the same number of columns
ca: Els models de dades han de tenir el mateix nombre de columnes
ro: Modelele de date ar trebui să aibă același număr de coloane
tr: Veri modeli aynı sayıda sütuna sahip olmalıdır
uk: Моделі даних повинні мати однакові кількості стовпчиків

source: Unknown database object '%s'
ca: Objecte de base de dades desconegut «%s»
ro: Obiect al bazei de date necunoscut „%s”
tr: Bilinmeyen veri tabanı nesnesi '%s'
uk: Невідомий об'єкт бази даних «%s»

source: Could not set value for parameter '%s'
ca: No s'ha pogut definir el valor del paràmetre «%s»
ro: Nu s-a putut stabili valoarea pentru parametrul „%s”
tr: '%s' parametresi için değer ayarlanamadı
uk: Не вдалося встановити значення для параметра «%s»

source: Could not create SELECT statement
ca: No s'ha pogut crear la declaració SELECT
ro: Nu s-a putut crea comanda SELECT
tr: SELECT ifadesi oluşturulamadı
uk: Не вдалося створити інструкцію SELECT

source: Could not create DELETE statement
ca: No s'ha pogut crear la declaració DELETE
ro: Nu s-a putut crea comanda DELETE
tr: DELETE ifadesi oluşturulamadı
uk: Не вдалося створити інструкцію DELETE

source: A transaction has already been started
ca: Ja s'ha iniciat una transacció
ro: O tranzacție a început deja
tr: Bir işlem zaten başlatılmış
uk: Транзакцію вже розпочато

source: Attribute '%s' not found
ca: No s'ha trobat l'atribut «%s»
ro: Atributul „%s” nu a fost găsit
tr: '%s' özniteliği bulunamadı
uk: Атрибут «%s» не знайдено

source: Attribute '%s' has %d value
ca: L'atribut «%s» té %d valor
ro: Atributul „%s” are %d valoare
tr: '%s' özniteliği %d değerine sahip
uk: Атрибут «%s» має %d значення

source: Attributes names starting with a '_' are reserved for internal usage
ca: Els noms d'atributs que comencen amb «_» estan reservats per a ús intern
ro: Numele de atribute care încep cu un „_” sunt rezervate pentru utilizare internă
tr: '_' ile başlayan öznitelik adları iç kullanım için ayrılmıştır
uk: Атрибути, назви яких починаються з «_», зарезервовано для внутрішнього вжитку

source: Could not start a transaction because one already started, this could lead to GdaMetaStore attributes problems
ca: No s'ha pogut iniciar la transacció perquè ja n'hi ha una d'iniciada i això podria comportar problemes amb els atributs de GdaMetaStore
ro: Nu s-a putut începe o tranzacție deoarece una a început deja, acest lucru ar putea să conducă la probleme cu atributele GdaMetaStore
tr: İşlem başlatılamadı çünkü başka bir tanesi zaten başlatılmış, bu GdaMetaStore öznitelik sorunlarına neden olabilir
uk: Не вдалося розпочати виконання дії, оскільки вже розпочато виконання іншої дії, і це могло призвести до проблем із атрибутами GdaMetaStore

source: Could not parse XML description of custom database object to add
ca: No s'ha pogut analitzar la descripció XML de l'objecte personalitzat de la base de dades a afegir
ro: Nu s-a putut analiza descrierea XML a obiectului de bază de date personalizat pentru a putea fi adăugat
tr: Eklenecek veritanı nesnesinin XML tanımlaması ayrıştırılamadı
uk: Не вдалося обробити опис XML нетипового об'єкта бази даних для додавання

source: Missing custom database object name
ca: Falta el nom personalitzat de l'objecte de la base de dades
ro: Lipsește numele personalizat al obiectului din baza de date
tr: Eksiz özek veri tabanı nesne adı
uk: Не вказано назву нетипового об'єкта бази даних

source: Custom database object names starting with a '_' are reserved for internal usage
ca: Els noms personalitzats d'objectes de la base de dades que comencen per «_» estan reservats per a ús intern
ro: Numele personalizate de obiecte ale bazei de date care încep cu „_” sunt rezervate pentru utilizare internă
tr: Özel veri tabanı nesne adlarının '_' ile başlayanları, iç kullanım için ayrılmışlardır
uk: Нетипові об'єкти бази даних, назви яких починаються з «_», зарезервовано для внутрішнього вжитку

source: Another object with the same name already exists
ca: Ja existeix un objecte amb el mateix nom
ro: Un alt obiect cu același nume există deja
tr: Aynı adlı başka bir nesne zaten var
uk: Вже існує інший об'єкт із тією самою назвою

source: Missing table name in meta data context
ca: Falta el nom de la taula en el context de les metadades
ro: Lipsește numele tabelei în contextul metadatelor
tr: Meta veri içeriğinde eksik tablo adı
uk: Пропущено назву таблиці у контексті метаданих

source: Missing column name in meta data context
ca: Falta el nom de la columna en el context de les metadades
ro: Lipsește numele coloanei în contextul metadatelor
tr: Üst veri içeriğinde sütun adı eksik
uk: Пропущено назву стовпчика у контексті метаданих

source: Missing condition in meta data context
ca: Falta la condició en el context de les metadades
ro: Lipsește condiția în contextul metadatelor
tr: Üst veri içeriğinde durum eksik
uk: Пропущено умову у контексті метаданих

source: Malformed condition in meta data context
ca: Condició incorrecta al context de les metadades
ro: Condiție greșită în contextul metadatelor
tr: Üst veri içeriğinde kusurlu durum eksik
uk: Помилкове форматування умови у контексті метаданих

source: Unknown column name '%s' in meta data context
ca: Nom de columna desconegut «%s» al context de les metadades
ro: Nume de coloană necunoscut „%s” în contextul metadatelor
tr: Üst veri içeriğinde '%s' bilinmeyen sütun adı
uk: Невідома назва стовпчика, «%s, у контексті метаданих

source: Unknown table in meta data context
ca: Taula desconeguda al context de les metadades
ro: Tabelă necunoscută în contextul metadatelor
tr: Üst veri içerğinde bilinmeyen tablo
uk: Невідома таблиця у контексті метаданих

source: Could not find object named '%s'
ca: No s'ha pogut trobar l'objecte anomenat «%s»
ro: Nu s-a putut găsi obiectul cu numele „%s”
tr: '%s' nesne adı bulunamadı
uk: Не вдалося знайти об'єкт із назвою «%s»

source: Could not find column '%s' in table '%s'
ca: No s'ha pogut trobar la columna «%s» a la taula «%s»
ro: Nu s-a putut găsi coloana „%s” în tabela „%s”
tr: '%s' tablosunda '%s' sütunu bulunamadı
uk: Не вдалося знайти стовпчик «%s» у таблиці «%s»

source: GdaMetaStore object to fetch information from
ca: Objecte GdaMetaStore del qual obtenir la informació
ro: Obiect GdaMetaStore de la care se aduc informații
tr: Bir yerden bilgi çekmek için GdaMetaStore nesnesi
uk: Об'єкт GdaMetaStore для отримання інформації

source: Features to compute
ca: Característiques a calcular
ro: Caracteristici de calculat
tr: Hesaplanacak özellikler
uk: Можливості для обчислення

source: Object %s.%s.%s already exists in GdaMetaStruct and has a different object type
ca: L'objecte %s.%s.%s ja existeix en GdaMetaStruct i té un tipus d'objecte diferent
ro: Obiectul %s.%s.%s există deja în GdaMetaStruct și are un tip de obiect diferit
tr: %s.%s.%s nesnesi, GdaMetaStruct içinde zaten var ve başka bir nesne türüne sahip
uk: Об'єкт %s.%s.%s вже існує у GdaMetaStruct і належить до іншого типу об'єктів

source: View %s.%s.%s not found in meta store object
ca: No s'ha trobat la vista %s.%s.%s a l'objecte de metaemmagatzematge
ro: Vizualizarea %s.%s.%s nu a fost găsită în obiectul de stocare meta
tr: %s.%s.%s görünümü, meta depolama nesnesinde bulunamadı
uk: Перегляд %s.%s.%s не знайдено в об'єкті метасховища

source: Table %s.%s.%s not found (or missing columns information)
ca: La taula %s.%s.%s no s'ha trobat (o falta informació de les columnes)
ro: Tabela %s.%s.%s nu a fost găsită (sau lipsesc informații despre coloană)
tr: %s.%s.%s tablosu bulunamadı (ya da eksik sütun bilgisi)
uk: Не знайдено таблиці %s.%s.%s (або пропущено інформацію щодо стовпчиків)

source: Internal GdaMetaStore error: column %s not found
ca: Error intern de GdaMetaStore: no s'ha trobat la columna %s
ro: Eroare internă GdaMetaStore: coloana %s nu a fost găsită
tr: İç GdaMetaStore hatası: %s sütunu bulunamadı
uk: Внутрішня помилка GdaMetaStore: не знайдено стовпчик %s

source: Meta data incoherence in foreign key constraint for table %s.%s.%s referencing table %s.%s.%s
ca: Incoherència en les metadades de restricció de la clau externa de la taula %s.%s.%s referenciant la taula %s.%s.%s
ro: Incoerență de metadate în restricția cheii străine pentru tabela %s.%s.%s care face referință la tabela %s.%s.%s
tr: %s.%s.%s tablosu için (%s.%s.%s tablosuna bağlı) yabancı anahtar kısıtında meta veri tutarsızlığı var
uk: Розходження метаданих у обмеженні стороннього ключа для таблиці %s.%s.%s, яка посилається на таблицю %s.%s.%s

source: No meta struct was provided for object sorting
ca: No s'ha proporcionat cap metaestructura per a l'ordenació d'objectes
ro: Nicio structură meta nu a fost furnizată pentru sortarea obiectelor
tr: Nesne sıralama için meta yapı sağlanmadı
uk: Для упорядковування об'єктів не надано метаструктури

source: Missing object name in GdaMetaDbObject structure
ca: Falta el nom de l'objecte en l'estructura GdaMetaDbObject
ro: Lipsește numele obiectului în structura GdaMetaDbObject
tr: GdaMetaDbObject yapısında nesne adı eksik
uk: Не вказано назви об'єкта у структурі GdaMetaDbObject

source: Database object '%s' already exists
ca: L'objecte de la base de dades «%s» ja existeix
ro: Obiectul „%s” al bazei de date există deja
tr: Veri tabanı nesnesi '%s' zaten var
uk: Об'єкт бази даних «%s» вже існує

source: Could not load file '%s'
ca: No s'ha pogut carregar el fitxer «%s»
ro: Nu s-a putut încărca fișierul „%s”
tr: '%s' dosyası yüklenemedi
uk: Не вдалося завантажити файл «%s»

source: Root node of file '%s' should be <schema>.
ca: El node arrel del fitxer «%s» ha de ser <schema>.
ro: Nodul de administrare al fișierului „%s” ar trebui să fie <schema>.
tr: '%s' dosyasının kök düğümü <schema> olmalıdır.
uk: Кореневим вузлом файла «%s» має бути <schema>.

source: Missing column name for table '%s'
ca: Falta el nom de la columna de la taula «%s»
ro: Lipsește numele coloanei pentru tabela „%s”
tr: '%s' tablosu için eksik sütun adı
uk: Пропущено назву стовпчика для таблиці «%s»

source: Missing foreign key's referenced table name for table '%s'
ca: Falta el nom de la taula referenciada per les claus externes per a la taula «%s»
ro: Lipsește numele tabelei referențiate de chei străine pentru tabela „%s”
tr: %s tablosu için, yabancı anahtarın tablo adına referanslı adı eksik
uk: Пропущено назву таблиці, на яку посилається сторонній ключ для таблиці «%s»

source: Invalid referenced table name '%s'
ca: El nom de la taula referenciada «%s» no és vàlid
ro: Nume de tabelă referențiate „%s” nevalid
tr: Geçersiz referans edilmiş tablo adı '%s'
uk: Некоректне посилання на таблицю з назвою «%s»

source: Missing foreign key's column name for table '%s'
ca: Falta el nom de la columna de la clau externa per a la taula «%s»
ro: Lipsește numele de coloană al cheii străine pentru tabela „%s”
tr: '%s' tablosu için yabancı anahtarın sütun adı eksik
uk: Пропущено назву стовпчика стороннього ключа для таблиці «%s»

source: No connection is set
ca: No s'ha definit cap connexió
tr: Bağlantı kurulmadı
uk: З'єднання не встановлено

source: Connection is no opened
ca: No s'ha obert la connexió
tr: Bağlantı açılmadı
uk: З'єднання не відкрито

source: No rows or more than one row was returned from query
ca: La consulta ha retornat més d'una fila o cap fila
ro: Niciun rând sau mai mult de un rând a fost returnat de interogare
tr: Sorgudan satır veya birden fazla satır döndürülmedi
uk: Немає рядків або запитом повернуто декілька рядків

source: Can't set a number of values, because a data model is in use
ca: No es pot definir un nombre de valors perquè hi ha un model de dades en ús
tr: Veri modeli kullanımda olduğu için bir dizi değer ayarlanamıyor
uk: Не вдалося встановити декілька значень, оскільки модель даних перебуває у користуванні

source: No value can be retrieved from data model's row: %s
ca: No es pot recuperar cap valor de la fila del model de dades: %s
ro: Nicio valoare nu poate fi obținută din rândul modelului de date: %s
tr: Veri modelinin satırından değer alınamıyor:% s
uk: Із рядка моделі даних не вдалося отримати значення: %s

source: No Detail
ca: Sense detalls
tr: Ayrıntı Yok
uk: Немає подробиць

source: Value not found in row!
ca: No s'ha trobat el valor a la fila.
ro: Nu s-a găsit valoarea în rând!
tr: Değer, satırda bulunamadı!
uk: Значення у рядку не знайдено!

source: GdaServerOperation: could not find file '%s'
ca: GdaServerOperation: no s'ha pogut trobar el fitxer «%s»
ro: GdaServerOperation: nu s-a putut găsi fișierul „%s”
tr: GdaServerOperation: '%s' dosyası bulunamadı
uk: GdaServerOperation: не вдалося знайти файл «%s»

source: GdaServerOperation: could not load file '%s'
ca: GdaServerOperation: no s'ha pogut carregar el fitxer «%s»
ro: GdaServerOperation: nu s-a putut încărca fișierul „%s”
tr: GdaServerOperation: '%s' dosyası yüklenemedi
uk: GdaServerOperation: не вдалося завантажити файл «%s»

source: GdaServerOperation: could not load specified contents
ca: GdaServerOperation: no s'ha pogut carregar el contingut especificat
tr: GdaServerOperation: belirtilen içerikler yüklenemedi
uk: GdaServerOperation: не вдалося завантажити вказані дані

source: Could not load XML specifications: %s
ca: No s'han pogut carregar les especificacions XML: %s
ro: Nu s-au putut încărca specificațiile XML: %s
tr: XML tanımlamaları yüklenemedi: %s
uk: Не вдалося завантажити специфікації XML: %s

source: Could not parse '%s': Validation for XML files for server operations will not be performed (some weird errors may occur)
ca: No s'ha pogut analitzar «%s»: la validació de fitxers XML de les operacions del servidor no es portarà a terme (poden produir-se errors)
ro: Nu s-a putut analiza „%s”. Validarea pentru fișierele XML pentru operațiile serverului nu va fi executată (niște erori ciudate s-ar putea să apară)
tr: '%s' ayrıştırılamadı: Sunucu işlemleri için gereken XML dosyaları için doğrulama çalışmayacak (bazı garip hatalar oluşabilir)
uk: Не вдалося обробити «%s»: перевірку файлів XML для дій із сервером не буде виконано (у результаті можуть статися неочікувані помилки)

source: GdaServerOperation: file '%s' does not conform to DTD: %s
ca: GdaServerOperation: el fitxer «%s» no s'ajusta a la DTD: %s
ro: GdaServerOperation: fișierul „%s” nu se conformează cu DTD: %s
tr: GdaServerOperation: '%s' dosyası DTD ile uyumlu değil: %s
uk: GdaServerOperation: файл «%s» не відповідає DTD: %s

source: GdaServerOperation specification does not conform to DTD: %s
ca: L'especificació de la GdaServerOperation no s'ajusta a la DTD: %s
ro: Specificația GdaServerOperation nu se conformează cu DTD: %s
tr: GdaServerOperation tanımlaması, DTD ile uyumlu değil: %s
uk: Специфікація GdaServerOperation не відповідає DTD: %s

source: GdaServerOperation: file '%s' does not conform to DTD
ca: GdaServerOperation: el fitxer «%s» no s'ajusta a la DTD
ro: GdaServerOperation: fișierul „%s” nu se conformează cu DTD
tr: GdaServerOperation: '%s' dosyası, DTD ile uyumlu değil
uk: GdaServerOperation: файл «%s» не відповідає DTD

source: GdaServerOperation specification does not conform to DTD
ca: L'especificació de la GdaServerOperation no s'ajusta a la DTD
ro: Specificația GdaServerOperation nu se conformează cu DTD
tr: GdaServerOperation tanımlanamsı, DTD ile uyumlu değil
uk: Специфікація GdaServerOperation не відповідає DTD

source: Non handled GdaServerOperationType, please report error to http://gitlab.gnome.org/GNOME/libgda/issues
ca: GdaServerOperationType no gestionat. Informeu de l'error a http://gitlab.gnome.org/GNOME/libgda/issues
tr: İşlenmemiş GdaServerOperationType, lütfen bu hatayı şuraya raporlayın http://gitlab.gnome.org/GNOME/libgda/issues
uk: Непридатний до обробки GdaServerOperationType, будь ласка, повідомте про помилку на сторінці http://gitlab.gnome.org/GNOME/libgda/issues

source: Expected tag <%s>, got <%s>
ca: S'esperava l'etiqueta <%s>, però s'ha obtingut <%s>
ro: S-a așteptat eticheta <%s>, s-a obținut <%s>
tr: Beklenen etiket <%s>, alınan <%s>
uk: Мало бути використано теґ <%s>, маємо <%s>

source: Parameterlist values can only be set for individual parameters within it
ca: Els valors de la llista de paràmetres només es poden definir per als paràmetres individuals que s'hi inclouen
ro: Valorile listei de parametri pot fi configurate numai pentru parametri individuali din interiorul acesteia
tr: Parametre listesi değerleri yalnızca tekil parametrele ile ayarlanabilirler
uk: Значення списку параметрів можна встановлювати лише для окремих параметрів у ньому

source: Missing attribute named 'path'
ca: Falta l'atribut anomenat «path»
ro: Lipsește atributul cu numele „cale”
tr: 'path' adlı öznitelik eksik
uk: Пропущено атрибути із назвою «path»

source: Missing required value for '%s'
ca: Falta el valor requerit per a «%s»
ro: Lipsește valoarea necesară pentru „%s”
tr: '%s' için istenen değer eksik
uk: Пропущено обов'язкове значення для «%s»

source: Could not find operation's associated provider, did you use gda_server_operation_prepare_create_database() ?
ca: No s'ha pogut trobar el proveïdor associat a l'operació, heu utilitzat gda_server_operation_prepare_create_database()?
ro: Nu s-a putut găsi furnizorul asociat operației, ați folosit gda_server_operation_prepare_create_database() ?
tr: İşlemin ilişkili sağlayıcısı bulunamadı, gda_server_operation_prepare_create_database () kullandınız mı?
uk: Не вдалося знайти пов'язаного із дією надавача даних, чи скористалися ви gda_server_operation_prepare_create_database() ?

source: Provider %s created a GdaServerOperation without node for '%s'
ca: El proveïdor %s ha creat un GdaServerOperation sense node per a «%s»
ro: Furnizorul %s a creat o GdaServerOperation fără nod pentru „%s”
tr: %s sağlayıcısı, '%s' için bir düğüm olmadan GdaServerOperation oluşturdu
uk: Надавач даних %s створив GdaServerOperation без вузла для «%s»

source: Provider %s created a GdaServerOperation with wrong node type for '%s'
ca: El proveïdor %s ha creat una GdaServerOperation amb un tipus de node incorrecte per a «%s»
ro: Furnizorul %s a creat o GdaServerOperation cu tipul incorect de nod pentru „%s”
tr: %s sağlayıcısı, '%s' için yanlış düğüm türü ile GdaServerOperation oluşturdu
uk: Надавач даних %s створив GdaServerOperation із помилковим типом вузла для «%s»

source: Internal error: connection reported as opened, yet no provider's data has been setted
ca: Error intern: la connexió es va informar com a oberta, però no s'han resolt les dades del proveïdor
tr: İç hata: bağlantı açık olarak bildirildi, ancak hiçbir sağlayıcı verisi belirlenmedi
uk: Внутрішня помилка: про з'єднання повідомлено як про відкрите, але не встановлено параметрів надавача даних

source: Delaying opening connection for %u ms
ca: Retardant l'obertura de la connexió %u ms
ro: Se întârzie deschiderea conexiunii pentru %u milisecunde
tr: Bağlantı açma gecikmesi %u ms
uk: Затримуємо відкриття з'єднання на %u мс

source: You need to define a GMainContext using gda_connection_set_main_context()
ca: Heu de definir un GMainContext mitjançant gda_connection_set_main_context()
ro: Trebuie să definiți un GMainContext utilizând gda_connection_set_main_context()
tr: gda_connection_set_main_context() kullanarak bir GMainContext tanımlamalısınız
uk: Вам слід визначити GMainContext за допомогою gda_connection_set_main_context()

source: Delaying closing connection for %u ms
ca: Retardant el tancament de la connexió %u ms
ro: Se întârzie închiderea conexiunii pentru %u milisecunde
tr: Bağlantı kapatma gecikmesi %u ms
uk: Затримуємо закриття з'єднання на %u мс

source: Delaying statement execution for %u ms
ca: Retardant l'execució de la declaració %u ms
ro: Se întârzie executarea comenzii pentru %u milisecunde
tr: Komut çalıştırma gecikmesi %u ms
uk: Відкладаємо виконання інструкції на %u мс

source: Not supported
ca: No suportat
ro: Nu este suportat
tr: Desteklenmiyor
uk: Немає підтримки

source: Internal error please report bug to https://gitlab.gnome.org/GNOME/libgda/issues Reported error is: %s
ca: S'ha produït un error intern si us plau informeu a https://gitlab.gnome.org/GNOME/libgda/issues L'error reportat és: %s
tr: İç hata, lütfen hatayı https://gitlab.gnome.org/GNOME/libgda/issues adresine bildirin. Rapor edilen hata: %s
uk: Внутрішня помилка. Будь ласка, повідомте про цю ваду у розділі вад наhttps://gitlab.gnome.org/GNOME/libgda/ Повідомлення про помилку: %s

source: Internal error please report bug to https://gitlab.gnome.org/GNOME/libgda/issues No error was reported
ca: S'ha produït un error intern si us plau informeu a https://gitlab.gnome.org/GNOME/libgda/issues Cap error informat
tr: İç hata, lütfen hatayı https://gitlab.gnome.org/GNOME/libgda/issues adresine bildirin. Hata bildirilmedi
uk: Внутрішня помилка. Будь ласка, повідомте про цю ваду у розділі вад наhttps://gitlab.gnome.org/GNOME/libgda/ Повідомлень про помилки не отримано.

source: Delaying transaction for %u ms
ca: Retardant la transacció %u ms
ro: Se întârzie tranzacția pentru %u milisecunde
tr: İşlem gecikmesi %u ms
uk: Затримуємо операцію на %u мс

source: Database provider does not support transactions
ca: El proveïdor de bases de dades no admet transaccions
ro: Furnizorul bazei de date nu suportă tranzacții
tr: Veri tabanı sağlayıcısı toplu işlem yapmayı desteklemiyor
uk: У надавачі даних бази даних не передбачено підтримки операцій
