Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Unable to retrieve data after modifications
ca: No es poden recuperar les dades després de les modificacions
ro: Nu s-au putut obține datele după modificări
tr: Değişikliklerden sonra veri alınamıyor
uk: Не вдалося отримати дані після внесення змін

source: Unable to retrieve data after modifications, no further modification will be allowed
ca: No es poden recuperar les dades després de les modificacions. No es permeten més modificacions
ro: Nu s-au putut obține datele după modificări, nu se mai permit alte modificări
tr: Değişikliklerden sonra veri alınamıyor, başka bir değişikliğe izin verilmeyecek
uk: Не вдалося отримати дані після внесення змін — подальші зміни буде заборонено

source: Can't calculate internal row number: %s
ca: No es pot calcular el nombre de fila intern: %s
tr: İç satır numarası hesaplanamıyor: %s
uk: Не вдалося обчислити внутрішній номер рядка: %s

source: Can't fetch next row: %s
ca: No es pot obtenir la fila següent: %s
tr: Bir sonraki satır alınamıyor: %s
uk: Не вдалося отримати наступний рядок: %s

source: Can't move back iter at row: %s
ca: No es pot tornar l'iterador de la fila: %s
tr: Satırdaki iter geri alınamıyor:% s
uk: Не вдалося повернути ітератор у рядок: %s

source: Internal error: No fetch_prev() method implementation for data model
ca: Error intern: no hi ha cap implementació de mètode fetch_prev() per al model de dades
ro: Eroare internă: Nicio metodă fetch_prev() nu a fost implementată pentru modelul de date
tr: İç hata: Veri modeli için fetch_prev () yöntem uygulaması yok
uk: Внутрішня помилка: немає реалізації методу fetch_prev() для моделі даних

source: Can't fetch previous row: %s
ca: No es pot obtenir la fila anterior: %s
tr: Önceki satır alınamıyor: %s
uk: Не вдалося отримати попередній рядок: %s

source: Can't move iter at row '%d': %s
ca: No es pot moure l'iterador de la fila «%d»: %s
tr: '%d' satırında iter taşınamıyor:%s
uk: Не вдалося пересунути ітератор у рядок «%d»: %s

source: Can't fetch row '%d': %s
ca: No es pot obtenir la fila «%d»: %s
tr: '%d' satırı alınamıyor: %s
uk: Не вдалося отримати рядок «%d»: %s

source: Could not change iter's value for column %d: %s
ca: No s'ha pogut canviar el valor de l'iterador de la columna %d: %s
ro: Nu s-a putut modifica valoarea iteratorului pentru coloana %d: %s
tr: Sütun %d için iter değeri değiştirilemedi: %s
uk: Не вдалося змінити значення ітератора для стовпчика %d: %s

source: Allowed GdaHolder's value to be NULL for the iterator to be updated
ca: S'ha permès que el valor de GdaHolder sigui NULL perquè s'actualitzi l'iterador
ro: Valoarea GdaHolder permisă trebuie să fie NULL pentru ca iteratorul să fie actualizat
tr: Yineleyicinin güncellenmesi için geçerli GdaHolder değeri NULL olmalıdır
uk: Дозволене значення GdaHolder має бути рівним NULL, щоб ітератор було оновлено

source: Some columns can't be modified
ca: No es poden modificar algunes columnes
ro: Unele coloane nu pot fi modificate
tr: Bazı sütunlar değiştirilemiyor
uk: Вміст деяких стовпчиків не може бути змінено

source: Internal error: can't get the prepared statement's actual statement
ca: Error intern: no es pot obtenir la consulta real de la consulta preparada
ro: Eroare internă: nu se poate pregăti comanda actuală a comenzii pregătite
tr: İç hata: hazırlanmış ifadenin güncel ifadesi alınamıyor
uk: Внутрішня помилка: не вдалося отримати справжню інструкцію з приготованої інструкції

source: Unable to identify a way to fetch a single row
ca: No s'ha pogut trobar la manera d'obtenir una sola fila
ro: Nu se poate identifica o metodă prin care să se aducă un singur rând
tr: Tek bir satır çekmenin bir youlu tanımlanamadı
uk: Не вдалося ідентифікувати спосіб отримання окремого рядка

source: Can only operate on non compound SELECT statements
ca: Només es pot operar amb declaracions SELECT no compostes
ro: Se poate opera doar la comenzi SELECT compuse
tr: Yalnızca birleşik olmayan SELECT ifadelerinde kullanılabilir
uk: Можна працювати лише із інструкціями SELECT, які не є складеними

source: Modifications are not allowed anymore
ca: Ja no es permeten modificacions
ro: Modificările nu mai sunt permise
tr: Artık değişikliklere izin verilmeyecek
uk: Внесення змін більше не є можливим

source: No UPDATE statement provided
ca: No s'ha proporcionat una declaració UPDATE
ro: Nicio comandă UPDATE furnizată
tr: Sağlanan bir UPDATE ifadesi yok
uk: Не надано інструкції UPDATE

source: Could not get iterator's value
ca: No s'ha pogut obtenir el valor de l'iterador
ro: Nu s-a putut obține valoarea iteratorului
tr: Yineleyicinin değeri alınamadı
uk: Не вдалося отримати значення ітератора

source: Column %d can't be modified
ca: No es pot modificar la columna %d
ro: Coloana %d nu poate fi modificată
tr: %d sütunu değiştirilemiyor
uk: Стовпчик %d не може бути змінено

source: Too many values (%d as maximum)
ca: Hi ha massa valors (el màxim és %d)
ro: Prea multe valori (%d este maximul)
tr: Çok fazla değer var (en fazla %d)
uk: Забагато значень (максимум — %d)

source: No INSERT statement provided
ca: No s'ha proporcionat d'una declaració INSERT
ro: Nicio comandă INSERT furnizată
tr: Sağlanan bir INSERT ifadesi yok
uk: Не вказано інструкції INSERT

source: Cannot add a row because the number of rows is unknown
ca: No es pot afegir una fila perquè el nombre de files és desconegut
tr: Satır eklenemiyor çünkü satır sayısı bilinmiyor
uk: Не можна додати рядок, оскільки кількість рядків є невідомою

source: Missing values to insert in INSERT statement
ca: Falten els valors per a inserir en la declaració INSERT
ro: Lipsesc valorile de inserat în comanda INSERT
tr: INSERT ifadesine eklenecek değerler eksik
uk: Не вказано значень, які слід вставити за допомогою інструкції INSERT

source: No DELETE statement provided
ca: No s'ha proporcionat una declaració DELETE
ro: Nicio comandă DELETE furnizată
tr: Sağlanan bir DELETE ifadesi yok
uk: Не надано інструкції DELETE

source: Internal error: GdaDataSelect has %d GdaColumns, and SELECT statement has %d expressions
ca: Error intern: GdaDataSelect té %d GdaColumns, i la instrucció SELECT té %d expressions
ro: Eroare internă: GdaDataSelect are %d GdaColumns, și instrucțiunea SELECT are %d expresii
tr: İç hata: GdaDataSelect %d GdaColumns'a ve SELECT ifadesi %d ifadelerine sahiptir
uk: Внутрішня помилка: GdaDataSelect має %d GdaColumns, а інструкція SELECT містить %d виразів

source: An error has occurred, the value returned by the "exec-params" property will be wrong: %s
ca: S'ha produït un error. El valor retornat per la propietat «exec-params» serà incorrecte: %s
ro: A apărut o eroare, valoarea întoarsă de proprietatea „exec-params” nu va fi corectă: %s
tr: Bir hata oluştu, "exec-params" özelliğinden dönen değer yanlış olacak: %s
uk: Сталася помилка — значення, яке поверне властивість «exec-params» буде помилковим: %s

source: Data model has been modified
ca: S'ha modificat el model de dades
ro: Dacă modelul a fost modificat
tr: Veri modeli değiştirilmiş
uk: Модель даних було змінено

source: Data model contains BLOBs
ca: El model de dades conté BLOB
ro: Modelul de date conține BLOB-uri
tr: Veri modeli BLOB içeriyor
uk: У моделі даних містяться BLOB-и

source: Can't get the number of rows of data model
ca: No es pot obtenir el nombre de files del model de dades
ro: Nu s-a putut obține numărul de rânduri de model de date
tr: Veri modelinin satırlarının sayısı alınamıyor
uk: Не вдалося отримати кількість рядків у моделі даних

source: Could not parse '%s': Validation for XML files for GdaDbCreator will not be performed (some weird errors may occur)
ca: No s'ha pogut analitzar «%s»: la validació de fitxers XML de GbaDbCreator no es portarà a terme (poden produir-se errors)
tr: '%s' ayrıştırılamadı: GdaDbCreator için XML dosyaları için doğrulama yapılmayacak (bazı garip hatalar oluşabilir)
uk: Не вдалося обробити «%s»: перевірку файлів XML для GdaDbCreator не буде виконано (у результаті можуть статися неочікувані помилки)

source: Context to validate xml file can't be created.
ca: No es pot crear el context per a validar el fitxer xml.
ro: Contextul pentru validarea fișierului xml nu poate fi creeat.
tr: Xml dosyasını doğrulamak için içerik oluşturulamıyor.
uk: Не вдалося створити контекст для перевірки файла xml.

source: xml file is invalid
ca: el fitxer xml no és vàlid
ro: fișierul xml nu este valid
tr: xml dosyası geçersiz
uk: Файл xml є некоректним

source: Root node should be <schema>.
ca: El node arrel ha de ser <schema>.
tr: Kök düğüm <schema> olmalıdır.
uk: Кореневим вузлом має бути <schema>.

source: xmlDoc object can't be created from xmfile name '%s'
ca: No es pot crear l'objecte xmlDoc a partir del nom xmfile «%s»
ro: obiectul xmlDoc nu poate di creeat din numele xmfile „%s”
tr: xmlDoc nesnesi '%s' xmfile adından oluşturulamıyor
uk: Об'єкт xmlDoc не можна створити з назви xmfile «%s»

source: xml file '%s' is not valid
ca: el fitxer xml «%s» no és vàlid
ro: fișierul xml „%s” nu este valid
tr: '%s' xml dosyası geçerli değil
uk: Файл xml «%s» є некоректним

source: Connection is not opened
ca: No s'ha obert la connexió
tr: Bağlantı açılmadı
uk: З'єднання не відкрито

source: Can't open stream for reading file '%s'
ca: No es pot obrir el flux per a llegir el fitxer «%s»
tr: '%s' dosyasını okumak için akış açılamıyor
uk: Не вдалося відкрити потік для читання файла «%s»

source: Can't create parse context for '%s'
ca: No es pot crear un context d'anàlisi per a «%s»
tr: '%s' için ayrıştırma bağlamı oluşturulamıyor
uk: Не вдалося створити контекст обробки для «%s»

source: Error during parsing with error '%d'
ca: S'ha produït l'error «%d» durant l'anàlisi
ro: Eroare în timpul parsării: „%d”
tr: Ayrıştırma sırasında hata '%d' hatasıyla
uk: Помилка під час обробки, «%d»

source: Failed to parse file: '%s'
ca: No s'ha pogut analitzar el fitxer: «%s»
tr: Dosya ayrıştırılamadı: '%s'
uk: Не вдалося обробити файл: «%s»

source: XML Document can't be created from file: '%s'
ca: No es pot crear el document XML a partir del fitxer: «%s»
ro: Documentul XML nu poate fi creeat din fișier: „%s”
tr: XML Belgesi dosyadan oluşturulamıyor: '%s'
uk: Не вдалося створити документ XML з файла: «%s»

source: XML file is not valid
ca: El fitxer XML no és vàlid
ro: Fișierul XML nu este valid
tr: XML dosyası geçerli değil
uk: Файл XML є некоректним

source: Invalid column type %s. See API for gda_g_type_from_string ().
ca: El tipus de columna %s no és vàlid. Vegeu l'API de gda_g_type_from_string ().
ro: Tip de coloană nevalid %s. Consultați API-up pentru gda_g_type_from_string ().
tr: Geçersiz sütun türü %s. Gda_g_type_from_string () için API'ye bakın.
uk: Некоректний тип стовпчика %s. Див. програмний інтерфейс gda_g_type_from_string ().

source: Internal error: Operation should be prepared, setting a connection data
ca: Error intern: s'ha de preparar l'operació. S'estan establint dades de connexió
tr: İç hata: Bir bağlantı verisi ayarlayarak işlem hazırlanmalı
uk: Внутрішня помилка: має бути приготовано дію, встановлення даних з'єднання

source: Operation is not implemented for the used provider
ca: L'operació no està implementada per al proveïdor utilitzat
tr: İşlem, kullanılan sağlayıcı için gerçeklenmedi
uk: Дію для використаного надавача даних не реалізовано

source: Empty column list
ca: La llista de columnes és buida
ro: Listă de coloane goală
tr: Boş sütun listesi
uk: Порожній список стовпчиків

source: View name is not set
ca: No s'ha definit el nom de la vista
tr: Görünüm adı belirli değil
uk: Не встановлено назви перегляду

source: View definition is not set
ca: No s'ha definit la definició de la vista
tr: Görünüm tanımı belirli değil
uk: Не встановлено визначення перегляду

source: Unable to set holder's value: %s
ca: No es pot definir el valor del contenidor: %s
ro: Nu se poate stabili valoarea deținătorului: %s
tr: Tutucunun değer ayarlanamıyor: %s
uk: Не вдалося встановити значення утримувача: %s

source: The 'g-type' property cannot be changed
ca: La propietat «g-type» no es pot modificar
ro: Proprietatea „g-type” nu poate fi modificată
tr: 'g-type' özelliği değiştirilmiş olamaz
uk: Не можна змінювати властивість «g-type»

source: Unable to convert string to '%s' type
ca: No es pot convertir la cadena al tipus «%s»
ro: Nu se poate converti șirul la tipul „%s”
tr: Karakter dizisi '%s' türüne dönüştürülemiyor
uk: Не вдалося перетворити рядок до типу «%s»

source: Can't use this method to set value because there is already a static value
ca: No es pot utilitzar aquest mètode per a definir el valor perquè ja hi ha un valor estàtic
ro: Nu se poate utiliza această metodă pentru a stabili valoarea deoarece există deja o valoare statică
tr: Bu metod değer ayarlamak için kullanılamıyor çünkü zaten statik bir değer
uk: Не можна встановлювати цей метод для встановлення значення, оскільки вже є статичне значення

source: (%s): Holder does not allow NULL values
ca: (%s): el contenidor no permet valors NULL
ro: (%s): Deținătorul nu permite valori NULL
tr: (%s): Tutucu NULL değerlerine izin vermez
uk: (%s): у Holder не може бути значень NULL

source: (%s): Wrong Holder value type, expected type '%s' when value's type is '%s'
ca: (%s): el tipus de valor del contenidor és incorrecte. S'esperava el tipus «%s» però el tipus del valor és «%s»
ro: (%s): Tip de valoare de deținător incorectă, s-a așteptat tipul „%s” când tipul valorii este „%s”
tr: (%s): Yanlış Tutucu değeri türü, beklenen tür '%s', değer türü '%s' olduğunda
uk: (%s): помилковий тип значення Holder: мав бути тип «%s», якщо типом значення є «%s»

source: (%s): Wrong value type: expected type '%s' when value's type is '%s'
ca: (%s): el tipus de valor és incorrecte. S'esperava el tipus «%s» però el tipus del valor és «%s»
ro: (%s): Tip de valoare incorect: s-a așteptat „%s” când tipul valorii este „%s”
tr: (%s): Yanlış değer türü: beklenen tür '%s', değer türü '%s' olduğunda
uk: (%s): помилковий тип значення: мав бути тип «%s», якщо типом значення є «%s»

source: GdaHolder has a gda type (%s) incompatible with source column %d type (%s)
ca: El tipus gda del GdaHolder (%s) no és compatible amb el tipus de la columna d'origen %d (%s)
ro: GdaHolder are un tip de gda (%s) incompatibil cu coloana sursă %d tipul (%s)
tr: GdaHolder, gda türü (%s) ile uyumsuz %d kaynak sütununa sahip (%s)
uk: GdaHolder належить до типу gda (%s), який є несумісним із типом початкового стовпчика %d (%s)

source: Cannot bind holders if their type is not the same, breaking existing bind where '%s' was bound to '%s'
ca: No es poden vincular contenidors si no són del mateix tipus. S'està trencant el vincle existent entre «%s» i «%s»
ro: Nu se pot lega deținătorii dacă tipul lor nu este același, se separă legăturile unde „%s” a fost legat la „%s”
tr: Tutucular, kendi türü aynı değilse bağlanamazlar, var olan bağ '%s' bağlı olduğu '%s' yerinde kırılır
uk: Не можна пов'язати утримувачі, якщо вони різних типів — порушення наявного зв'язку, де «%s» було пов'язано із «%s»

source: Cannot bind holders if their type is not the same
ca: No es poden vincular contenidors si no són del mateix tipus
ro: Nu se pot lega deținătorii dacă tipul lor nu este același
tr: Tutucular, kendi türleri aynı değilse bağlanamazlar
uk: Не можна пов'язати утримувачі, якщо вони різних типів

source: Could not change GdaHolder to match value change in bound GdaHolder: %s
ca: No s'ha pogut canviar el GdaHolder per a fer-lo coincidir amb el canvi de valor del GdaHolder vinculat: %s
ro: Nu s-a putut modifica GdaHolder pentru a se potrivi cu modificarea valorii în legătura GdaHolder: %s
tr: Bağlı GdaHolder da eşleşen değer değişimi için GdaHolder değişemez: %s
uk: Не вдалося змінити GdaHolder так, щоб він відповідав зміні у межах GdaHolder: %s

source: Ignoring attempt to re-initialize GDA library.
ca: S'està ignorant l'intent de reinicialitzar la biblioteca GDA.
ro: Se ignoră încercarea de a reinițializa biblioteca GDA.
tr: GDA kütüphanesini yeniden başlatacak girişim yok sayılıyor.
uk: Ігноруємо спробу повторно ініціалізувати бібліотеку GDA.

source: libgda needs GModule. Finishing...
ca: la libgda necessita el GModule. S'està finalitzant...
ro: libgda necesită GModule. Se finalizează...
tr: libgda için GModule gerekir. Sonlandırılıyor...
uk: Для libgda потрібен GModule. Завершення...

source: Connection string for the internal connection to use
ca: La cadena de connexió que s'ha d'utilitzar per a la connexió interna
ro: Șirul de conexiune utilizat de conexiunea internă
tr: Kullanılacak iç bağlantı için bağlantı dizgesi
uk: Рядок з'єднання для внутрішнього з'єднання, яким слід скористатися

source: Connection object internally used
ca: L'objecte de connexió utilitzat internament
ro: Obiectul de conexiune utilizat intern
tr: Bağlantı nesnesi içsel kullanım
uk: Об'єкт з'єднання, яким слід скористатися на внутрішньому рівні

source: Catalog in which the database objects will be created
ca: Catàleg al qual es crearan els objectes de la base de dades
ro: Catalog în care vor fi create obiectele bazei de date
tr: Veri tabanı nesnelerinin oluşturulacağı katalog
uk: Каталог, у якому буде створено об'єкти бази даних

source: Schema in which the database objects will be created
ca: Esquema on es crearan els paràmetres de la base de dades
ro: Schema în care vor fi create obiectele bazei de date
tr: Veri tabanı nesnelerinin oluşturulacağı şema
uk: Схема, у якій буде створено об'єкти бази даних

source: Catalog specified but no schema specified, store will not be usable
ca: S'ha especificat un catàleg però no s'ha especificat cap esquema. El magatzem no es podrà utilitzar
ro: Catalogul a fost specificat dar nicio schemă nu este specificată, nu se va putea utiliza
tr: Katalog belirtilmiş ancak bir şema belirtilmemiş, bellek kullanılabilir olmayacak
uk: Вказано каталог, але не вказано схеми, сховищем не можна буде скористатися

source: Can't obtain connection lock
ca: No s'ha pogut obtenir el blocatge de la connexió
ro: Nu se poate obține blocarea conexiunii
tr: Bağlantı kilidi alınamıyor
uk: Не вдалося отримати блокування з'єднання

source: Could not open internal GdaMetaStore connection: %s
ca: No s'ha pogut obrir la connexió interna de GdaMetaStore: %s
tr: İç GdaMetaStore bağlantısı açılamadı: %s
uk: Не вдалося відкрити внутрішнє з'єднання GdaMetaStore: %s

source: Could not create internal GdaMetaStore connection: %s
ca: No s'ha pogut crear la connexió interna de GdaMetaStore: %s
tr: İç GdaMetaStore bağlantısı oluşturulamadı: %s
uk: Не вдалося створити внутрішнє з'єднання GdaMetaStore: %s

source: Internal error while trying to render operation in MetaStore creation: %s
ca: S'ha produït un error intern en intentar renderitzar l'operació de la creació de MetaStore: %s
tr: MetaStore oluşturma işleminde işlem oluşturmaya çalışırken iç hata: %s
uk: Внутрішня помилка під час спроби обробити операцію у створенні MetaStore: %s

source: No error was set
ca: No s'ha definit cap error
tr: Hata ayarlanmadı
uk: Не було встановлено помилки

source: Internal Error. Couldn't create MetaStore table '%s': %s
ca: Error intern. No s'ha pogut crear la taula de MetaStore «%s»: %s
tr: İç hata. '%s' MetaStore tablosu oluşturulamadı: %s
uk: Внутрішня помилка. Не вдалося створити таблицю MetaStore «%s»: %s

source: Could not set the internal schema's version. No prepared statement's parameters were found
ca: No s'ha pogut definir la versió de l'esquema intern. No s'ha trobat cap paràmetre de declaració preparada
tr: İç şemanın sürümü ayarlanamadı. Hazırlanan hiçbir deyimin parametresi bulunamadı
uk: Не вдалося встановити версію внутрішньої схеми. Не знайдено параметрів приготованої інструкції

source: Could not set the internal schema's version. Statement execution fails
ca: No s'ha pogut establir la versió interna de l'esquema. Ha fallat 'execució de la declaració
tr: İç şemanın sürümü ayarlanamadı. İfade yürütme başarısız
uk: Не вдалося встановити версію внутрішньої схеми. Виконання інструкції зазнало невдачі

source: Internal error: no information schema was found: %s
ca: Error intern: no s'ha trobat cap esquema d'informació: %s
tr: İç hata: bilgi şeması bulunamadı: %s
uk: Внутрішня помилка: не знайдено схеми інформації: %s

source: Internal error: can't read information schema: %s
ca: Error intern: no es pot llegir l'esquema d'informació: %s
tr: İç hata: bilgi şeması okunamıyor: %s
uk: Внутрішня помилка: не вдалося прочитати схему інформації: %s

source: Missing view name from <view> node
ca: Falta el nom de la vista en el node <view>
ro: Lipsește numele vizualizării de la nodul <view>
tr: <view> düğümünde görünüm adı eksik
uk: Пропущено назву панелі перегляду з вузла <view>

source: Missing view definition from <view> node
ca: Falta la definició de la vista en el node <view>
ro: Lipsește definiția vizualizării de la nodul <view>
tr: <view> düğümünde görünüm tanımı eksi
uk: Пропущено визначення панелі перегляду з вузла <view>

source: View definition contains more than one statement (for view '%s')
ca: La definició de la vista conté més d'una declaració (per a la vista «%s»)
ro: Definiția vizualizării conține mai mult de o comandă (pentru vizualizarea „%s”)
tr: Görünüm tanımı birden fazla ifade içeriyor ('%s' görünümü için)
uk: Визначення панелі перегляду містить понад одну інструкцію (для панелі перегляду «%s»)

source: View definition is not a selection statement (for view '%s')
ca: La definició de la vista no és una declaració de selecció (per a la vista «%s»)
ro: Definiția vizualizării nu este o comandă de selecție (pentru vizualizarea „%s”)
tr: Görünüm tanımı bir seçim ifadesi değil ('%s' görünümü için)
uk: Визначення панелі перегляду не є інструкцією вибору (для панелі перегляду «%s»)

source: Missing table name from <table> node
ca: Falta el nom de la taula del node <table>
ro: Lipsește numele tabelei de la nodul <table>
tr: <table> düğümünde tablo adı eksik
uk: У вузлі <table> пропущено назву таблиці

source: Column '%s' already exists and has different characteristics
ca: La columna «%s» ja existeix i té característiques diferents
ro: Coloana „%s” există deja și are caracteristici diferite
tr: '%s' sütunu zaten var ve başka özelliklere sahip
uk: Стовпчик «%s» вже існує і має інші характеристики

source: Missing foreign key's referenced table name (for table '%s')
ca: Falta el nom de la taula referenciada per a les claus externes (per a la taula «%s»)
ro: Lipsește numele referențiat al tabelei pentru cheia străină (pentru tabela „%s”)
tr: Eksik yabancı anahtarın başvuru tablosu adı ('%s' tablosu için)
uk: Пропущено назву таблиці, на яку посилається сторонній ключ (для таблиці «%s»)

source: Missing foreign key's column name (for table '%s')
ca: Falta el nom de la columna de la clau externa (de la taula «%s»)
ro: Lipsește numele coloanei pentru cheia străină (pentru tabela „%s”)
tr: Eksik yabancı anahtarın sütun adı ('%s' tablosu için)
uk: Пропущено назву стовпчика стороннього ключа (для таблиці «%s»)

source: Column '%s' not found in table '%s'
ca: No s'ha trobat la columna «%s» a la taula «%s»
ro: Coloana „%s” nu a fost găsită în tabela „%s”
tr: '%s' sütunu '%s' tablosunda bulunamadı
uk: Стовпчика «%s» немає у таблиці «%s»

source: Foreign key column '%s' not found in table '%s'
ca: Columna de la clau externa «%s» no trobada a la taula «%s»
ro: Coloana cheie străină „%s” nu a fost găsită în tabela „%s”
tr: '%s' yabancı anahtar sütunu '%s' tablosunda bulunamadı
uk: Стовпчика стороннього ключа «%s» не знайдено у таблиці «%s»

source: Could not update the internal schema's version. No prepared statement's parameters were found
ca: No s'ha pogut actualitzar la versió de l'esquema intern. No s'ha trobat cap paràmetre de declaració preparada
tr: İç şemanın sürümü güncellenemedi. Hazırlanan hiçbir deyimin parametresi bulunamadı
uk: Не вдалося оновити версію внутрішньої схеми. Не знайдено параметрів приготованої інструкції
