Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Sqlite boolean representation
ca: Representació booleana Sqlite
ro: Rperezentare logică Sqlite
tr: Sqlite boole gösterimi
uk: Булеве представлення Sqlite

source: Parameter '%s' not found in statement
ca: El paràmetre «%s» no es troba a la declaració
tr: '%s' parametresi ifade içinde bulunamadı
uk: У інструкції не знайдено параметра «%s»

source: No column name to associate to parameter '%s'
ca: No hi ha cap nom de columna a associar al paràmetre «%s»
ro: Niciun nume de coloană de asociat la parametrul „%s”
tr: '%s' parametresine bağlı bir sütun yok
uk: Немає назви стовпчика, яку слід пов'язати із параметром «%s»

source: Parameter '%s' not found is statement
ca: El paràmetre «%s» no es troba a la declaració
ro: Parametrul „%s” nu a fost găsit în comandă
tr: '%s' parametresi, ifade içinde bulunamadı
uk: У інструкції не знайдено параметра «%s»

source: Binding a BLOB for this type of statement is not supported
ca: No està suportada la vinculació d'un BLOB per a aquest tipus de declaració
ro: Legarea unui BLOB pentru acest tip de comandă nu este suportată
tr: İfadenin bu türü için bir BLOB bağlama desteklenmiyor
uk: Підтримки прив'язки BLOB до цього типу інструкції не передбачено

source: Set to TRUE if the provider is the internal default
ca: TRUE si el proveïdor és el valor intern predeterminat
tr: Sağlayıcı iç öntanımlı ise TRUE olarak ayarla
uk: Встановіть TRUE, якщо надавач даних є вбудованим типовим

source: Can't find libsqlite3.
ca: No es pot trobar la libsqlite3.
ro: Nu se poate găsi libsqlite3.
tr: libsqlite3 bulunamıyor.
uk: Не вдалося знайти libsqlite3.

source: The connection string must contain DB_DIR and DB_NAME values
ca: La cadena de connexió ha de contenir els valors DB_DIR i DB_NAME
ro: Șirul de conexiune trebuie să conțină valorile DB_DIR și DB_NAME
tr: Bağlantı dizgesi DB_DIR ve DB_NAME değerleri içermelidir
uk: У рядку з'єднання мають міститися значення DB_DIR і DB_NAME

source: The connection string format has changed: replace URI with DB_DIR (the path to the database file) and DB_NAME (the database file without the '%s' at the end).
ca: El format de cadena de connexió ha canviat: substituïu URI per DB_DIR (el camí d'accés al fitxer de base de dades) i DB_NAME (el fitxer de la base de dades sense el «%s» al final).
ro: Formatul șirului de conexiune a fost modificat: înlocuiți adresa URI cu DB_DIR (calea către fișierul bazei de date) și DB_NAME (fișierul bazei de date fără „%s” la sfârșit).
tr: Bağlantı dizge biçimi değişti: URI, DB_DIR (veri tabanı dosyası yolu) ve DB_NAME ile değişmeli (sonunda '%s' olmayan veri tabanı dosyası)
uk: Змінено формат рядка з'єднання: замініть адресу DB_DIR (шляхом до файла бази даних) і DB_NAME (файлом бази даних без «%s» наприкінці).

source: The DB_DIR part of the connection string must point to a valid directory
ca: La part DB_DIR de la cadena de connexió ha d'apuntar a una carpeta vàlida
ro: Partea DB_DIR din șirul de conexiune trebuie să indice către un dosar valid
tr: Bağlantı dizge sinin DB_DIR kısmı, geçerli bir dizini göstermek zorundadır
uk: Частина DB_DIR рядка з'єднання має вказувати на коректний каталог

source: Wrong encryption passphrase
ca: Contrasenya de xifratge incorrecta
ro: Criptare incorectă cu parolă tip frază
tr: Yanlış şifreleme parola cümlesi
uk: Помилковий пароль шифрування

source: SECURITY WARNING: Load Extension is enable for SQL commands, this means an attacker can access extension load capabilities
ca: ADVERTIMENT DE SEGURETAT: l'extensió de càrrega està habilitada per a ordres SQL, això significa que un atacant pot accedir a funcions de càrrega d’extensions
ro: AVERTISMENT DE SECURITATE: „Încarcă extensia” este activată pentru comenzi SQL, asta înseamnă că un atacator poate accesa capabilitățile de încărcare de extensii
tr: GÜVENLİK UYARI: Yük Uzatma SQL komutları için etkindir, bu bir saldırganın uzatma yük yeteneklerine erişebileceği anlamına gelir
uk: ПОПЕРЕДЖЕННЯ ЩОДО ЗАХИСТУ: увімкнено завантаження розширень для команд SQL; це означає, що зловмисник може отримати доступ до можливостей завантаження розширень

source: Could not set empty_result_callbacks SQLite option: %s
ca: No s'ha pogut establir l'opció empty_result_callbacks SQLite: %s
ro: Nu se poate stabili opțiunea SQlite empty_result_callbacks: %s
tr: SQLite seçeneği empty_result_callbacks ayarlanamadı: %s
uk: Не вдалося встановити параметр SQLite empty_result_callbacks: %s

source: Could not register function '%s'
ca: No s'ha pogut registrar la funció «%s»
ro: Nu s-a putut înregistra funcția „%s”
tr: '%s' fonksiyonu kaydedilemedi
uk: Не вдалося зареєструвати функцію «%s»

source: Could not define the %s collation
ca: No s'ha pogut definir la intercalació %s
ro: Nu s-a putut defini ordonarea alfabetică „%s”
tr: %s karşılaştırması tanımlanamadı
uk: Не вдалося визначити об'єднання %s

source: Error initializing database with passphrase
ca: S'ha produït un error en inicialitzar la base de dades amb contrasenya
ro: Eroare la inițializarea bazei de date cu o parolă tip frază
tr: Parola cümlesi ile veri tabanı başlatma hatası
uk: Помилка ініціалізації бази даних з використанням пароля

source: Missing database name or directory
ca: Falta el nom o el directori de la base de dades
ro: Lipsește dosarul sau numele bazei de date
tr: Veri tabanı adı veya dizini eksik
uk: Пропущено назву бази даних або каталог

source: Transactions are not supported in read-only mode
ca: No es poden fer transaccions en el mode de només lectura
ro: Tranzacțiile nu sun suportate în modul protejat la scriere
tr: Toplu işlemler, salt okunur kipinde desteklenmiyor
uk: У режимі лише-читання транзакції не підтримуються

source: SQLite does not support specifying fields to apply DISTINCT clause on
ca: SQLite no permet especificar camps on aplicar la clàusula DISTINCT
ro: SQLite nu suportă specificarea câmpurilor de aplicat clauza DISTINCT
tr: SQLite, DISTINCT cümlesine eklenmesi için belirtilen alanları desteklemiyor
uk: У SQLite не передбачено підтримки задання полів для застосування пункту DISTINCT

source: '%s' compound not supported by SQLite
ca: «%s» component no suportat per SQLite
ro: Combinația „%s” nu este admisă de SQLite
tr: '%s' birleştirme SQLite tarafından desteklenmiyor
uk: Підтримки з'єднання «%s» у SQLite не передбачено

source: ILIKE operation not supported
ca: Operació ILIKE no suportada
ro: Operația ILIKE nu este suportată
tr: ILIKE işlemi desteklenmiyor
uk: Підтримки операції ILIKE не передбачено

source: SIMILAR operation not supported
ca: Operació SIMILAR no suportada
tr: SIMILAR işlemi desteklenmiyor
uk: Підтримки операції SIMILAR не передбачено

source: Operator type not supported
ca: Tipus d'operador no suportat
tr: Operatör tipi desteklenmiyor
uk: Підтримки типу оператора не передбачено

source: Unnamed parameter is not allowed in prepared statements
ca: No es permet un paràmetre sense nom a les declaracions preparades
ro: Parametrul nedenumit nu este permis în comenzile pregătite
tr: Adlandırılmamış parametre, hazırlanmış ifadelerde izinli değil
uk: Не можна використовувати параметр без назви у приготованих інструкціях

source: Can't build SELECT statement to get last inserted row: %s
ca: No es pot construir una declaració SELECT per a obtenir l'última fila inserida: %s
ro: Nu se poate construi comanda SELECT pentru a obține ultimul rând inserat: %s
tr: Son eklenmiş satır için SELECT ifadesi oluşturulamıyor: %s
uk: Не вдалося побудувати інструкцію SELECT для отримання останнього вставленого рядка: %s

source: SELECT statement to get last inserted row did not return any row
ca: La declaració SELECT per a obtenir l'última fila inserida no retorna cap fila
ro: Comanda SELECT pentru a obține ultimul rând inserat nu a întors niciun rând
tr: Son eklenmiş satırı almak için çalışan SELECT ifadesi herhangi bir satır döndürmedi
uk: Інструкція SELECT для отримання останнього вставленого рядка не повернула жодного рядка

source: SELECT statement to get last inserted row returned too many (%d) rows
ca: La sentència SELECT per a obtenir l'última fila inserida ha retornat massa (%d) files
ro: Comanda SELECT pentru a obține ultimul rând inserat a întors prea multe rânduri (%d)
tr: Son eklenmiş satırı almak için çalışan SELECT ifadesi çok fazla (%d) satır döndürdü
uk: Інструкція SELECT для отримання останнього вставленого рядка повернула надто багато рядків (%d)

source: Prepared statement has no associated GdaStatement
ca: La declaració preparada no té una GdaStatement associada
ro: Comanda pregătită nu are un GdaStatement asociat
tr: Hazırlanmış ifade ilişkili bir GdaStatement sahibi değil
uk: Приготована інструкція не має пов'язаного GdaStatement

source: Can't create SQLite BLOB handle
ca: No es pot crear el gestor BLOB de SQLite
ro: Nu se poate crea operatorul BLOB SQlite
tr: SQLite BLOB işlemi oluşturulamıyor
uk: Не вдалося створити обробник BLOB SQLite

source: Can't write to SQLite's BLOB
ca: No es pot escriure al BLOB de SQLite
ro: Nu se poate scrie la BLOB SQLite
tr: SQLite BLOB ifadesine yazılamıyor
uk: Не вдалося записати до BLOB SQLite

source: Can't obtain SQLite BLOB handle (reported type is '%s'), please report this bug to http://gitlab.gnome.org/GNOME/libgda/issues
ca: No es pot obtenir el gestor de BLOB de SQLite (el tipus reportat és «%s»), si us plau comuniqueu aquest error a http://gitlab.gnome.org/GNOME/libgda/issues
tr: SQLite BLOB tanıtıcısı alınamıyor (bildirilen tür '%s'), lütfen bu hatayı http://gitlab.gnome.org/GNOME/libgda/issues'e bildirin
uk: Не вдалося отримати дескриптор BLOB SQLite (повідомленим типом є «%s»), будь ласка, повідомте про цю ваду на сторінці http://gitlab.gnome.org/GNOME/libgda/issues

source: Can't identify the ROWID of the blob to fill
ca: No es pot identificar l'id de fila ROWID del BLOB a omplir
ro: Nu se poate identifica ROWIDul blobului de completat
tr: Doldurmak için blob un ROWID değeri tanımlanamıyor
uk: Не вдалося ідентифікувати ROWID блобу для заповнення

source: Empty statement
ca: Declaració buida
ro: Comandă liberă
tr: Boş ifade
uk: Порожня інструкція

source: Missing parameter(s) to execute query
ca: Falta/falten paràmetre(s) per a executar la consulta
ro: Lipsesc parametrii pentru executarea interogării
tr: Sorgu çalıştırmak için parametre(ler) eksik
uk: Пропущено параметри для виконання запиту

source: Can't rewrite statement handle default values
ca: No es pot reescriure la declaració per a gestionar els valors predeterminats
ro: Nu se pot rescrie valorile implicite pentru operatorul comenzii
tr: İfade işlemi öntanımlı değerleri yeniden yazılamaz
uk: Не можна перезаписувати типові значення обробника інструкцій

source: Can't get BLOB's length
ca: No es pot obtenir la longitud del BLOB
ro: Nu se poate obține lungimea lui BLOB
tr: BLOB uzunluğu alınamıyor
uk: Не вдалося отримати довжину BLOB

source: BLOB is too big
ca: El BLOB és massa gran
ro: BLOB este prea mare
tr: BLOB çok büyük
uk: BLOB є надто великим

source: Non handled data type '%s'
ca: Tipus de dades «%s» no gestionat
ro: Tip de date negestionate ”%s”
tr: İşlenmeyen veri türü '%s'
uk: Непридатний до обробки тип даних «%s»

source: Could not start transaction to create BLOB
ca: No s'ha pogut iniciar la transacció per a crear el BLOB
ro: Nu s-a putut porni tranzacția pentru a crea BLOB
tr: BLOB oluşturmak için toplu işlem başlatılamadı
uk: Не вдалося запустити транзакцію для створення BLOB

source: Function requires one argument
ca: La funció requereix un argument
ro: Funcția necesită un argument
tr: Fonksiyon için bir değişken gerekli
uk: Функція потребує одного аргументу

source: Function requires two arguments
ca: La funció requereix dos arguments
ro: Funcția necesită două argumente
tr: Fonksiyon için iki değişken gerekli
uk: Функція потребує двох аргументів

source: Function requires one or two arguments
ca: La funció requereix un o dos arguments
ro: Funcția necesită unul sau două argumente
tr: Fonksiyon için bir ya da iki değişken gerekli
uk: Функція потребує одного або двох аргументів

source: Function requires two or three arguments
ca: La funció requereix dos o tres arguments
ro: Funcția necesită două sau trei argumente
tr: Fonksiyon için iki ya da üç değişken gerekli
uk: Функція потребує двох або трьох аргументів

source: SQLite regexp '%s' error:
ca: Error en l'expressió regular «%s» de SQLite:
ro: Eroare regexp SQLite „%s”:
tr: SQLite regexp '%s' hatası:
uk: Помилка формального виразу SQLite «%s»:

source: Invalid regular expression
ca: Expressió regular no vàlida
ro: Expresie regulată nevalidă
tr: Geçersiz düzenli ifade
uk: Помилка у формальному виразі

source: Column %d out of range (0-%d), ignoring its specified type
ca: La columna %d és fora de rang (0-%d), ignorant el seu tipus especificat
ro: Coloana %d este în afara intervalului (0-%d), se ignoră tipul său specificat
tr: %d sütunu sınırın dışında (0-%d), belirtilen tür yoksayılıyor
uk: Стовпчик %d поза діапазоном (0-%d), ігноруємо його вказаний тип

source: Integer value is too big
ca: El valor sencer és massa gran
ro: Valoarea întreagă este prea mare
tr: Tam sayı değeri çok büyük
uk: Надто велике ціле значення

source: Unable to open BLOB
ca: No es pot obrir el BLOB
ro: Nu s-a putut deschide BLOB
tr: BLOB açılamadı
uk: Не вдалося відкрити BLOB

source: Invalid date '%s' (date format should be YYYY-MM-DD)
ca: Data no vàlida «%s» (el format ha de ser AAAA-MM-DD)
ro: Dată nevalidă „%s” (formatul de dată ar trebui să fie ZZ-LL-AAAA)
tr: Geçersiz tarih '%s' (tarih biçimi şu şekilde olmalı: YYYY-MM-DD)
uk: Некоректна дата «%s» (дату має бути вказано у форматі РРРР-ММ-ДД)

source: Invalid time '%s' (time format should be HH:MM:SS[.ms][+HH:mm])
ca: Hora no vàlida «%s» (el format ha de ser HH:MM:SS[.ms][+HH:mm])
tr: Geçersiz saat '%s' (saat biçimi şu şekilde olmalı: HH:MM:SS[.ms][+HH:mm])
uk: Некоректний запис часу «%s» (правильним форматуванням є ГГ:ХХ:СС[.мс][+ГГ:хх])

source: Invalid timestamp '%s' (format should be YYYY-MM-DDTHH:MM:SS[.ms])
ca: Marca de temps «%s» (el format ha de ser AAAA-MM-DDTHH:MM:SS[.ms])
tr: Geçersiz zaman damgası '%s' (biçim YYYY-AA-GGDH: AA: SS [.ms] olmalıdır)
uk: Некоректна часова позначка «%s» (слід використовувати формат РРРР-ММ-ДДTГГ:ХХ:СС[.мс])

source: SQLite provider fatal internal error
ca: Error intern fatal del proveïdor de SQLite
ro: Eroare internă fatală a furnizorului SQLite
tr: SQLite sağlayıcı ölümcül iç hata
uk: Критична внутрішня помилка надавача даних SQLite

source: Truncated data
ca: Dades truncades
ro: Date trunchiate
tr: Kırpılmış veri
uk: Обрізані дані

source: Requested row could not be found
ca: La fila sol·licitada no s'ha trobat
ro: Rândul solicitat nu a fost găsit
tr: İstenilen satır bulunamadı
uk: Не вдалося знайти потрібного рядка

source: Can't set iterator on requested row
ca: La fila sol·licitada no s'ha trobat
ro: Nu se poate stabili iteratorul pe rândul solicitat
tr: İstenilen satırda yineleyici ayarlanamıyor
uk: Не вдалося встановити ітератор на запитаному рядку

source: Table to remove not found
ca: No s'ha trobat la taula a eliminar
ro: Tabela de eliminat nu a fost găsit
tr: Silinecek tablo bulunamadı
uk: Не знайдено таблиці для вилучення

source: Namespace must be specified
ca: S'ha d'especificar el nom d'espai
ro: Spațiul de nume trebuie specificat
tr: Ad alanı belirtilmek zorunda
uk: Має бути вказано простір назв

source: There is already a namespace named '%s' in use with another connection
ca: Ja hi ha un espai de nom anomenat «%s» en ús amb una altra connexió
ro: Există deja un spațiu de nume denumit „%s” utilizat de altă conexiune
tr: Başka bir bağlantıyla kullanımda zaten '%s' adında bir ad alanı var
uk: Простір назв «%s» вже використано в іншому з'єднанні

source: Connection was not added to virtual connection because it is closed
ca: La connexió no s'ha afegit a la connexió virtual perquè està tancada
tr: Kapalı olduğundan sanal bağlantıya bağlantı eklenmedi
uk: З'єднання не було додано до віртуального з'єднання, оскільки його вже закрито

source: Connection was not represented in hub
ca: La connexió no estava representada al concentrador
ro: Conexiunea nu a fost reprezentată în hub
tr: Bağlantı hub üstünde belirtilmemiş
uk: З'єднання не представлено у концентраторі

source: Unable to get information about table '%s'
ca: No es pot obtenir informació sobre la taula «%s»
ro: Nu s-au putut obține informații despre tabela „%s”
tr: '%s' tablosu hakkında bilgi alınamadı
uk: Не вдалося отримати відомості щодо таблиці «%s»

source: Integer value is out of bounds
ca: El valor sencer està fora de rang
ro: Valoarea întreagă se află în afara limitelor
tr: Tamsayı değeri aralığın dışında
uk: Ціле значення поза припустимим діапазоном

source: Blob constraints are not handled in virtual table condition
ca: Les restriccions del blob no estan gestionades en la condició de la taula virtual
ro: Restricțiile blob nu sunt gestionate în condiții de tabelă virtuală
tr: Blob kısıtlamaları, sanal tablo durumunda işlenmemiş
uk: Обмеження на бінарні дані не обробляються в умові віртуальної таблиці

source: Invalid time '%s' (time format should be HH:MM:SS[.ms])
ca: Hora no vàlida «%s» (el format ha de ser HH:MM:SS[.ms])
ro: Oră nevalidă „%s” (formatul de oră ar trebui să fie HH:MM:SS[.ms])
tr: Geçersiz saat '%s' (saat biçimi şu şekilde olmalı: YYYY-MM-DD)
uk: Некоректний запис часу «%s» (правильним форматуванням є ГГ:ХХ:СС[.мс])

source: Provider did not clean its connection data
ca: El proveïdor no ha netejat les dades de connexió
tr: Sağlayıcı bağlantı verilerini temizlenemedi
uk: Надавачем даних не виконано чищення даних з'єднання

source: Internal error: virtual provider does not implement the create_operation() virtual method
ca: Error intern: el proveïdor virtual no implementa el mètode virtual create_operation()
ro: Eroare internă: furnizorul virtual nu implementează metoda virtuală create_operation()
tr: İç hata: sanal sağlayıcı, create_operation() sanal metodunu uygulayamadı
uk: Внутрішня помилка: у віртуальному надавачі даних не реалізовано віртуальний метод create_operation()

source: Internal error: invalid provider handle
ca: Error intern: gestió del proveïdor no vàlid
ro: Eroare internă: gestionare de furnizor nevalidă
tr: İç hata: geçersiz sağlayıcı işleme
uk: Внутрішня помилка: некоректний обробник надавача даних

source: Internal Implementation error: No close connection method is defined
ca: Error intern d'implementació: No es defineix cap mètode de connexió proper
ro: Eroare internă de implementare: Nicio metodă pentru închiderea conexiunii nu este definită
tr: İç Uygulama hatası: Hiçbir yakın bağlantı yöntemi tanımlanmadı
uk: Помилка внутрішньої реалізації: не визначено спосіб закриття з'єднання

source: Wrong usage of Libgda's virtual tables
ca: Ús incorrecte de les taules virtuals de Libgda
ro: Utilizare incorectă a tabelelor virtuale Libgda
tr: Libgda sanal tablolarının yanlış kullanımı
uk: Помилкове використання віртуальних таблиць Libgda

source: Data model must have at least one column
ca: El model de dades ha de tenir almenys una columna
ro: Modelul de date trebuie să aibă cel puțin o coloană
tr: Veri modelinde en az bir sütun olmalıdır
uk: У моделі даних має бути принаймні один стовпчик

source: Could not compute virtual table's columns
ca: No s'han pogut calcular les columnes de la taula virtual
ro: Nu s-au putut calcula coloanele tabelei virtuale
tr: Sanal tabloların sütunları hesaplanamadı
uk: Не вдалося обчислити стовпчики віртуальної таблиці

source: Can't get data model description for column %d
ca: No es pot obtenir la descripció del model de dades per a la columna %d
ro: Nu se poate obține descrierea modelului de date pentru coloana %d
tr: %d sütunu için veri modeli tanımlaması alınamıyor
uk: Не вдалося отримати опис моделі даних для стовпчика %d

source: Can't get data model's column type for column %d
ca: No es pot obtenir el tipus de columna del model de dades per a la columna %d
ro: Nu se poate obține tipul de coloană al modelului pentru coloana %d
tr: %d sütunu için veri modelinin sütun türü alınamıyor
uk: Не вдалося отримати тип стовпчика моделі даних для стовпчика %d

source: Can't declare virtual table ("%s"): %s
ca: No es pot declarar la taula virtual («%s»): %s
tr: Sanal tablo ("%s") tanımlanamıyor: %s
uk: Не вдалося оголосити віртуальну таблицю («%s»): %s

source: Internal SQLite error: no data to iterate on
ca: Error intern de SQLite: no hi ha dades amb què iterar
ro: Eroare internă SQLite: nu sunt date pe care să se itereze
tr: İç SQLite hatası: yinelenecek veri yok
uk: Внутрішня помилка SQLite: немає даних для ітерації

source: Could not find requested value at row %d and col %d
ca: No s'ha pogut trobar el valor sol·licitat a la fila %d i columna %d
ro: Nu s-a putut găsi valoarea cerută la rândul %d și coloana %d
tr: %d satırı ve %d sütununda istenmiş değer bulunamadı
uk: Не вдалося знайти потрібне значення у рядку %d і стовпчику %d

source: Column not found
ca: No s'ha trobat la columna
ro: Nu s-a găsit coloana
tr: Sütun bulunamadı
uk: Стовпчик не знайдено

source: No statement specified to modify the data
ca: No ha especificat cap declaració per a modificar les dades
ro: Nu s-a specificat nicio comandă pentru a modifica datele
tr: Veriyi değiştirmek için belirtilmiş bir ifade yok
uk: Не вказано інструкції для внесення змін до даних

source: Invalid statement specified to modify the data
ca: No és vàlida la declaració proporcionada per a modificar les dades
ro: Comanda specificată pentru a modifica datele nu este validă
tr: Veriyi değiştirmek için belirtilen ifade geçersiz
uk: Вказано некоректну інструкцію для внесення змін до даних

source: Invalid parameter in statement to modify the data
ca: Paràmetre no vàlid en la declaració per a modificar les dades
ro: Parametru nevalid în comanda pentru a modifica datele
tr: Veriyi değiştirmek için kullanılan ifadenin parametresi geçersiz
uk: Некоректний параметр у інструкції для внесення змін до даних

source: Failed to modify data: %s
ca: Ha fallat en modificar les dades: %s
ro: Modificarea datelor a eșuat: %s
tr: Veri değiştirilemedi: %s
uk: Не вдалося внести зміни до даних: %s

source: Data model representing the table is read only
ca: El model de dades que representa la taula és de només lectura
ro: Modelul de date care reprezintă tabela este protejat la scriere
tr: Veri modelinin gösterdiği tablo yalnızca salt okunur
uk: Модель даних, що представляє таблицю, є придатною лише до читання

source: SQL code does not contain any statement
ca: El codi SQL no conté cap declaració
ro: Codul SQL nu conține nicio comandă
tr: SQL kodu herhangi bir ifade içermiyor
uk: У коді SQL не міститься жодної інструкції

source: Syntax error at line %d, column %d
ca: Error de sintaxi a la línia %d, columna %d
ro: Eroare de sintaxă la linia %d, coloana %d
tr: %d satırında sözdizimi hatası, sütun %d
uk: Синтаксична помилка у рядку %d, стовпчик %d

source: Overflow error at line %d, column %d
ca: Error de desbordament a la línia %d, columna %d
ro: Eroare de supraplin la linia %d, coloana %d
tr: %d satırında taşma, sütun %d
uk: Помилка переповнення у рядку %d, стовпчик %d

source: GdaSqlField is not part of an INSERT or UPDATE statement
ca: GdaSqlField no forma part d’una declaració INSERT o UPDATE
ro: GdaSqlField nu este o parte a unei comenzi INSERT sau UPDATE
tr: GdaSqlField, INSERT ya da UPDATE ifadesinin bir parçası değil
uk: GdaSqlField не є частиною жодної інструкції INSERT або UPDATE

source: Missing table in statement
ca: Falta la taula en la sentència
ro: Lipsește tabela din comandă
tr: İfadede tablo eksik
uk: В інструкції не вказано таблицю

source: Column '%s' not found
ca: No s'ha trobat la columna «%s»
ro: Nu s-a găsit coloana „%s”
tr: '%s' sütunu bulunamadı
uk: Не знайдено стовпчика «%s»
