Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: GdaMetaStore used by the connection
ca: El GdaMetaStore que utilitza la connexió
ro: GdaMetaStore utilizat de conexiune
tr: Bağlantıca kullanılan GdaMetaStore
uk: GdaMetaStore, який використано з'єднанням

source: Number of history events to keep in memory
ca: Nombre d'esdeveniments de la història per a guardar-los
ro: Numărul de evenimente istorice de ținut în memorie
tr: Bellekte saklamak için geçmiş olayı sayısı
uk: Кількість подій журналу, які слід зберігати у пам'яті

source: Computes execution delay for each executed statement
ca: Calcula la demora d'execució per a cada sentència executada
ro: Calculează întârzierea execuției pentru fiecare instrucțiune executată
tr: Her çalıştırılmış komut için çalışma gecikmesini hesaplar
uk: Обчислює затримку виконання для кожної виконаної інструкції

source: Artificially slows down the execution of queries
ca: Alenteix artificialment l'execució de consultes
ro: Încetinește execuția interogărilor în mod artificial
tr: Sorguların yürütülmesini yapay olarak yavaşlatır
uk: Штучно уповільнює виконання запитів

source: Can't set the '%s' property when the connection is opened
ca: No es pot configurar la propietat «%s» quan la connexió és oberta
ro: Nu se poate stabili proprietatea „%s” când conexiunea este deschisă
tr: Bağlantı açıkken '%s' özelliği ayarlanamaz
uk: Неможливо встановити властивість «%s» після відкриття з'єднання

source: No DSN named '%s' defined
ca: No hi ha cap DSN amb nom «%s»
ro: Niciun nume DSN „%s” definit
tr: Tanımlanmıi DSN '%s' yok
uk: Не визначено DSN із назвою «%s»

source: Can't set the '%s' property once the connection is opened
ca: No es pot configurar la propietat «%s» un cop oberta la connexió
ro: Nu se poate stabili proprietatea „%s” odată ce conexiunea este deschisă
tr: Bağlantı bir kere açıldıktan sonra '%s' özellik ayarlanamaz
uk: Неможливо встановити властивість «%s» після відкриття з'єднання

source: Malformed data source specification '%s'
ca: Especificació de l'origen de dades incorrecta «%s»
ro: Specificație de sursă de date „%s” greșită
tr: Kusur veri kaynağı tanımlaması '%s'
uk: Помилкове форматування специфікації джерела даних «%s»

source: Data source %s not found in configuration
ca: No s'ha trobat la font de dades %s a la configuració
ro: Sursa de date %s nu a fost găsită în configurație
tr: %s veri kaynağı yapılandırmada bulunamadı
uk: Джерело даних "%s" не знайдено у конфігурації

source: Datasource configuration error: no provider specified
ca: Error de configuració de la font de dades: no s'ha especificat cap proveïdor
ro: Eroare la configurația sursei de date: niciun furnizor specificat
tr: Veri kaynağı yapılandırma hatası: sağlayıcı belirtilmemiş
uk: Помилка налаштовування джерела даних: не вказано надавача

source: Malformed connection string '%s'
ca: La cadena de connexió «%s» no està ben formatada
ro: Șir de conexiune „%s” greșit
tr: Kusur bağlantı karakter dizisi '%s'
uk: Помилкове форматування рядка з'єднання «%s»

source: No database driver specified
ca: No s'ha especificat cap controlador de base de dades
ro: Niciun driver de baze de date specificat
tr: Veri tabanı sürücüsü belirtilmemiş
uk: Не вказано драйвера бази даних

source: No provider specified
ca: No s'ha especificat cap proveïdor
ro: Niciun furnizor specificat
tr: Sağlayıcı belirtilmemiş
uk: Не вказано постачальника

source: No DSN or connection string specified
ca: No s'ha especificat cap DSN o cadena de connexió
ro: Niciun DSN sau șir de conexiune specificat
tr: Her hangi bir DSN ya da bağlantı karakter dizisi belirtilmemiş
uk: Не вказано DSN або рядка з'єднання

source: Connection is already opened
ca: La connexió ja està oberta
tr: Bağlantı zaten açık
uk: З'єднання уже відкрито

source: Error while maintaining the meta data up to date: %s
ca: S'ha produït un error en actualitzar les metadades: %s
ro: Eroare în timpul întreținerii metadatelor actualizate: %s
tr: Üst veri güncellemesi sürdürülürken hata: %s
uk: Помилка під час підтримання актуальності метаданих: %s

source: Provider does not provide a GdaDataHandler for dates
ca: El proveïdor no proporciona un GdaDataHandler per a les dates
ro: Furnizorul nu furnizează un GdaDataHandler pentru date
tr: Sağlayıcı, tarihler için bir GdaDataHandler sağlamıyor
uk: Надавач даних не надає GdaDataHandler для дат

source: Connection is closed
ca: La connexió està tancada
ro: Conexiunea este închisă
tr: Bağlantı kapalı
uk: З'єднання розірвано

source: Statement is a selection statement
ca: La declaració és una declaració de selecció
ro: Comanda este o comandă de selecție
tr: İfade bir seçim komutu
uk: Інструкція є інструкцією вибору

source: Statement is not a selection statement
ca: La declaració no és una declaració de selecció
ro: Comanda nu este o comandă de selecție
tr: İfadece bir seçim komutu değil
uk: Інструкція не є інструкцією вибору

source: Invalid argument
ca: L'argument no és vàlid
ro: Argument nevalid
tr: Geçersiz değişken
uk: Неправильний аргумент

source: Missing or wrong arguments for table '%s': %s
ca: Manquen o són erronis els arguments per a la taula «%s»: %s
ro: Argumente lipsă sau incorecte pentru tabela „%s”: %s
tr: '%s' tablosu için eksik veya yanlış değişkenler: %s
uk: Пропущено аргументи для таблиці «%s» або вказано помилкові аргументи: %s

source: While extracting data from Data Store: %s
ca: Mentre s'extreuen dades del Data Store: %s
tr: Veri Deposundan veri ayıklanırken: %s
uk: Під час видобування даних зі сховища даних: %s

source: Internal error: No meta store in connection
ca: Error intern: No hi ha un magatzem de meta en connexió
tr: İç hata: Bağlantıda meta deposu yok
uk: Внутрішня помилка: немає метасховища у з'єданні

source: Parameter 'name' is required to filter namespaces
ca: El paràmetre «name» és necessari per a filtrar els espais de noms
tr: Ad alanlarını filtrelemek için 'name' parametresi gerekiyor
uk: Для фільтрування просторів назв потрібен параметр «name»

source: Parameter 'name' is required to filter data types
ca: El paràmetre «name» és necessari per a filtrar els tipus de dades
tr: Veri tiplerini filtrelemek için 'name' parametresi gereklidir
uk: Для фільтрування типів даних потрібен параметр «name»

source: Parameter 'name' is required to filter tables
ca: El paràmetre «name» és necessari per a filtrar taules
tr: Tabloları filtrelemek için 'name' parametresi gereklidir
uk: Для фільтрування таблиць потрібен параметр «name»

source: Parameter 'name' is required to filter views
ca: El paràmetre «name» és necessari per a filtrar vistes
tr: Görünümleri filtrelemek için 'name' parametresi gerekiyor
uk: Для фільтрування переглядів потрібен параметр «name»

source: Parameter 'name' is required to filter fields
ca: El paràmetre «name» és necessari per a filtrar camps
tr: Alanları filtrelemek için 'name' parametresi gereklidir
uk: Для фільтрування полів потрібен параметр «name»

source: Parameter 'field_name' is required to filter fields
ca: El paràmetre «field_name» és necessari per a filtrar camps
tr: 'field_name' parametresi alanları filtrelemek için gereklidir
uk: Для фільтрування полів потрібен параметр «field_name»

source: Parameters: 'name' and/or 'field_name' are required to filter fields
ca: Els paràmetres «name» i/o «field_name» són necessaris per a filtrar camps
tr: Parametreler: 'name' ve/veya 'field_name' alanları filtrelemek için gereklidir
uk: Параметри: для фільтрування полів потрібні «name» і/або «field_name»

source: Parameter 'name' is required to filter indexes
ca: El paràmetre «name» és necessari per a filtrar índexs
tr: İndeksleri filtrelemek için 'name' parametresi gereklidir
uk: Для фільтрування індексів потрібен параметр «name»

source: Parameter 'index_name' is required to filter indexes
ca: El paràmetre «index_name» és necessari per a filtrar índexs
tr: Dizinleri filtrelemek için 'index_name' parametresi gerekiyor
uk: Для фільтрування індексів потрібен параметр «index_name»

source: Parameters: 'name' and/or 'index_name' are required to filter indexes
ca: Els paràmetres «name» i/o «index_name» són necessaris per a filtrar índex
tr: Parametreler: 'name' ve/veya 'index_name' dizinleri filtrelemek için gereklidir
uk: Параметри: для фільтрування індексів потрібен параметр «name» і/або «index_name»

source: Invalid meta type to get data from store
ca: El tipus de meta no és vàlid per a obtenir dades de la botiga
tr: Mağazadan veri almak için geçersiz meta türü
uk: Некоректний метатип для отримання даних зі сховища

source: Internal error while creating statement to retrieve data: %s
ca: Error intern al crear la declaració per a recuperar dades:: %s
tr: Veri almak için ifade oluştururken iç hata: %s
uk: Внутрішня помилка під час створення інструкції для отримання даних: %s

source: Connection transaction status tracking: no transaction exists for %s
ca: Seguiment de l'estat de la transacció de connexió: no existeix cap transacció per a %s
ro: Urmărirea stării tranzacției conexiunii: nu există o tranzacție pentru %s
tr: Bağlantı işlemi durumu izleme: %s için bir işlem yok
uk: Стеження за станом передавання даних з'єднанням: немає передавання даних для %s

source: Unspecified table name
ca: Nom de la taula no especificat
ro: Nume de tabelă nespecificat
tr: Belirtilmemiş tablo adı
uk: Не вказано назви таблиці

source: Invalid type
ca: El tipus no és vàlid
ro: Tip nevalid
tr: Geçersiz tür
uk: Некоректний тип

source: CREATE TABLE operation is not supported by the database server
ca: El servidor de la base de dades no suporta l'operació CREATE TABLE
ro: Operația CREATE TABLE nu este suportată de serverul bazei de date
tr: CREATE TABLE işlemi, veri tabanı sunucusunca desteklenmiyor
uk: На сервері бази даних не передбачено підтримки дії CREATE TABLE

source: Wrong SQL identifier value
ca: Valor incorrecte de l'identificador SQL
ro: Valoare greșită de identificator SQL
tr: Yanlış SQL tanımlayıcı değeri
uk: Помилкове значення ідентифікатора SQL

source: Column %d out of range (0-%d)
ca: La columna %d està fora de rang (0-%d)
ro: Coloana %d în afara intervalului (0-%d)
tr: %d sütunu sınırın dışında (0-%d)
uk: Стовпчик %d поза межами припустимого діапазону (0-%d)

source: Can't set iterator's position
ca: No es pot establir la posició de l'iterador
ro: Nu se poate stabili poziția iteratorului
tr: Yineleyicinin konumu ayarlanamıyor
uk: Не вдалося встановити позицію ітератора

source: Can't access data
ca: No es pot accedir a les dades
ro: Nu se pot accesa datele
tr: Veriye erişilemiyor
uk: Не вдалося отримати доступ до даних

source: Old data model
ca: El model de dades és vell
ro: Model vechi de date
tr: Eski veri modeli
uk: Стара модель даних

source: New data model
ca: El model de dades és nou
ro: Model nou de date
tr: Yeni veri modeli
uk: Нова модель даних

source: Missing original data model
ca: Manca el model de dades original
ro: Lipsește modelul de date original
tr: Özgün veri modeli eksik
uk: Не вказано початкової моделі даних

source: Missing new data model
ca: Manca el model de dades nou
ro: Lipsește modelul de date noi
tr: Yeni veri modeli eksik
uk: Не вказано нової моделі даних

source: Data models must support random access model
ca: Els models de dades han de permetre el model d'accés aleatori
ro: Modelele de date trebuie să suporte modelul de acces aleator
tr: Veri modelleri, rastgele erişim modelini desteklemesi gerekir
uk: У моделях ітератора має бути передбачено підтримку моделі випадкового доступу

source: Data models to compare don't have the same number of columns
ca: Els models de dades a comparar no tenen el mateix nombre de columnes
ro: Modelele de date de comparat nu au același număr de coloane
tr: Karşılaştırılacak veri modelleri aynı sayıda sütuna sahip değil
uk: У моделях даних для порівняння різна кількість стовпчиків

source: Type mismatch for column %d: '%s' and '%s'
ro: Nepotrivire de tip pentru coloana %d: „%s” și „%s”
tr: %d sütünu için tür uyuşmazlığı: '%s' ve '%s'
uk: Невідповідність типів у стовпчику %d: «%s» і «%s»

source: Can't get the number of rows of data model to compare from
ca: No es pot obtenir el nombre de files del model de dades des del qual comparar
ro: Nu s-a putut obține numărul de rânduri de model de date de la care să se compare
tr: Üzerinden karşılaştırılacak veri modeli için satır sayısı alınamıyor
uk: Не вдалося отримати кількість рядків початкової моделі даних для порівняння

source: Can't get the number of rows of data model to compare to
ca: No es pot obtenir el nombre de files del model de dades al qual comparar
ro: Nu s-a putut obține numărul de rânduri de model de date cu care să se compare
tr: Üzerine karşılaştırılacak veri modeli için satır sayısı alınamıyor
uk: Не вдалося отримати кількість рядків результативної моделі даних для порівняння

source: Differences computation cancelled on signal handling
ca: S'han cancel·lat les diferències de computació al gestionar un senyal
ro: Calculele de diferențe au fost anulate la gestionarea semnalului
tr: Sinyal işlemede, farkların hesaplanması iptal edildi
uk: Скасовано обчислення різниць при обробці сигналів

source: Whether data model can be modified
ca: Si es pot modificar el model de dades
ro: Dacă modelul de date poate fi modificat
tr: Veri modeli değiştirilebilir olduğunda
uk: Чи може бути змінено модель даних

source: Row %d out of range (0-%d)
ca: La fila %d està fora del rang (0-%d)
ro: Rândul %d în afara intervalului (0-%d)
tr: %d satırı sınırın dışında (0-%d)
uk: Рядок %d поза діапазоном (0-%d)

source: Row %d not found (empty data model)
ca: No s'ha trobat la fila %d (el model de dades és buit)
ro: Nu s-a putut găsi rândul %d (model de date gol)
tr: %d satırı bulunamadı (boş veri modeli)
uk: Не знайдено рядок %d (порожня модель даних)

source: No row in data model
ca: No hi ha cap fila en el model de dades
ro: Niciun rând în modelul de date
tr: Veri modelinde satır yok
uk: Немає рядка у моделі даних

source: Data model has no data
ca: El model de dades no té dades
ro: Modelul de date nu are date
tr: Veri modeli veriye sahip değil
uk: У моделі даних немає даних

source: Attempting to modify a read-only data model
ca: S'està intentant modificar un model de dades que no permet modificacions
ro: Se încearcă modificarea unui model de date protejat la scriere
tr: Salt okunur bir veri modelini değiştirmek için çalışılıyor
uk: Спроба внести зміни до придатної лише для читання моделі даних

source: Too many values in list
ca: Hi ha massa valors a la llista
ro: Prea multe valori în listă
tr: Listede çok fazla değer var
uk: Забагато значень у списку

source: Row not found in data model
ca: No s'ha trobat la fila al model de dades
ro: Nu s-a putut găsi rândul în modelul de date
tr: Satır, veri modelinde bulunamadı
uk: Рядок не знайдено у моделі даних

source: Could not load the Berkeley DB library: %s
ca: No s'ha pogut carregar la biblioteca Berkeley DB: %s
ro: Nu s-a putut încărca biblioteca Berkeley DB: %s
tr: Berkeley DB kütüphanesi yüklenemedi: %s
uk: Не вдалося завантажити бібліотеку бази даних Berkeley: %s

source: Could not load the '%s' symbol from the Berkeley DB library
ca: No s'ha pogut carregar el símbol «%s» de la biblioteca Berkeley DB
ro: Nu s-a putut încărca simbolul „%s” de la biblioteca Berkeley DB
tr: Berkeley DB kütüphanesinden '%s' sembolü yüklenemedi
uk: Не вдалося завантажити символ «%s» з бібліотеки бази даних Berkeley

source: Berkeley DB library not loaded
ca: No s'ha carregat la biblioteca Berkeley DB
ro: Biblioteca Berkeley DB nu a fost încărcată
tr: Berkeley DB kütüphanesi yüklü değil
uk: Не завантажено бібліотеку бази даних Berkeley

source: Custom BDB model implementation is not complete: the '%s' method is missing
ca: La implementació del model personalitzat BDB no està completa: falta el mètode «%s»
ro: Implementarea modelului personalizat BDB nu este completă: metoda „%s” lipsește
tr: Özel BDB modeli uygulaması tamamlanmış değiş: '%s' medodu eksik
uk: Нетипова реалізація моделі BDB є неповною: не вистачає методу «%s»

source: Expected GdaBinary value, got %s
ca: S'esperava un valor GdaBinary, però s'ha obtingut %s
ro: S-a așteptat o valoare GdaBinary, s-a obținut %s
tr: Beklenen GdaBinary değeri, %s
uk: Очікували на значення GdaBinary, отримано %s

source: Key modification is not supported
ca: No es permet la modificació de claus
ro: Modificarea cheii nu este suportată
tr: Anahtar değişimi desteklenmiyor
uk: Підтримки модифікації ключа не передбачено

source: Data model does not support getting individual value
ca: El model de dades no admet obtenir valor individual
ro: Modelul de date nu suportă obținerea de valori individuale
tr: Veri modeli, bireysel değer almayı desteklemiyor
uk: У моделі даних не передбачено отримання індивідуального значення

source: Data model returned value of invalid '%s' type
ca: El model de dades ha retornat un valor de tipus «%s» no vàlid
ro: Modelul de date a întors o valoare de tip nevalid „%s”
tr: Geçersiz '%s' türünün veri modeli dönüş değeri
uk: Моделлю даних повернуто значення некоректного типу «%s»

source: Data model returned invalid NULL value
ca: El model de dades ha retornat un valor nul no vàlid
ro: Modelul de date a întors o valoare nevalidă NULL
tr: Veri modeli geçersiz NULL değerini döndürdü
uk: Моделлю даних повернуто некоректне значення NULL

source: Data model does not support setting individual value
ca: El model de dades no admet l'establiment de valors individuals
ro: Modelul de date nu suportă stabilirea unei valori individuale
tr: Veri modeli, özel değer ayarlamayı desteklemiyor
uk: У моделі даних не передбачено встановлення індивідуального значення

source: Data model does not support setting values
ca: El model de dades no admet valors de configuració
ro: Modelul de date nu suportă stabilirea de valori
tr: Veri modeli değerleri ayarlamayı desteklemiyor
uk: У моделі даних не передбачено встановлення значень

source: Data model does not support row append
ca: El model de dades no permet afegir files
ro: Modelul de date nu suportă adăugarea de rânduri
tr: Veri modeli, satır eklemeyi desteklemiyor
uk: У моделі даних не передбачено дописування рядків

source: Model does not allow row insertion
ca: El model no permet inserir files
ro: Modelul nu permite introducerea de rânduri
tr: Model, satır eklemeye izin vermiyor
uk: У моделі не дозволено вставлення рядків

source: Model does not allow row deletion
ca: El model no permet la supressió de files
ro: Modelul nu permite ștergerea de rânduri
tr: Model, satır silmeye izin vermiyor
uk: У моделі не дозволено вилучення рядків

source: Data model does not support row removal
ca: El model no permet la supressió de columnes
ro: Modelul de date nu suportă eliminarea de rânduri
tr: Veri modeli, satır kaldırmayı desteklemiyor
uk: У моделі даних не передбачено вилучення рядків

source: The '%s' parameter must hold a string value, ignored.
ca: El paràmetre «%s» ha de contenir un valor de cadena, ignorat.
ro: Parametrul „%s” trebuie să dețină o valoare de tip șir, se ignoră.
tr: '%s' parametresi bir karakter dizisi değeri tutmalıdır, yok sayıldı.
uk: Параметр «%s» має містити рядкове значення, проігноровано.

source: The '%s' parameter must hold a boolean value, ignored.
ca: El paràmetre «%s» ha de contenir un valor booleà, ignorat.
ro: Parametrul „%s” trebuie să dețină o valoare de tip logic, se ignoră.
tr: '%s' parametresi bir boole değeri tutmalıdır, yok sayıldı.
uk: Параметр «%s» має містити булеве значення, проігноровано.

source: The '%s' parameter must hold an integer value, ignored.
ca: El paràmetre «%s» ha de contenir un valor sencer, ignorat.
ro: Parametrul „%s” trebuie să dețină o valoare de tip întreg, se ignoră.
tr: '%s' parametresi bir tam sayı değeri tutmalıdır, yok sayıldı.
uk: Параметр «%s» має містити ціле значення, проігноровано.

source: Unknown GdaDataModelIOFormat %d value
ca: Valor GdaDataModelIOFormat %d desconegut
ro: Valoare GdaDataModelIOFormat %d necunoscută
tr: Bilinmeyen GdaDataModelIOFormat değeri %d
uk: Невідоме значення GdaDataModelIOFormat %d

source: File '%s' already exists
ca: El fitxer «%s» ja existeix
ro: Fișierul „%s” deja există
tr: '%s' dosyası zaten var
uk: Файл «%s» вже існує

source: Exported Data
ca: Dades exportades
ro: Date exportate
tr: Dışa Aktarılmış Veri
uk: Експортовані дані

source: Cannot retrieve column data type (type is UNKNOWN or not specified)
ca: No es pot recuperar el tipus de dades de la columna (el tipus és desconegut - «UNKNOWN» - o no s'ha especificat)
ro: Nu se poate obține tipul de coloană de date (tipul este UNKNOWN sau nu este specificat)
tr: Sütun veri türü alınamıyor (tür UNKNOWN ya da belirtilmemiş)
uk: Не вдалося отримати тип даних стовпчика (значенням типу є UNKNOWN або тип не вказано)

source: Expected tag <gda_array_data>, got <%s>
ca: S'esperava l'etiqueta <gda_array_data> però s'ha obtingut <%s>
ro: S-a așteptat eticheta <gda_array_data>, s-a obținut <%s>
tr: Beklenen etiket <gda_array_data>, alınan <%s>
uk: Мало бути використано теґ <gda_array_data>, маємо <%s>

source: Could not get an iterator for source data model
ca: No s'ha pogut obtenir un iterador pel model de dades d'origen
ro: Nu s-a putut obține un iterator pentru modelul de date sursă
tr: Kaynak veri modeli için bir yineleyici alınamadı
uk: Не вдалося отримати ітератор для моделі джерела даних

source: Inexistent column in source data model: %d
ca: No existeix la columna al model de dades d'origen: %d
ro: Coloană inexistentă în modelul de date sursă: %d
tr: Kaynak veri modelinde var olmayan sütun: %d
uk: У початковій моделі даних є стовпчик, якого не існує: %d

source: Destination column %d can't be NULL but has no correspondence in the source data model
ca: La columna de destinació %d no pot ser NULL, però no té correspondència en el model de dades d'origen
ro: Coloana de destinație %d nu poate fi NULL dar nu are o corespondență în modelul de date sursă
tr: Hedef sütun %d NULL olamaz, ancak kaynak veri modelinde bir uygunluk yok
uk: Стовпчик призначення %d не може містити значення NULL, але немає відповідності у моделі даних джерела

source: Destination column %d has a gda type (%s) incompatible with source column %d type (%s)
ca: La columna de destinació %d té un tipus gda (%s) incompatible amb la columna d'origen %d tipus (%s)
ro: Coloana de destinație %d are un tip gda (%s) incompatibil cu coloana sursă %d tipul (%s)
tr: Hedef sütun %d, (%s) türüne ait kaynak sütun %d ile uyumlu olmayan bir gda türüne (%s) sahip
uk: Стовпчик призначення %d належить до типу gda (%s), який є несумісним із типом початкового стовпчика %d (%s)

source: Can't transform '%s' from GDA type %s to GDA type %s
ca: No es pot transformar «%s» del tipus GDA %s al tipus GDA %s
ro: Nu se poate transforma „%s” din tipul GDA %s la tipul GDA %s
tr: '%s', %s GDA türünden %s GDA türüne dönüştürülemiyor
uk: Не вдалося перетворити «%s» з типу GDA %s до типу GDA %s

source: Could not dump data model's attributes: %s
ca: No s'ha pogut bolcar els atributs del model de dades: %s
ro: Nu s-a putut renunța la atributele modelului de date: %s
tr: Veri modelinin özniteliklerinin dökümü alınamadı: %s
uk: Не вдалося створити дамп атрибутів моделі даних: %s

source: Could not dump data model's contents: %s
ca: No s'ha pogut bolcar el contingut del model de dades: %s
ro: Nu s-a putut renunța la conținuturile modelului de date: %s
tr: Veri modelinin içeriklerinin dökümü alınamadı: %s
uk: Не вдалося створити дамп вмісту моделі даних: %s

source: Data model does not support backward cursor move
ca: El model de dades no permet moure el cursor cap enrere
ro: Modelul de date nu suportă deplasare de cursor înapoi
tr: Veri modeli geri imleç haraketini desteklemiyor
uk: У моделі даних не передбачено зворотного руху курсора

source: %d row
ca: %d fila
ro: %d rând
tr: %d satır
uk: %d ряд

source: 0 row
ca: 0 files
ro: 0 rânduri
tr: 0 satır
uk: 0 рядок

source: Row not found
ca: No s'ha trobat la fila
ro: Nu s-a găsit rândul
tr: Satır bulunamadı
uk: Рядок не знайдено
