Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Use a cache to store some static server data (the cached files are in the user's cache directory), default is TRUE
ca: Utilitzeu una memòria cau per a emmagatzemar algunes dades del servidor estàtic (els fitxers de la memòria cau es troben al directori de la memòria cau de l'usuari), per defecte és TRUE
ro: Utilizează un cache pentru a stoca unele date statice de pe server (fișierele adăugate în cache sunt în directorul de cache al utilizatorului), valoarea implicită este TRUE
tr: Bazı sabit sunucu verilerini saklamak için ön bellek kullan (ön belleklenmiş dosyalar kullanıcının önbellek dizinindedir), öntanımlı TRUE
uk: Використовувати кеш для зберігання певних статичних даних сервера (кешовані файли зберігаються у каталозі кешу користувача), типовим є значення TRUE

source: Time limit
ca: Límit de temps
ro: Limită de timp
tr: Süre sınırı
uk: Обмеження часу

source: Time limit after which a search operation should be terminated by the server (leave undefined or 0 for unlimited)
ca: El límit de temps rere el qual el servidor ha d'interrompre una operació de cerca (sense definir o amb valor 0 equival a temps il·limitat)
ro: Limita de timp după care o operație de căutare ar trebui terminată de către server (lăsați nedefinit sau 0 pentru nelimitat)
tr: Sunucu tarafından kesilmesi gerek arama işleminin zaman sınırı (tanımsız veya 0 ise sınırsızdır)
uk: Обмеження за часом, коли дію з пошуку має бути перервано сервером (не визначайте або встановіть значення 0, якщо не слід обмежувати)

source: Size limit
ca: Límit de mida
ro: Limită de dimensiune
tr: Boyut sınırı
uk: Обмеження розміру

source: Maximum number of entries that can be returned on a search operation
ca: El nombre màxim d'entrades que poden retornar-se en una operació de cerca
ro: Numărul maxim de intrări care pot fi returnate de o operație de căutare
tr: Arama işleminde dönecek girdilerin azami sayısı
uk: Максимальна кількість записів, які може бути повернуто під час дії з пошуку

source: Never: certificate not requested or checked
ca: Mai: certificat no sol·licitat o comprovat
ro: Niciodată: certificat necerut sau neverificat
tr: Asla: sertifika istenmemiş ya da denetlenmemiş
uk: Ніколи: без запиту сертифіката або перевірений

source: Allow: certificate requested, none or a bad one accepted.
ca: Permet: certificat sol·licitat, cap o erroni acceptat.
ro: Permite: certificatul cerut, niciunul sau unul rău acceptat.
tr: Kabul: sertifika istenmiş, hiç ya da kötü bir tanesi kabul edilmiş.
uk: Дозволити: надіслано запит щодо сертифікації, прийнятними є варіанти без сертифіката або з помилковим сертифікатом.

source: Try: certificate requested, none accepted, otherwise checked.
ca: Prova: certificat sol·licitat, cap acceptat, altrament comprovat.
ro: Încercare: certificatul a fost cerut, niciunul acceptat, restul a fost verificat.
tr: Deneme: sertifika istenmiş, kabul edilen yok, diğer türlü denetlenmiş.
uk: Спробувати: надіслано запит щодо сертифікації, прийнятний варіант без сертифікації, якщо вказано сертифікат, його буде перевірено.

source: Demand: certificate requested and checked
ca: Sol·licita: certificat sol·licitat i comprovat
ro: Cerere: certificatul cerut și verificat
tr: Talep: sertifika istenmiş ve denetlenmiş
uk: Вимога: потрібен сертифікат, сертифікат перевірено

source: Provider for database where tables are based on data contained in an LDAP directory
ca: Proveïdor de bases de dades on les taules es basen en dades contingudes en un directori LDAP
ro: Furnizorul bazei de date în cazul în care tabelele sunt bazate pe date conținute într-un director LDAP
tr: LDAP dizininde, tabloların içerilen veriye dayalı olduğu veri tabanı için sağlayıcı
uk: Надавач бази даних, де таблиці засновано на датах, що містяться у каталозі LDAP

source: The connection string format has changed: replace FILENAME with DB_DIR (the path to the database file) and DB_NAME (the database file without the '%s' at the end).
ca: El format de cadena de connexió ha canviat: substituïu FILENAME per DB_DIR (el camí d'accés al fitxer de base de dades) i DB_NAME (el fitxer de la base de dades sense el «%s» al final).
ro: Formatul șirului de conexiune a fost modificat: înlocuiți FILENAME cu DB_DIR (calea către fișierul bazei de date) și DB_NAME (fișierul bazei de date fără „%s” la sfârșit).
tr: Bağlantı dizge biçimi değişti: URI, DB_DIR (veri tabanı dosyası yolu) ve DB_NAME ile değişmeli (sonunda '%s' olmayan veri tabanı dosyası)
uk: Змінено формат рядка з'єднання: замініть FILENAME на DB_DIR (шляхом до файла бази даних) і DB_NAME (файлом бази даних без «%s» наприкінці).

source: Could not open file %s
ca: No s'ha pogut obrir el fitxer %s
ro: Nu s-a putut deschide fișierul %s
tr: %s dosyası açılamadı
uk: Не вдається відкрити файл "%s"

source: Could not map table '%s': %s
ca: No s'ha pogut assignar la taula «%s»: %s
ro: Nu se poate trece pe hartă tabela „%s”: %s
tr: '%s' tablosu eşleşemedi: %s
uk: Не вдалося відобразити таблицю «%s»: %s

source: Provider for Microsoft Access files
ca: Proveïdor per a fitxers de Microsoft Access
ro: Furnizor pentru fișierele Microsoft Access
tr: Microsoft Access dosyaları için sağlayıcı
uk: Постачальник для файлів Microsoft Access

source: The name of a database to use (filename without the .mdb)
ca: El nom d'una base de dades a utilitzar (nom de fitxer sense el .mdb)
ro: Numele unei baze de date de utilizat (numele de fișier fără .mdb)
tr: Kullanılacak veri tabanının adı (.mdb olmadan dosya adı)
uk: Назва бази даних, якою слід скористатися (без .mdb)

source: MySQL boolean representation
ca: Representació booleana MySQL
ro: Reprezentare logică MySQL
tr: MySQL boole gösterimi
uk: Булеве представлення MySQL

source: Cannot give a UNIX SOCKET if you also provide either a HOST or a PORT
ca: No es pot proporcionar un SÒCOL UNIX si es proporciona un AMFITRIÓ o un PORT
ro: Nu se poate da un UNIX SOCKET dacă furnizați de asemenea un HOST sau un PORT
tr: Hem HOST hem de POST belirttiyseniz bir UNIX SOCKET alamazsınız
uk: Не можна надати СОКЕТ UNIX, якщо ви також надаєте ВУЗОЛ або ПОРТ

source: Invalid port number
ca: El número de port no és vàlid
ro: Număr de port nevalid
tr: Geçersiz bağlantı noktası numarası
uk: Некоректний номер порту

source: Unknown MySQL protocol '%s'
ca: Protocol MySQL desconegut «%s»
ro: Protocol MySQL necunoscut „%s”
tr: Bilinmeyen MySQL iletişim kuralı '%s'
uk: Невідомий протокол MySQL «%s»

source: Could not set client charset to UTF8. Using %s. It'll be problems with non UTF-8 characters
ca: No s'ha pogut establir el joc de caràcters del client a UTF8. S'està utilitzant %s. Hi haurà problemes amb els caràcters no UTF-8
ro: Nu s-a putut configura setul de caractere al clientului la UTF-8. Se utilizează %s. Vor apărea probleme la caracterele non UTF-8
tr: İstemci karakter kümesi UTF8 olarak ayarlanamadı. %s kullanılıyor. Bu UTF-8 olmayan karakterlerde problem oluşturabilir
uk: Не вдалося встановити для клієнта набір символів UTF8. Використовуємо %s. Будуть проблеми з символами поза UTF-8

source: The connection string must contain the DB_NAME values
ca: La cadena de connexió ha de contenir els valors de DB_NAME
ro: Șirul de conexiune trebuie să conțină valorile DB_NAME
tr: Bağlantı dizgesi DB_NAME değeri içermek zorundadır
uk: Рядок з'єднання має містити значення DB_NAME

source: No description
ca: Sense descripció
ro: Fără descriere
tr: Açıklama yok
uk: Немає опису

source: Unnamed statement parameter is not allowed in prepared statement.
ca: No es permet un paràmetre sense nom a les declaracions preparades.
ro: Parametrul de comandă nedenumit nu este permis în comanda pregătită.
tr: Adsız ifade parametresi, hazırlanmış ifadede kullanılamaz.
uk: У приготованій інструкції не можна використовувати безіменного параметра інструкції.

source: Can't execute SELECT statement to get last inserted row: %s
ca: No es pot executar la declaració SELECT per a obtenir l'última fila inserida: %s
ro: Nu se poate executa comanda SELECT pentru a obține ultimul rând selectat: %s
tr: Son eklenmiş satırı almak için SELECT ifadesi çalıştırılamadı: %s
uk: Не вдалося виконати інструкцію SELECT для отримання останнього вставленого рядка: %s

source: Can't read whole BLOB into memory
ca: No es pot llegir el BLOB complet en la memòria
ro: Nu se poate citi întreg BLOB în memorie
tr: Tüm BLOB bellek içinde okunamaz
uk: Не вдалося повністю прочитати BLOB до пам'яті

source: Unhandled data type '%s', please report this bug to http://gitlab.gnome.org/GNOME/libgda/issues
ca: Tipus de dades «%s» no gestionat. Informeu de l'error a http://gitlab.gnome.org/GNOME/libgda/issues
tr: İşlenmeyen veri türü '%s', lütfen bu hatayı http://gitlab.gnome.org/GNOME/libgda/issues'e bildirin
uk: Непридатний до обробки тип даних «%s», будь ласка, повідомте про цю ваду на сторінці http://gitlab.gnome.org/GNOME/libgda/issues

source: Could not use CURSOR. Mysql version 5.0 at least is required. Using random access anyway.
ca: No es pot usar CURSOR. Es requereix almenys la versió 5.0 de MySQL. S'està usant accés aleatori de totes maneres.
ro: Nu se poate utiliza CURSOR. Este necesară măcar MySQL versiunea 5.0. Se utilizează accesul aleator oricum.
tr: CURSOR kulanılamadı. Mysql sürüm en az 5.0 gerekli. Rastgele erişim kullanılır.
uk: Не вдалося скористатися CURSOR. Потрібна версія Mysql принаймні 5.0. Попри це скористаємося випадковим доступом.

source: Could not use CURSOR. Mysql version 5.0 at least is required. Chunk size ignored.
ca: No es pot usar CURSOR. Es requereix almenys la versió 5.0 de MySQL. S'ignora la mida dels trossos.
ro: Nu se poate utiliza CURSOR. Este necesară măcar MySQL versiunea 5.0. Se utilizează accesul aleator oricum.
tr: CURSOR kullanılamadı. MYsql sürüm en az 5.0 gerekli. Parça boyutu yoksayıldı.
uk: Не вдалося скористатися CURSOR. Потрібна принаймні Mysql 5.0. Розмір фрагмента проігноровано.

source: Number of rows fetched at a time
ca: Nombre de files obtingudes a la vegada
ro: Numărul de rânduri aduse la un moment dat
tr: Bir andaki çekilen satırların sayısı
uk: Кількість отриманих рядків

source: Number of row chunks read since the object creation
ca: Nombre de fragments de files llegits des de la creació de l'objecte
ro: Numărul de bucăți de rând citite de la crearea obiectului
tr: Nesne oluşturulana kadar okunan satır parçalarının sayısı
uk: Кількість прочитаних фрагментів рядка з моменту створення об'єкта

source: Invalid column bind data type. %d
ca: Tipus de dades d’enllaç de columna no vàlid. %d
ro: Tip de date nevalid pentru legarea coloanei: %d
tr: Geçersiz sütun bağlama veri türü. %d
uk: Некоректний тип даних прив'язки стовпчика. %d

source: Type %s not mapped for value %d
ca: El tipus %s no està assignat per al valor %d
ro: Tipul %s nu este trecut pe hartă pentru valoarea %d
tr: %s türü %d değeri ile eşleşmiyor
uk: Тип %s не пов'язано зі значенням %d

source: Type %s not mapped for value %lld
ca: El tipus %s no està assignat per al valor %lld
ro: Tipul %s nu este trecut pe hartă pentru valoarea %lld
tr: %s türü %lld değeri ile eşleşmiyor
uk: Тип %s не пов'язано зі значенням %lld

source: Type %s not mapped for value %d/%d/%d %d:%d:%d.%lu
ca: El tipus %s no està assignat per al valor %d/%d/%d %d:%d:%d.%lu
ro: Tipul %s nu este trecut pe hartă pentru valoarea %d/%d/%d %d:%d:%d.%lu
tr: Tür %s eşleşmiyor, %d/%d/%d %d:%d:%d.%lu değeri için
uk: Тип %s не пов'язано зі значенням %d/%d/%d %d:%d:%d.%lu

source: Type %s not mapped for value %f
ca: El tipus %s no està assignat per al valor %f
ro: Tipul %s nu este trecut pe hartă pentru valoarea %f
tr: %s eşleşmiyor, %f değeri için
uk: Тип %s не пов'язано зі значенням %f

source: Type %s not mapped for value %s
ca: El tipus %s no està assignat per al valor %s
ro: Tipul %s nu este trecut pe hartă pentru valoarea %s
tr: %s eşleşmiyor, %s değeri için
uk: Тип %s не пов'язано зі значенням %s

source: Provider for MySQL databases
ca: Proveïdor per a bases de dades MySQL
ro: Furnizor pentru bazele de date MySQL
tr: MySQL veritabanları için sağlayıcı
uk: Постачальник для баз даних MySQL

source: As first column
ca: Com a primera columna
ro: Ca prima coloană
tr: İlk sütun olarak
uk: Як перший стовпчик

source: Add the column as the first column of the table
ca: Afegir la columna com la primera columna de la taula
ro: Adaugă coloana ca fiind prima coloană din tabelă
tr: Tablonun ilk sütunu olacak şekilde sütun ekle
uk: Додати стовпчик як перший стовпчик таблиці

source: After column
ca: Després de la columna
ro: După coloană
tr: Sütundan sonra
uk: Після стовпчика

source: Add the column after the specified column
ca: Afegiu la columna després de la columna especificada
ro: Adaugă coloana după coloana specificată
tr: Belirtilen sütundan sonra sütun ekle
uk: Додати стовпчик після вказаного стовпчика

source: Field comment
ca: Comentari del camp
ro: Comentariu de câmp
tr: Alan açıklaması
uk: Коментар поля

source: Table comment
ca: Comentari de la taula
ro: Comentariu de tabelă
tr: Tablo açıklaması
uk: Коментар таблиці

source: Server access parameters
ca: Paràmetres d'accés del servidor
ro: Parametrii de acces la server
tr: Sunucu erişim parametreleri
uk: Параметри доступу до сервера

source: Host on which the database server is running
ca: Amfitrió on s'està executant el servidor de base de dades
ro: Gazdă la care serverul pentru baza de date rulează
tr: Veri tabanının üzerinde çalıştığı makine
uk: Вузол, на якому запущено сервер бази даних

source: Database server port
ca: Port del servidor de bases de dades
ro: Portul serverului pentru baza de date
tr: Veri tabanı sunucusu bağlantı noktası
uk: Порт сервера бази даних

source: UNIX Socket
ca: Sòcol UNIX
ro: Socket UNIX
tr: UNIX soketi
uk: Сокет UNIX

source: Full path of the UNIX socket to use when connecting locally
ca: Camí completa al sòcol UNIX per a utilitzar al connectar localment
ro: Calea completă a socketului UNIX de utilizat când vă conectați local
tr: Yerel olarak bağlanıldığında kullanılacak olan UNIX soketinin tam yolu
uk: Повний шлях до сокета UNIX, яким слід користуватися для локальних з'єднань

source: Administrator login
ca: Inici de sessió d'administrador
ro: Autentificare administrator
tr: Yönetici girişi
uk: Користувач-адміністратор

source: Login name (which has the rights to create databases)
ca: Nom d'inici de sessió (que té els drets de crear bases de dades)
ro: Nume de autentificare (care are drepturile de a crea baze de date)
tr: Giriş adı (veri tabanı oluşturmak için haklara sahip olan)
uk: Назва облікового запису (який має право на створення баз даних)

source: Administrator password
ca: Contrasenya d'administrador
ro: Parolă administrator
tr: Yönetici parolası
uk: Пароль адміністратора

source: Connection protocol
ca: Protocol de connexió
ro: Protocolul conexiunii
tr: Bağlantı iletişim kuralı
uk: Протокол з'єднання

source: Explicitly specifies a connection protocol to use. It is useful when the other connection parameters normally would cause a protocol to be used other than the one you want
ca: Explicita un protocol de connexió a utilitzar. És útil quan la resta de paràmetres de connexió solen fer que s'utilitzi un protocol diferent del que voleu
ro: Specifică explicit protocolul de conexiune de folosit. Este folositor când alți parametrii de conexiune vor cauza ca alt protocol să fie folosit în loc de cel dorit
tr: Kullanılan bağlantı iletişim kuralı açıkça belirtilir. Diğer bağlantı parametreleri istediğinizden başka normal olarak kullanılacak iletişim kuralı belirleneceğinde yardımcı olur

source: Create database only if it does not yet exist
ca: Crea una base de dades només si encara no existeix
ro: Creează bază de date doar dacă aceasta nu există încă
tr: Henüz yoksa veri tabanı oluştur
uk: Створити базу даних, лише якщо її ще не існує

source: Character set
ca: Joc de caràcters
ro: Set de caractere
tr: Karakter kümesi
uk: Кодування символів

source: Character set encoding to use in the new database
ca: Codificació del conjunt de caràcters per a utilitzar a la nova base de dades
ro: Codare pentru setul de caractere de utilizat în baza de date nouă
tr: Yeni veri tabanında kullanılacak olan karakter kümesinin kodlaması
uk: Кодування символів, яким слід скористатися у новій базі даних

source: Collation
ca: Intercalació
ro: Ordine alfabetică
tr: Karşılaştırma
uk: Об'єднання

source: Collation method to use in the new database
ca: Mètode d'intercalació a utilitzar en la base de dades nova
ro: Metoda de ordonare alfabetică care să se utilizeze în noua bază de date
tr: Yeni veri tabanında kullanılacak ola karşılaştırma yöntemi
uk: Спосіб порівняння, яким слід скористатися у новій базі даних

source: ISO 8859-1 West European
ca: Europeu occidental ISO 8859-1
ro: European Vestic ISO 8859-1
tr: ISO 8859-1 Batı Avrupa
uk: ISO 8859-1 (Західна Європа)

source: ISO 8859-2 Central European
ca: Europeu central ISO 8859-2
ro: European Central ISO 8859-2
tr: ISO 8859-2 Orta Avrupa
uk: ISO 8859-2 (Центральна Європа)

source: Big5 Traditional Chinese
ca: Xinès tradicional Big5
ro: Chineză Tradițională Big5
tr: Big5 Geleneksel Çince
uk: Big5, традиційна китайська

source: DEC West European
ca: Europeu occidental DEC
ro: European Vestic DEC
tr: DEC Batı Avrupa
uk: DEC, західноєвропейська

source: DOS West European
ca: Europeu occidental DOS
ro: European Vestic DOS
tr: DOS Batı Avrupa
uk: DOS, західноєвропейська

source: HP West European
ca: Europeu occidental HP
ro: European Vestic HP
tr: HP Batı Avrupa
uk: HP, західноєвропейська

source: KOI8-R Relcom Russian
ca: Rus Relcom KOI8-R
ro: Rusă Relcom KOI8-R
tr: KOI8-R Relcom Rusça
uk: KOI8-R Relcom, російська

source: 7bit Swedish
ca: Suec 7bit
ro: Suedez 7bit
tr: 7bit İsveççe
uk: 7-бітова, шведська

source: EUC-JP Japanese
ca: Japonès EUC-JP
ro: Japoneză EUC-JP
tr: EUC-JP Japonca
uk: EUC-JP (Японія)

source: Shift-JIS Japanese
ca: Japonès Shift-JIS
ro: Japoneză Shift-JIS
tr: Shift-JIS Japonca
uk: Shift-JIS японська

source: ISO 8859-8 Hebrew
ca: Hebreu ISO 8859-8
ro: Ebraică ISO 8859-8
tr: ISO 8859-8 İbranice
uk: ISO-8859-8 (Іврит)

source: TIS620 Thai
ca: Tailandès TIS620
ro: Thailandeză TIS620
tr: TIS-620 Tai
uk: TIS-620 таїландська

source: EUC-KR Korean
ca: Coreà EUC-KR
ro: Coreeană EUC-KR
tr: EUC-KR Korece
uk: EUC-KR корейська

source: KOI8-U Ukrainian
ca: Ucraïnès KOI8-U
ro: Ucraineană KOI8-U
tr: KOI8-U Ukraynaca
uk: KOI8-U (Українська)

source: GB2312 Simplified Chinese
ca: Xinès simplificat GB2312
ro: Chineză Simplificată GB2312
tr: GB2312 Basitleştirilmiş Çince
uk: GB3212, спрощена китайська

source: ISO 8859-7 Greek
ca: Grec ISO 8859-7
ro: Greacă ISO 8859-7
tr: ISO 8859-7 Yunanca
uk: ISO-8859-7 (Грецька)

source: Windows Central European
ca: Europeu central Windows
ro: European Central Windows
tr: Windows Orta Avrupa
uk: Windows центральноєвропейська

source: GBK Simplified Chinese
ca: Xinès simplificat GBK
ro: Chineză Simplificată GBK
tr: GBK Basitleştirilmiş Çince
uk: GBK, спрощена китайська

source: ISO 8859-9 Turkish
ca: Turc ISO 8859-9
ro: Turcă ISO 8859-9
tr: ISO 8859-9 Türkçe
uk: ISO-8859-9 (Турецька)

source: ARMSCII-8 Armenian
ca: Armeni ARMSCII-8
ro: Armenian ARMSCII-8
tr: ARMSCII-8 Ermenice
uk: ARMSCII-8, вірменська

source: DOS Russian
ca: Rus DOS
ro: Rusă DOS
tr: DOS Rusça
uk: DOS, російська

source: DOS Kamenicky Czech-Slovak
ca: Txec-Eslovac Kamenicky DOS
ro: Ceho-slovac Kamenicky DOS
tr: DOS Kamenicky Çek-Slovak
uk: Чехословацька DOS, Каменіцькі

source: Mac Central European
ca: Europeu central Mac
tr: Mac Merkez Avrupa
uk: Центральноєвропейська Mac

source: Mac West European
ca: Europeu occidental Mac
ro: Mac vestic european
tr: Mac Batı Avrupa
uk: Mac, західноєвропейська

source: DOS Central European
ca: Europeu central DOS
ro: European Central DOS
tr: DOS Merkez Avrupa
uk: DOS, центральноєвропейська

source: ISO 8859-13 Baltic
ca: Bàltic ISO 8859-13
ro: Baltic ISO 8859-13
tr: ISO 8859-13 Baltık
uk: ISO-8859-13 (Балтійські)

source: Windows Cyrillic
ca: Ciríl·lic Windows
ro: Chirilic Windows
tr: Windows Kiril
uk: Windows, кирилиця

source: Windows Arabic
ca: Àrab Windows
ro: Arabă Windows
tr: Windows Arapça
uk: Windows, арабська

source: Windows Baltic
ca: Windows Bàltic
ro: Baltică Windows
tr: Windows Baltık
uk: Windows, балтійська

source: Binary pseudo charset
ca: Conjunt de caràcters pseudo binari
ro: Set de caractere pseudo binar
tr: İkili sözde karakter kümesi
uk: Двійковий псевдонабір символів

source: GEOSTD8 Georgian
ca: GEOSTD8 Georgià
ro: Gruzină GEOSTD8
tr: GEOSTD8 Gürcüce
uk: GEOSTD8, грузинська

source: SJIS for Windows Japanese
ca: SJIS per al Windows japonès
ro: SJIS pentru Japoneză Windows
tr: Windows Japonca için SJIS
uk: SJIS для Windows, японська

source: Automatic
ca: Automàtic
ro: Automat
tr: Otomatik
uk: Автоматично

source: TCP: TCP/IP connection to local or remote server.
ca: TCP: connexió TCP/IP a un servidor local o remot.
ro: TCP: conexiune TCP/IP la server local sau la distanță.
tr: TCP: Yerel ya da uzak sunucu için TCP/IP bağlantısı.
uk: TCP: з'єднання TCP/IP із локальним або віддаленим сервером.

source: Socket: Unix socket file connection to local server (Local Unix server only).
ca: Sòcol: fitxer sòcol de connexió Unix a servidor local (només per a servidors locals).
ro: Soclu: Conexiunea la fișierul soclu Unix către un server local (numai servere locale Unix).
tr: Soket: Yerel sunucu için Unix soket dosyası bağlantısı (yalnızca yerel Unix sunucusu)
uk: Сокет: з'єднання файла сокета Unix із локальним сервером (лише для локального сервера Unix).

source: Pipe: Named-pipe connection to local or remote server (Windows server only)
ca: Canonada: Connexió amb canonada amb nom a un servidor local o remot (només per a servidors Windows)
ro: Linie de asamblare: Conexiune numită la serverul local sau la distanță (numai servere Windows)
tr: Boru: Yerel ya da uzak sunucular için boru olarak adlandırılmış bağlantı (yalnızca Windows sunucular için)
uk: Канал: з'єднання іменованого каналу із локальним або віддаленим сервером (лише сервер Windows)

source: Memory: Shared-memory connection to local server (Local Windows server only)
ca: Memòria: Connexió amb memòria compartida a un servidor local o remot (només per a servidors Windows locals)
ro: Memorie: Conexiune cu memorie partajată la serverul local (numai servere Windows locale)
tr: Bellek: Yerel sunucular için paylaşımlı bellek bağlantısı (yalnızca Windows sunucular için)
uk: Пам'ять: з'єднання спільної пам'яті із локальним сервером (лише для локального сервера Windows)

source: Method
ca: Mètode
ro: Metodă
tr: Yöntem
uk: Метод

source: Index type (depending on table storage engine)
ca: Tipus d'índex (en funció del motor d'emmagatzematge de la taula)
ro: Tip de indice (depinde de motorul de stocare al tabelei)
tr: İndeks türü (Tablo depolama motoru ile bağlantılı)
uk: Тип покажчика (залежний від рушія зберігання таблиці)

source: Length
ca: Longitud
ro: Lungime
tr: Uzunluk
uk: Довжина

source: The number of characters the index is on for columns of type CHAR or VARCHAR
ca: El nombre de caràcters en els quals està l'índex per columnes de tipus CHAR o VARCHAR
ro: Numărul de caractere al indicelui pentru coloanele de tipul CHAR sau VARCHAR
tr: CHAR ve VARCHAR türünün sütunları için indeksin karakter sayısı
uk: Кількість символів для яких увімкнено формування покажчика для стовпчиків типів CHAR або VARCHAR

source: Table's comment
ca: Comentari de la taula
ro: Comentariul tabelei
tr: Tablo açıklaması
uk: Коментар таблиці

source: Table's options
ca: Opcions de la taula
ro: Opțiunile tabelei
tr: Tablonun seçenekleri
uk: Параметри таблиці

source: Engine
ca: Motor
ro: Motor
tr: Motor
uk: Рушій

source: Table's engine (or type)
ca: Motor (o tipus) de la taula
ro: Motorul tabelei (sau tipul)
tr: Tablonun motoru (veya türü)
uk: Рушій (або тип) таблиці

source: Auto increment value
ca: Valor d'increment automàtic
ro: Valoare incrementată automat
tr: Otomatik değer arttırma
uk: Значення автозбільшення
