Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Multiple statements detected, only the first will be used
ca: S'han detectat múltiples declaracions, només es farà servir la primera
ro: S-au detectat comenzi multiple, doar prima va fi utilizată
tr: Çoklu ifade algılandı, yalnızca birincisi kullanılacak
uk: Виявлено декілька інструкцій, буде використано лише першу

source: Zoom...
ro: Mărește...
tr: Yakınlaştırma...
uk: Масштаб…

source: Data source's ID (as referenced by other data sources)
ca: ID de la font de dades (tal com ho referencien altres fonts de dades)
ro: ID-ul sursei de date (așa cum este referențiat de alte surse de date)
tr: Veri kaynağının kimliği (Diğer veri kaynaklarında gösterildiği gibi)
uk: Ідентифікатор джерела даних (як на нього посилаються інші джерела даних)

source: Data source's description
ca: Descripció de la font de dades
ro: Descrierea sursei de date
tr: Veri kaynağının tanımlaması
uk: Опис джерела даних

source: Table to display data from, leave empty to specify a SELECT statement instead
ca: Taula des de la qual mostrar les dades, deixeu-la buida per a poder especificar una declaració SELECT
ro: Tabela din care se afișează datele, lăsați liber pentru a specifica în schimb o comandă SELECT
tr: Verinin gösterileceği tablo, yerine SELECT ifadesi belirtmek için boş bırakın
uk: Таблиця для показу даних, не заповнюйте, щоб вказати замість нього інструкцію SELECT

source: Actual SQL executed to select data Can't be changed if a table name is set
ca: SQL executat per a seleccionar dades No es pot canviar si s'ha configurat un nom de taula
ro: SQL actual executat pentru a selecta datele Nu poate fi schimbat dacă un nume de tabelă este stabilit
tr: Var olan SQL, veriyi seçmek için çalıştırıldı Tablo adı ayarlandı ise değiştirilemez
uk: Сам код SQL, який буде виконано для вибору даних Не може бути змінено, якщо встановлено назву таблиці

source: Dependencies
ca: Dependències
ro: Dependențe
tr: Bağımlılıklar
uk: Залежності

source: Required and provided named parameters
ca: Paràmetres amb nom requerits i proporcionats
ro: Parametrii numiți necesari și furnizați
tr: Gerekli ve sağlanmış adlandırılmış parametreler
uk: Потрібні і надані іменовані параметри

source: Requires:
ca: Requereix:
ro: Necesită:
tr: Gereksinimler:
uk: Потребує:

source: Exports:
ca: Exportacions:
ro: Exportă:
tr: Dışa Aktarımlar:
uk: Експортує:

source: Link to other data
ca: Enllaçar a altres dades
ro: Legătură la alte date
tr: Diğer veriye bağla
uk: Посилання на інші дані

source: Remove data source
ca: Eliminar la font de dades
ro: Elimină sursa de date
tr: Veri kaynağını kaldı
uk: Вилучає джерело даних

source: Show data source's properties
ca: Mostrar les propietats de la font de dades
ro: Afișează proprietățile sursei de date
tr: Verin kaynağının özelliklerini göster
uk: Показати властивості джерела даних

source: No data source defined
ca: No s'ha definit cap font de dades
ro: Nicio sursă de date definită
tr: Tanımlı veri kaynağı yok
uk: Не визначено джерела даних

source: Can't bind parameter '%s' of type '%s' to a parameter of type '%s'
ca: No es pot enllaçar el paràmetre «%s» del tipus «%s» a un paràmetre del tipus «%s»
ro: Nu se poate lega parametul „%s” de tip „%s” la un parametru de tip „%s”
tr: '%s' parametresi ('%s' türünde) '%s' türündeki bir parametreye bağlanamaz
uk: Не вдалося пов'язати параметр «%s» типу «%s» із параметром типу «%s»

source: Remove
ca: Elimina
ro: Elimină
tr: Kaldır
uk: Вилучити

source: Data sources:
ca: Fonts de dades:
ro: Surse de date:
tr: Veri kaynakları:
uk: Джерела даних:

source: Selected data source's properties:
ca: Propietats de l'origen de dades seleccionat:
ro: Proprietățile sursei de date selectate:
tr: Seçili veri kaynağının özellikleri:
uk: Вибрані властивості джерела даних:

source: Error parsing XML specifications
ca: S'ha produït un error a l'analitzar les especificacions XML
ro: Eroare la analizarea specificațiilor XML
tr: XML tanımlamaları ayrıştırmada hata
uk: Помилка під час обробки специфікації XML

source: Expecting <%s> root node
ca: Esperant el node arrel <%s>
ro: S-a așteptat nodul de administrator <%s>
tr: Beklenen <%s> kök düğüm
uk: Мав бути кореневий вузол <%s>

source: SQL code to execute:
ca: Codi SQL a executar:
ro: Cod SQL de executat:
tr: Çalıştırılacak SQL kodu:
uk: Код SQL, який слід виконати:

source: _Add
ca: _Afegir
ro: _Adaugă
tr: _Ekle
uk: _Додати

source: Declare a foreign key for table '%s'
ca: Declarar una clau externa per a la taula «%s»
ro: Declară o cheie străină pentru tabela „%s”
tr: '%s' tablosu için bir yabancı anahtar tanımla
uk: Оголосити сторонній ключ для таблиці «%s»

source: define which table is referenced, which columns are part of the foreign key, and which column each one references
ca: definir quina taula es referencia, quines columnes són part de la clau externa, i a quines columnes referencia cadascuna
tr: hangi tablonun kaynak olduğunu, hangi sütunların yabancı anahtarın bir parçası olduğunu ve her birinin hangisine işaret ettiğini belirt

source: Foreign key name:
ca: Nom de la clau externa:
ro: Numele cheii străine:
tr: Yabancı anahtar adı:
uk: Назва стороннього ключа:

source: Referenced table:
ca: Taula referenciada:
ro: Tabelă referețiată:
tr: Referans tablosu:
uk: Еталонна таблиця:

source: Referenced column
ca: Columna referenciada
ro: Coloană referențiată
tr: Referans sütunu
uk: Стовпчик посилання

source: Missing information to declare foreign key
ca: Manca informació per a declarar la clau externa
ro: Informații lipsă pentru a declara o cheie străină
tr: Yabancı anahtar tanımlamak için bilgi eksik
uk: Не вистачає відомостей для оголошення стороннього ключа

source: Missing information to undeclare foreign key
ca: Manca informació per a anul·lar la clau externa
ro: Informații lipsă pentru a elimina o cheie străină
tr: Yabancı anahtarı kaldırmak için bilgi eksik
uk: Не вистачає даних для скасування оголошення стороннього ключа

source: Import specifications
ca: Especificacions de la importació
ro: Specificații de importare
tr: Özellikleri içeri aktar
uk: Імпортувати специфікації

source: File to import from:
ca: Fitxer a importar des de:
ro: Fișierul de la care se importă:
tr: İçeri aktarılacak dosya:
uk: Файл для імпортування:

source: File to import data from
ca: Fitxer per a importar dades des de
ro: Fișier de la care se importă date
tr: İçeriye aktarılacak veri dosyası
uk: Файл, з якого слід імпортувати дані

source: Comma separated values
ca: Valors separats per coma
ro: Valori separate prin virgulă
tr: Virgülle ayrılmış değerler
uk: Значення, розділені комами

source: XML exported
ca: XML exportat
ro: XML exportat
tr: XML dışarı aktarılmış
uk: Експортований XML

source: All files
ca: Tots els fitxers
ro: Toate fișierele
tr: Tüm dosyalar
uk: усі файли

source: Encoding:
ca: Codificació:
ro: Codare:
tr: Kodlama:
uk: Кодування:

source: First line as title:
ca: La primera línia com a títol:
ro: Prima linie ca titlu:
tr: Başlık olarak ilk satır:
uk: Перший рядок як заголовок:

source: Separator:
ca: Separador::
tr: Ayırıcı:
uk: Роздільник:

source: Comma
ca: Coma
ro: Virgulă
tr: Virgül
uk: Кома

source: Semi colon
ca: Punt i coma
ro: Punct și virgulă
tr: Noktalı virgül
uk: Крапка з комою

source: Tab
ca: Tabulació
tr: Sekme
uk: Табуляція

source: Space
ca: Espai
ro: Spațiu
tr: Boşluk
uk: Пробіл

source: Pipe
ca: Conducte
ro: Conexiune
tr: Boru
uk: Канал

source: Other:
ca: Altres:
ro: Altele:
tr: Diğer:
uk: Інше:

source: Import preview
ca: Vista prèvia de la importació
ro: Importă previzualizare
tr: İçeri aktarma ön izlemesi
uk: Перегляд імпортування

source: No data.
ca: No hi ha dades.
ro: Fără date.
tr: Veri yok.
uk: Немає даних.

source: Data set import from file
ca: Importa un conjunt de dades des d'un fitxer
ro: Importare a setului de date de la fișier
tr: Dosyadan içeri aktarılacak veri kümesi
uk: Імпорт набору даних з файла

source: _OK
ca: _D'acord
tr: _Tamam
uk: _Гаразд

source: %d column
ca: %d columna
ro: %d coloană
tr: %d sütun
uk: %d стовпчик

source: Data set with %s and %s
ca: Conjunt de dades amb %s i %s
ro: Set de date cu %s și %s
tr: Veri kümesi %s ve %s ile
uk: Набір даних із %s і %s

source: Modify
ca: Modifica
ro: Modifică
tr: Değiştir
uk: Змінити

source: Import
ca: Importa
ro: Importă
tr: İçe Aktar
uk: Імпортувати

source: No data set
ca: No hi ha conjunt de dades
ro: Fără set de date
tr: Veri kümesi yok
uk: Немає набору даних

source: Could not get information about LDAP class
ca: No s'ha pogut obtenir informació sobre la classe LDAP
ro: Nu s-au putut obține informații despre clasa LDAP
tr: LDAP sınıfı hakkında bilgi alınamadı
uk: Не вдалося отримати відомості щодо класу LDAP

source: Class OID:
ca: Classe OID:
ro: Clasa OID:
tr: Sınıf OID:
uk: OID класу:

source: Class kind:
ca: Tipus de classe:
ro: Tipul clasei:
tr: Sınıf türü:
uk: Тип класу:

source: Class name:
ca: Nom de la classe:
ro: Denumire clasă:
tr: Sınıf adı:
uk: Назви класів:

source: This LDAP class is obsolete
ca: Aquesta classe LDAP està obsoleta
ro: Această clasă de LDAP este învechită
tr: Bu LDAP sınıfı artık kullanılmıyor
uk: Цей клас LDAP є застарілим

source: Required attribute:
ca: Atribut obligatori:
ro: Atribut necesar:
tr: Gerekli öznitelik:
uk: Обов'язковий атрибут:

source: Optional attribute:
ca: Atribut opcional:
ro: Atribut opțional:
tr: İsteğe bağlı öznitelik:
uk: Необов'язковий атрибут:

source: Children class:
ca: Classe de fills:
ro: Clasa copiilor:
tr: Alt sınıf:
uk: Дочірні класи:

source: Inherited class:
ca: Classe heretada:
ro: Clasa moștenită:
tr: Mirasla kalmış sınıf:
uk: Успадковані класи:

source: Select the file to save data to
ca: Seleccioneu el fitxer on guardar les dades
ro: Selectează fișierul în care să se salveze datele
tr: Verinin kaydedileceği dosyayı seçin
uk: Виберіть файл для збереження даних

source: Could not save data: %s
ca: No s'han pogut desar dades: %s
ro: Nu s-au putut salva datele: %s
tr: Veri kaydedilemedi: %s
uk: Не вдалося зберегти дані: %s

source: Non activated
ca: No activat
ro: Neactivat
tr: Etkinleştirilmemiş
uk: Не активовано

source: Never
ca: Mai
ro: Niciodată
tr: Hiçbir zaman
uk: Ніколи

source: Distinguished Name:
ca: Nom distintiu:
ro: Nume distins:
tr: Eşsiz Ad:
uk: Розпізнавана назва:

source: Can't display attribute value
ca: No es pot mostrar el valor de l'atribut
ro: Nu se poate afișa valoarea atributului
tr: Öznitelik değeri gösterilemiyor
uk: Не вдалося показати значення атрибуту

source: Could not get information about LDAP entry
ca: No s'ha pogut obtenir informació sobre l'entrada LDAP
ro: Nu s-au putut obține informații despre intrarea LDAP
tr: LDAP girdisi hakkındaki bilgi alınamadı
uk: Не вдалося отримати відомості щодо запису LDAP

source: Base DN:
ro: DN de bază:
tr: Ana DN:
uk: Кореневий DN:

source: Filter expression:
ca: Expressió del filtre:
ro: Filtrează expresia:
tr: Süzgeç ifadesi:
uk: Вираз для фільтрування:

source: Attributes to fetch:
ca: Atributs a obtenir:
ro: Atribute de adus:
tr: Getirilecek öznitelikler:
uk: Атрибути для отримання:

source: Search scope:
ca: Abast de la cerca:
ro: Domeniu de căutare:
tr: Arama alanı:
uk: Діапазон пошуку:

source: Could not find LDAP entry with DN '%s'
ca: No s'ha pogut trobar l'entrada LDAP amb DN «%s»
ro: Nu s-a putut găsi o intrare LDAP cu DN-ul „%s”
tr: DN '%s' ile LDAP girdisi bulunamadı
uk: Не вдалося знайти запис LDAP із DN «%s»

source: New LDAP entries tab
ca: Pestanya d'entrades LDAP nova
tr: Yeni LDAP girdileri sekmesi
uk: Створити вкладку записів LDAP

source: New LDAP classes tab
ca: Pestanya de classes LDAP nova
tr: Yeni LDAP sınıfları sekmesi
uk: Створити вкладку класів LDAP

source: New LDAP search tab
ca: Nova pestanya de cerca LDAP
tr: Yeni LDAP araması sekmesi
uk: Створити вкладку пошуку LDAP

source: LDAP classes browser
ca: Visor de classes LDAP
ro: Navigator de clase LDAP
tr: LDAP sınıfları tarayıcısı
uk: Навігатор класами LDAP

source: LDAP classes
ca: Classes LDAP
ro: Clase LDAP
tr: LDAP sınıfları
uk: Класи LDAP

source: LDAP class's properties
ca: Propietats de la classe LDAP
ro: Proprietățile clasei LDAP
tr: LDAP sınıflarının özellikleri
uk: Властивості класу LDAP

source: Add class to Favorites
ca: Afegeix una classe als preferits
tr: Sınıfı Favorilere ekle
uk: Додати клас до вибраних

source: Move back to previous LDAP class
ca: Torna a la classe LDAP anterior
ro: Trece înapoi la clasa LDAP precedentă
tr: Bir önceki LDAP sınıfına geri dön
uk: Повернутися до попереднього класу LDAP

source: Move to next LDAP class
ca: Mou a la classe LDAP següent
ro: Trece la clasa LDAP următoare
tr: Sonraki LDAP sınıfına taşı
uk: Перейти до наступного класу LDAP

source: LDAP entries browser
ca: Visor d'entrades LDAP
ro: Navigator de intrări LDAP
tr: LDAP girdileri tarayıcısı
uk: Навігація записами LDAP

source: LDAP hierarchy
ca: Jerarquia LDAP
ro: Ierarhia LDAP
tr: LDAP sıradüzeni
uk: Ієрархія LDAP

source: LDAP entry's details
ca: Detalls de l'entrada LDAP
ro: Detaliile intrării LDAP
tr: LDAP girdilerinin ayrıntıları
uk: Подробиці щодо запису LDAP

source: Add entry to Favorites
ca: Afegeix una entrada a preferits
tr: Girdiyi Favorilere ekle
uk: Додати запис до вибраних

source: Move back to previous LDAP entry
ca: Torna a l'entrada LDAP anterior
ro: Trece înapoi la intrarea LDAP precedentă
tr: Önceki LDAP girdisini geri taşı
uk: Перейти до попереднього запису LDAP

source: Move to next LDAP entry
ca: Mou a l'entrada LDAP següent
ro: Trece la intrarea LDAP următoare
tr: Sonraki LDAP girdisine taşı
uk: Перейти до наступного запису LDAP

source: LDAP entries
ca: Entrades LDAP
ro: Intrări LDAP
tr: LDAP girdileri
uk: Записи LDAP

source: Favorites
ca: Preferits
ro: Favorite
tr: Favoriler
uk: Вибране

source: LDAP search page
ca: Pàgina de cerca LDAP
ro: Pagina de căutare LDAP
tr: LDAP arama sayfası
uk: Сторінка пошуку у LDAP

source: LDAP search settings
ca: Configuració de la cerca LDAP
ro: Setări de căutare LDAP
tr: LDAP arama ayarları
uk: Параметри пошуку у LDAP

source: Clear
ca: Elimina
ro: Eliberează
tr: Temizle
uk: Очистити

source: Clear the search settings
ca: Esborreu la configuració de la cerca
ro: Golește setările de căutare
tr: Arama ayarlarını temizle
uk: Очистити параметри пошуку

source: Execute LDAP search
ca: Executeu la cerca LDAP
ro: Execută căutare LDAP
tr: LDAP aramasını çalıştır
uk: Виконати пошук у LDAP

source: Results
ca: Resultats
ro: Rezultate
tr: Sonuçlar
uk: Результати

source: Could not define virtual table for this LDAP search: %s
ca: Executeu la cerca LDAP: %s
ro: Nu s-a putut defini tabela virtuală pentru această căutare LDAP: %s
tr: Bu LDAP araması için, bir sanal tablo tanımlanamadı: %s
uk: Не вдалося визначити віртуальну таблицю для цього пошуку у LDAP: %s

source: Virtual table '%s' for this LDAP search has been defined
ca: S'ha definit una taula virtual «%s» per a aquesta cerca LDAP
ro: Tabela virtuală „%s” pentru această căutare LDAP a fost definită
tr: Bu LDAP araması için '%s' sanal tablosu tanımlanmış
uk: Віртуальну таблицю «%s» для цього пошуку у LDAP було визначено

source: Define search as a virtual table
ca: Definiu la cerca com a taula virtual
ro: Definește căutarea ca un tabel virtual
tr: Aramayı sanal tablo olarak tanımla
uk: Визначити пошук як віртуальну таблицю

source: LDAP search
ca: Cerca LDAP
ro: Căutare LDAP
tr: LDAP arama
uk: Пошук у LDAP

source: Define LDAP search as a virtual table
ca: Definir la cerca LDAP com a taula virtual
ro: Definește căutarea LDAP ca un tabel virtual
tr: LDAP aramasını, sanal tablo olarak tanımla
uk: Визначити пошук у LDAP як віртуальну таблицю

source: Name of the virtual LDAP table to create
ca: Nom de la taula LDAP virtual a crear
ro: Numele tabelei LDAP virtuale de creat
tr: Oluşturulacak sanal LDAP tablosunun adı
uk: Назва віртуальної таблиці LDAP, яку слід створити

source: Everytime data is selected from the virtual table which will be created, the LDAP search will be executed and data returned as the contents of the table.
ca: Cada vegada que se seleccionen les dades de la taula virtual que es crearà, s'executarà la cerca LDAP i es retornarà la informació com a contingut de la taula.
ro: De fiecare dată când sunt selectate date din tabela virtuală care va fi creată, căutarea LDAP va fi executată și datele returnate ca conținut al tabelului.
tr: Oluşturulacak sanal tablodan her veri seçildiğinde, LDAP araması yürütülür ve veri tablonun içeriği olarak döndürülür.

source: Table name:
ca: Nom de la taula:
ro: Numele tabelei:
tr: Tablo adı:
uk: Назва таблиці:

source: Replace if exists:
ca: Reemplaça si existeix:
ro: Înlocuiți dacă există:
tr: Varsa değiştir:
uk: Заміна, якщо існує:

source: Connection opening:
ca: Obertura de la connexió:
ro: Deschiderea conexiunii:
tr: Bağlantı açma:
uk: Відкриття з'єднання:

source: Select a named data source, or specify parameters to open a connection to a non defined data source
ca: Seleccionar el nom de la font de dades o especificar els paràmetres per a obrir una connexió a una font de dades no definida
ro: Selectați o sursă de date denumită, sau specificați parametrii pentru a deschide o conexiune la o sursă de date neidentificată
tr: Adlandırılmış bir veri kaynağı seçin veya tanımlanmamış veri kaynağına\bağlantı açmak için parametreleri belirtin
uk: Виберіть іменоване джерело даних або вкажіть параметри для відкриття з'єднання із невизначеним джерелом даних

source: Cancelled by the user
ca: Cancel·lat per l'usuari
ro: Anulat de utilizator
tr: Kullanıcıca iptal edildi
uk: Скасовано користувачем

source: Multiple statements
ca: Múltiples declaracions
ro: Comenzi multiple
tr: Çoklu ifadeler
uk: Декілька інструкцій

source: SELECT statement
ca: Declaració SELECT
ro: Comandă SELECT
tr: SELECT ifadesi
uk: Інструкція SELECT

source: INSERT statement
ca: Declaració INSERT
ro: Comandă INSERT
tr: INSERT ifadesi
uk: Інструкція INSERT

source: UPDATE statement
ca: Declaració UPDATE
ro: Comandă UPDATE
tr: UPDATE ifadesi
uk: Інструкція UPDATE

source: DELETE statement
ca: Declaració DELETE
ro: Comandă DELETE
tr: DELETE ifadesi
uk: Інструкція DELETE

source: COMPOUND SELECT statement
ca: Declaració COMPOUND SELECT
ro: Comandă COMPOUND SELECT
tr: COMPOUND SELECT ifadesi
uk: Інструкція COMPOUND SELECT

source: BEGIN statement
ca: Declaració BEGIN
ro: Comandă BEGIN
tr: BEGIN ifadesi
uk: Інструкція BEGIN

source: ROLLBACK statement
ca: Declaració ROLLBACK
ro: Comandă ROLLBACK
tr: ROLLBACK ifadesi
uk: Інструкція ROLLBACK

source: COMMIT statement
ca: Declaració COMMIT
ro: Comandă COMMIT
tr: COMMIT ifadesi
uk: Інструкція COMMIT

source: ADD SAVEPOINT statement
ca: Declaració ADD SAVEPOINT
ro: Comandă ADD SAVEPOINT
tr: ADD SAVEPOINT ifadesi
uk: Інструкція ADD SAVEPOINT

source: ROLLBACK SAVEPOINT statement
ca: Declaració ROLLBACK SAVEPOINT
ro: Comandă ROLLBACK SAVEPOINT
tr: ROLLBACK SAVEPOINT ifadesi
uk: Інструкція ROLLBACK SAVEPOINT

source: DELETE SAVEPOINT statement
ca: Declaració DELETE SAVEPOINT
ro: Comandă DELETE SAVEPOINT
tr: DELETE SAVEPOINT ifadesi
uk: Інструкція DELETE SAVEPOINT

source: Unknown statement
ca: Declaració desconeguda
ro: Comandă necunoscută
tr: Bilinmeyen ifade
uk: Невідома інструкція

source: Getting favorites...
ca: Obtenint favorits ...
ro: Se obțin favoritele...
tr: Favoriler getiriliyor...
uk: Отримуємо вибрані…

source: No favorite: drag item to define one
ca: Sense preferits: arrossegueu un element per a definir un
ro: Fără preferate: plasați elementul pentru a defini una
tr: Favori yok: tanılamak için ögeyi sürükleyin
uk: Немає вибраних: перетягніть запис, щоб зробити вибраним

source: %d table in current schema:
ca: %d taula a l'esquema actual:
ro: %d tabelă în schema curentă:
tr: Geçerli şema için %d tablo var:
uk: %d таблиця у поточній структурі:

source: Tables in current schema:
ca: Taules a l'esquema actual:
ro: Tabele în schema curentă:
tr: Geçerli şema içindeki tablolar:
uk: Таблиці у поточній структурі:

source: %d Table in schema '%s':
ca: %d taula a l'esquema «%s»:
ro: %d tabelă în schema „%s”:
tr: %d Şemadaki tablo '%s':
uk: %d таблиця у структурі «%s»:

source: None
ca: Cap
ro: Nimic
tr: Yok
uk: Немає

source: View the schema and data of databases
ca: Consulteu l'esquema i les dades de les bases de dades
ro: Vizualizați schema și datele bazelor de date
tr: Veritabanlarının şema ve verilerini görüntüle
uk: Перегляд схем і даних у базах даних

source: Database Browser provides quick access to the data and schema of a database, and displays it in a intuitive graphical interface. It provides three perspectives to interact with a database: the schema browser, query execution, and data manager. The schema browser allows the user to view the tables of a database, and inspect the table's properties and relations. The query execution perspective allows the user to execute SQL queries on the database. The data manager perspective allows the user to view the data contained in the database in a tabular form.
ca: L'explorador de la base de dades proporciona un accés ràpid a les dades i a l'esquema d'una base de dades i els mostra en una interfície gràfica intuïtiva. Ofereix tres perspectives per a interactuar amb una base de dades: l'explorador de l'esquema, l'execució de consultes i la gestió de dades. L'explorador de l'esquema permet a l'usuari veure les taules d'una base de dades i inspeccionar les propietats de les taules i les seves relacions. L'execució de consultes permet a l'usuari executar consultes SQL sobre la base de dades. La perspectiva de gestió de dades permet a l'usuari veure les dades contingudes a la base de dades en forma de taula.
tr: Veri Tabanı Tarayıcısı, veriye ve bir veri tabanının şemasına hızlı erişim sağlar ve bunları sezgisel bir grafik arayüzde gösterir. Veri tabanı ile etkileşim için üç tane bakış açısı sağlar: Şema tarayıcısı, sorgu çalıştırma ve veri yöneticisi. Şema tarayıcısı, kullanıcılara bir veri tabanının tablolarına görünüm sağlar ve tablonun özelliklerine ve ilişkilerinin denetlenmesine izin verir. Sorgu çalıştırma, kullanıcıların veri tabanı üstünde SQL sorgularını çalıştırmasına izin verir. Veri yöneticisi ise, kullanıcılara veri tabanındaki verileri sekme biçiminde gösterir.

source: Query execution (SQL)
ca: Execució de consulta (SQL)
ro: Execuția interogării (SQL)
tr: Sorgu yürütme (SQL)
uk: Виконання запиту (SQL)

source: Query editor
ca: Editor de consultes
ro: Editor de interogare
tr: Sorgu düzenleyici
uk: Редактор запитів

source: Clear the editor's contents
ca: Netegeu el contingut de l'editor
ro: Eliberează conținuturile editorului
tr: Düzenleyinin içeriklerini temizle
uk: Вилучити дані у редакторі

source: Show variables needed to execute SQL
ca: Mostra les variables necessàries per a executar SQL
ro: Afișează variabilele necesare pentru a executa SQL
tr: SQL yürütmek için gereken değişkenleri göster
uk: Показати змінні, які потрібні для виконання SQL

source: Execute SQL in editor
ca: Executeu SQL a l'editor
ro: Execută SQL în editor
tr: SQL i düzenleyici içinde çalıştır
uk: Виконати SQL у редакторі

source: Indent SQL in editor and make the code more readable (removes comments)
ca: Sagna l'SQL a l'editor i fa que el codi sigui més llegible (elimina comentaris)
ro: Indentează SQL în editor și fă codul mai citeț (elimină comentariile)
tr: SQL i düzenleyici içinde girintile ve kodu daha okunabilir yap (yorum satırlarını kaldırır)
uk: Додати відступи до коду SQL у редакторі і зробити код зручнішим для читання (вилучає коментарі)

source: Add SQL to favorite
ca: Afegeix SQL als preferits
ro: Adaugă SQL la preferat
tr: SQL i favorilere ekle
uk: Додати SQL до вибраних

source: Execution history:
ca: Historial d'execucions:
ro: Istoricul de executare:
tr: Çalışma geçmişi:
uk: Журнал виконання:

source: Copy selected history to editor
ca: Copieu l'historial seleccionat a l'editor
ro: Copiază istoricul selectat la editor
tr: Seçili geçmişi düzenleyiciye kopyala
uk: Копіювати вибраний журнал до редактора
