Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Column cannot be modified
ca: No es pot modificar la columna
ro: Coloana nu poate fi modificată
tr: Sütun değiştirilemiyor
uk: Вносити зміни до стовпчика не можна

source: New path must be a subpath of the base directory
ca: El camí nou ha de ser un subcamí de directori base
ro: Calea nouă trebuie să fie o subcale a dosarului de bază
tr: Yeni yol, taban dizinin bir alt yolu olmalıdır
uk: Новий шлях має бути підлеглим шляхом базового каталогу

source: Could not rename file '%s' to '%s'
ca: No s'ha pogut canviar el nom del fitxer «%s» a «%s»
ro: Nu s-a putut redenumi fișierul „%s” la „%s”
tr: '%s' dosyası '%s' olarak yeniden adlandırılamadı
uk: Не вдалося перейменувати файл «%s» на «%s»

source: Could not create directory '%s'
ca: No s'ha pogut crear el directori «%s»
ro: Nu s-a putut crea dosarul „%s”
tr: '%s' dizini oluşturulamadı
uk: Не вдалося створити каталог «%s»

source: Could not overwrite contents of file '%s'
ca: No s'ha pogut sobreescriure el contingut del fitxer «%s»
ro: Nu s-au putut suprascrie conținuturile fișierului „%s”
tr: '%s' dosyasının içeriğinin üstüne yazılamadı
uk: Не вдалося перезаписати вміст файла «%s»

source: Wrong type of data
ca: El tipus de dada no és correcte
ro: Tip de date incorect
tr: Yanlış veri türü
uk: Помилковий тип даних

source: Column cannot be set
ca: No es pot establir la columna
ro: Coloana nu poate fi stabilită
tr: Sütun ayarlanamaz
uk: Неможливо встановити стовпчик

source: Cannot set contents of filename '%s'
ca: No es pot establir el contingut del nom de fitxer «%s»
ro: Nu se pot stabili conținuturile numelui de fișier „%s”
tr: '%s' dosya adının içeriği ayarlanamaz
uk: Не вдалося встановити вміст файла із назвою «%s»

source: Cannot create directory '%s'
ca: No es pot crear el directori «%s»
ro: Nu se poate crea dosarul „%s”
tr: '%s' dizini oluşturulamıyor
uk: Не вдалося створити каталог «%s»

source: Cannot add row: filename missing
ca: No es pot afegir la fila: manca el nom de fitxer
ro: Nu se poate adăuga rândul: lipsește numele de fișier
tr: Satır eklenemiyor: dosya adı eksik
uk: Не вдалося додати рядок: не вказано назви файла

source: Cannot remove file '%s'
ca: No es pot suprimir el fitxer «%s»
ro: Nu se poate elimina fișierul „%s”
tr: '%s' dosyası silinemiyor
uk: Не вдалося вилучити файл «%s»

source: Connection string
ca: Cadena de connexió
ro: Șir de conexiune
tr: Bağlantı dizisi
uk: Рядок з'єднання

source: Global
tr: Genel
uk: Загальна

source: List of defined data sources
ca: Llista de fonts de dades definides
ro: Listă cu sursele de date definite
tr: Tanımlı veri kaynakları listesi
uk: Вивести список визначених джерел даних

source: "options" property is not a GdaSet object
ca: La propietat «opcions» no és un objecte GdaSet
ro: proprietatea „opțiuni” nu este un obiect GdaSet
tr: "options" özelliği bir GdaSet nesnesi değil
uk: властивість «options» не є об'єктом GdaSet

source: The %s option must hold a string value, ignored.
ca: L'opció %s ha de contenir un valor de cadena, ignorat.
tr: %s seçeneği bir karakter dizisi değeri olmalıdır, yok sayıldı.
uk: Параметр %s має містити рядкове значення, проігноровано.

source: The '%s' option must hold a boolean value, ignored.
ca: L'opció «%s» ha de contenir un valor booleà, ignorat.
ro: Opțiunea „%s” trebuie să dețină o valoare de tip logic, se ignoră.
tr: '%s' seçeneği bir boole değeri olmalıdır, yok sayıldı.
uk: Параметр «%s» має містити булеве значення, проігноровано.

source: The '%s' option must hold a GType value, ignored.
ca: L'opció «%s» ha de contenir un valor GType, ignorat.
ro: Opțiunea „%s” trebuie să dețină o valoare de tip GType, se ignoră.
tr: '%s' seçeneği bir GType değeri olmalıdır, yok sayıldı.
uk: Параметр «%s» має містити значення GType, проігноровано.

source: Character conversion at line %d, error: %s
ca: Conversió de caràcters a la línia %d, error: %s
ro: Conversie de caractere la linia %d, eroare: %s
tr: %d staırında karakter dönüştürme, hata: %s
uk: Перетворення символів у рядку %d, помилка: %s

source: no detail
ca: sense detalls
ro: niciun detaliu
tr: ayrıntı yok
uk: немає подробиць

source: Could not convert string '%s' to a '%s' value
ca: No s'ha pogut convertir la cadena «%s» a un valor «%s»
ro: Nu s-a putut converti șirul „%s” la o valoare „%s”
tr: '%s' değeri '%s' değerine dönüştürülemedi
uk: Не вдалося перетворити рядок «%s» на значення «%s»

source: Error while parsing CSV file: %s
ca: Error a l'analitzar el fitxer CSV: %s
ro: Eroare în timpul analizării fișierului CSV: %s
tr: CSV dosyası ayrıştırılırken hata: %s
uk: Помилка під час обробки файла CSV: %s

source: Failed to read node in XML file
ca: Error en llegir el node en el fitxer XML
ro: A eșuat citirea nodului în fișierul XML
tr: XML dosyasındaki düğüm okunamadı
uk: Не вдалося прочитати вузол у файлі XML

source: Expected <gda_array> node in XML file, got <%s>
ca: S'espera <gda_array> node en el fitxer XML, té <%s>
ro: S-a așteptat nodul <gda_array> în fișierul XML, s-a obținut <%s>
tr: XML dosyasında bekleneb <gda_array> düğümü, alınan <%s>
uk: У файлі XML мав бути вузол <gda_array>, маємо <%s>

source: No "gdatype" attribute specified in <gda_array_field>
ca: Cap atribut «gdatype» especificat a <gda_array_field>
ro: Nu este specificat niciun atribut „gdatype” în <gda_array_field>
tr: <gda_array_field> içinde belirtilmiş bir "gdatype" özniteliği yok
uk: У <gda_array_field> не вказано атрибуту «gdatype»

source: Expected <gda_array_field> in <gda_array>
ca: S'esperava <gda_array_field> en <gda_array>
ro: S-a așteptat <gda_array_field>, în <gda_array>
tr: <gda_array> içinde beklenen <gda_array_field>
uk: Мало бути <gda_array_field> у <gda_array>

source: Expected <gda_array_data> in <gda_array>, got <%s>
ca: S'esperava <gda_array_data> en <gda_array>, s'obté <%s>
ro: S-a așteptat <gda_array_data> în <gda_array>, s-a obținut <%s>
tr: <gda_array> içinde beklenen <gda_array_data>, alınan <%s>
uk: Мало бути <gda_array_data> у <gda_array>, маємо <%s>

source: Expected <gda_array_data> in <gda_array>
ca: S'esperava <gda_array_data> en <gda_array>
ro: S-a așteptat <gda_array_data> în <gda_array>
tr: <gda_array> içinde beklenen <gda_array_data>
uk: Мало бути <gda_array_data> у <gda_array>

source: Can't read the contents of the <gda_array_data> node
ca: No es pot llegir el contingut del node <gda_array_data>
ro: Nu se pot citi conținuturile nodului <gda_array_data>
tr: <gda_array_data> düğümünün içeriği okunamıyor
uk: Не вдалося прочитати вміст вузла <gda_array_data>

source: Expected <gda_array_row> in <gda_array_data>, got <%s>
ca: S'esperava <gda_array_row> en <gda_array_data>, s'obté <%s>
ro: S-a așteptat <gda_array_row> în <gda_array_data>, s-a obținut <%s>
tr: <gda_array_data> içinde beklenen <gda_array_row>, alınan <%s>
uk: Мало бути <gda_array_row> у <gda_array_data>, маємо <%s>

source: Row has too many values (which are ignored)
ca: La fila té massa valors (que s'ignoren)
ro: Rândul are prea multe valori (care sunt ignorate)
tr: Satır çok fazla değere sahip (yoksayıldı)
uk: У рядку надто багато значень (які проігноровано)

source: Could not convert '%s' to a value of type %s
ca: No s'ha pogut convertir «%s» en un valor del tipus %s
ro: Nu s-a putut converti „%s” la o valoare de tip %s
tr: '%s', %s türünün değerine dönüştürülemedi
uk: Не вдалося перетворити «%s» до значення типу %s

source: Expected <gda_array> node but got <%s>
ca: S'esperava un node <gda_array> però s'obté <%s>
ro: S-a așteptat nodul <gda_array> dar s-a obținut <%s>
tr: Beklenen <gda_array> düğümü ancak alınan <%s>
uk: Мало бути використано теґ <gda_array>, маємо <%s>

source: No <gda_array_field> specified in <gda_array>
ca: No especificat <gda_array_field> en <gda_array>
ro: Niciun <gda_array_field> specificat în <gda_array>
tr: <gda_array> içinde belirtilmiş bir <gda_array_field> yok
uk: Не вказано <gda_array_field> у <gda_array>

source: Data model does not support random access
ca: El model de dades no admet l'accés aleatori
ro: Modelul de date nu suportă accesul aleator
tr: Veri modeli rastgele erişimi desteklemiyor
uk: У моделі даних не передбачено підтримки випадкового доступу

source: Row at line %d does not have enough values
ca: La fila a la línia %d no té prou valors
ro: Rândul la linia %d nu are destule valori
tr: %d satırındaki alan yeterli değerlere sahip değil
uk: У рядку рядка %d недостатньо значень

source: Row at line %d does not have enough values, completed with NULL values
ca: La fila de la línia %d no té prou valors. S'ha completat amb valors NULL
ro: Rândul la linia %d nu are destule valori, este completat cu valori NULL
tr: %d satırındaki alan yeterli değerlere sahip değil, NULL değerleri ile dolduruldu
uk: У рядку рядка %d недостатньо значень, доповнено значеннями NULL

source: Row at line %d does not have enough values (which are thus ignored)
ca: La fila de la línia %d no té prou valors (per tant, s'ignoraran)
ro: Rândul la linia %d nu are destule valori (prin urmare sunt ignorate)
tr: %d satırındaki alan yeterli değerlere sahip değil (bunlar göz ardı edilir)
uk: У рядку рядка %d недостатньо значень (які через це проігноровано)

source: Iter has an invalid/non-existent reference to a data model
ca: L'iterador conté una referència no vàlida/inexistent a un model de dades
ro: Iter are o referință nevalidă/neexistentă la un model de date
tr: Iter'in veri modeline geçersiz/varolmayan bir referansı var
uk: У ітераторі є некоректне посилання або посилання, якого не існує, на модель даних

source: Referenced data model in iterator doesn't belong to given data model
ca: El model de dades referenciat a l'iterador no pertany al model de dades indicat
ro: Modelul de date menționat în iterator nu aparține modelului de date dat
tr: Yineleyicideki başvurulan veri modeli verilen veri modeline ait değil
uk: Модель даних, на яку посилається ітератор, не належить до вказаної моделі даних

source: Invalid data model. Can't validate holder
ca: El model de dades no és vàlid. No es pot validar el contenidor
ro: Model de date nevalid. Nu s-a putut valida conținutul
tr: Geçersiz veri modeli. Tutucu doğrulanamıyor
uk: Некоректна модель даних. Не вдалося перевірити утримувача

source: Invalid data model object. Can't set property
ca: L'objecte de model de dades no és vàlid. No es pot establir la propietat
ro: Obiect de model de date nevalid. Nu s-a putut stabili proprietatea
tr: Geçersiz veri modeli nesnesi. Özellik ayarlanamıyor
uk: Некоректний об'єкт моделі даних. Не вдалося встановити властивість

source: Pivot model not populated
ca: Model dinàmic no propagat
ro: Modelul pivot nu a fost populat
tr: Pivot modeli yerleşik değil
uk: Зведену модель не наповнено

source: Integer overflow
ca: Desbordament d'enters
ro: Overflow tip de date întreg
tr: Tamsayı taşması
uk: Переповнення цілочислової змінної

source: Float value overflow
ca: Desbordament de valors flotants
ro: Overflow tip de date în virgulă mobilă
tr: Kayan noktalı sayı taşması
uk: Переповнення значення з рухомою крапкою

source: Double value overflow
ca: Desbordament de valors dobles
ro: Overflow tip de date în virgulă mobilă cu precizie dublă
tr: Double değeri taşması
uk: Переповнення значення подвійної точності з рухомою крапкою

source: Inconsistent data type
ca: El tipus de dades no és coherent
ro: Tip de date inconsistent
tr: Aykırı veri türü
uk: Неузгоджений тип даних

source: Data type does not support requested computation
ca: El tipus de dades no admet el càlcul sol·licitat
ro: Tipul de date nu acceptă calculul solicitat
tr: Veri türü istenilen hesaplamayı desteklemiyor
uk: Для цього типу даних не передбачено бажаного способу обчислення

source: Wrong field format error: %s
ca: Error de format de camp erroni: %s
ro: Eroare format de câmp nevalid: %s
tr: Yanlış alan biçimi hatası: %s
uk: Помилкове форматування поля: %s

source: Wrong field format
ca: El format del camp no és correcte
ro: Format de câmp nevalid
tr: Yanlış alan biçimi
uk: Помилкове форматування поля

source: No row field defined
ca: No s'ha definit cap camp de files
ro: Niciun rând definit
tr: Tanımlanmış bir satır alanı yok
uk: Не визначено поля рядка

source: Could not get information from source data model
ca: No s'ha pogut obtenir la informació del model de dades d'origen
ro: Nu s-au putut obține informații de la modelul de date sursă
tr: Kaynak veri modelinden bilgi alınamadı
uk: Не вдалося отримати інформацію з початкової моделі даних

source: Could not create virtual connection
ca: No s'ha pogut crear la connexió virtual
ro: Nu s-a putut crea conexiunea virtuală
tr: Sanal bağlantı oluşturulamadı
uk: Не вдалося створити віртуальне з'єднання

source: No source defined
ca: No s'ha definit cap origen
ro: Nicio sursă definită
tr: Kaynak tanımlanmamış
uk: Джерело не визначено

source: Invalid source data model (may have incompatible column names)
ca: El model de dades d'origen no és vàlid (pot contenir noms de columna incompatibles)
ro: Modelul de date sursă nu este valid (poate avea nume incompatibile de coloane)
tr: Geçersiz kaynak veri modeli (uyumsuz sütun adları olabilir)
uk: Некоректна початкова модель даних (може містити несумісні назви стовпчиків)

source: GdaDataProxy can't handle non random access data models
ca: GdaDataProxy no pot gestionar models de dades d'accés no aleatori
ro: GdaDataProxy nu poate gestiona modele de date pentru acces non aleator
tr: GdaDataProxy rastgele olmayan erişim modellerini işleyemez
uk: GdaDataProxy не може обробляти моделі без випадкового доступу до даних

source: The first row is an empty row artificially prepended and cannot be removed
ca: La primera fila és una fila buida anteposada artificialment i no pot suprimir-se
ro: Primul rând este un rând liber prefixat artificial și nu poate fi eliminat
tr: İlk satır, yapay olarak yerleştirilmiş bir boş satırdır ve silinemez
uk: Першим рядком є порожній рядок, який додано спеціально і який не можна вилучати

source: Proxied data model reports the modifications as accepted, yet did not emit the corresponding "row-inserted", "row-updated" or "row-removed" signal. This is a bug of the %s's implementation (please report a bug).
ca: El model de dades en servidor intermediari informa que les modificacions són acceptades, però no ha emès el senyal «row-inserted», «row-updated» o «row-removed» corresponent. Aquest és un error de la implementació del %s (informeu de l'error).
ro: Modelul de date proximizat raportează modificările ca fiind acceptate, dar nu a emis semnalul corespunzător „row-inserted”, „row-updated” sau „row-removed”. Acesta este un defect al implementării lui %s (raportați defectul).
tr: Vekalet edilmiş veri modeli, değişiklikleri kabul edildi olarak bildirir, "row-inserted", "row-updated" veya "row-removed" sinyallerini henüz yaymadı. Bu bir %s gerçekleme hatasıdır (lütfen bir hata kaydı açınız)
uk: Проксі-модель даних повідомляє про прийнятність змін, але не надсилає відповідних сигналів «row-inserted», «row-updated» або «row-removed». Це вада реалізації %s (будь ласка, повідомте розробникам про ваду).

source: Proxied data model reports the modifications as accepted, yet did not emit the corresponding "row-inserted", "row-updated" or "row-removed" signal. This may be a bug of the %s's implementation (please report a bug).
ca: El model de dades en servidor intermediari informa que les modificacions són acceptades, però no ha emès el senyal «row-inserted», «row-updated» o «row-removed» corresponent. Aquest pot ser un error de la implementació del %s (informeu de l'error).
ro: Modelul de date proximizat raportează modificările ca fiind acceptate, dar nu a emis semnalul corespunzător „row-inserted”, „row-updated” sau „row-removed”. Acesta poate fi un defect al implementării lui %s (raportați defectul).
tr: Vekalet edilmiş veri modeli, değişiklikleri kabul edildi olarak bildirir, "row-inserted", "row-updated" veya "row-removed" sinyallerini henüz yaymadı. Bu bir %s gerçekleme hatası olabilir (lütfen bir hata kaydı açınız)
uk: Проксі-модель даних повідомляє про прийнятність змін, але не надсилає відповідних сигналів «row-inserted», «row-updated» або «row-removed». Це може бути вада реалізації %s (будь ласка, повідомте розробникам про ваду).

source: Error in filter expression: %s
ca: S'ha produït un error a l'expressió del filtre: %s
ro: Eroare în expresia de filtru: %s
tr: Süzgeç ifadesinde hata: %s
uk: Помилка у виразі для фільтрування: %s

source: Error in filter expression
ca: S'ha produït un error en l'expressió del filtre
ro: Eroare în expresia de filtru
tr: Süzgeç ifadesinde hata
uk: Помилка у виразі для фільтрування

source: Incorrect filter expression
ca: L'expressió del filtre no és correcta
ro: Expresie de filtru incorectă
tr: Yanlış süzgeç ifadesi
uk: Помилковий вираз для фільтрування

source: The first row is an empty row artificially prepended and cannot be altered
ca: La primera fila és una fila buida anteposada artificialment i no pot modificar-se
ro: Primul rând este un rând gol prefixat artificial și nu poate fi schimbat
tr: İlk satır, yapay olarak başa eklenmiş boş bir satır ve değiştirilmiş olamaz
uk: Першим рядком є порожній рядок, який додано спеціально і який не можна змінювати

source: Wrong value type: expected '%s' and got '%s'
ca: El tipus de valor és incorrecte: s'esperava «%s» i s'ha obtingut «%s»
ro: Tip de valoare incorect: s-a așteptat „%s” dar s-a obținut „%s”
tr: Yanlış değer türü: beklenen '%s' ve alınan '%s'
uk: Помилковий тип значення: мало бути «%s», маємо «%s»

source: Trying to change read-only column: %d
ca: S'està intentant canviar la columna de només lectura: %d
ro: Se încearcă să se modifice coloana protejată la scriere: %d
tr: Salt okunur sütun değiştirilmeye çalışılıyor: %d
uk: Спроба внести зміни до придатного лише до читання стовпчика: %d

source: Value type mismatch %s instead of %s
ca: El tipus de valor %s no coincideix amb %s
ro: Nepotrivire a tipului de valoare %s în loc de %s
tr: %s değer türü eşleşmiyor, %s yerine
uk: Невідповідність типів значень — %s замість %s

source: INTERNAL implementation error: unknown number of columns in GdaPStmt, set number of columns before using with GdaDataSelect
ca: Error d'implementació intern: nombre desconegut de columnes en GdaPStmt. Establiu el nombre de columnes abans de la utilització amb GdaDataSelect
ro: Eroare internă de implementare: numărul de coloane în GdaPStmt este necunoscut, stabiliți numărul de coloane înainte de a folosi GdaDataSelect
tr: İÇ uygulama hatası: GdaPStmt'deki bilinmeyen sütun sayısı, GdaDataSelect ile kullanmadan önce sütun sayısını ayarla
uk: Внутрішня помилка реалізації: невідома кількість стовпчиків у GdaPStmt, встановіть кількість стовпчиків до використання з GdaDataSelect

source: Incorrect SQL expression, only one modification statement is accepted
ca: Expressió SQL incorrecta, només s'accepta una sentència de modificació
ro: Expresie SQL incorectă, numai o instrucțiune de modificare este acceptată
tr: Yanlış SQL ifadesi, yalnızca bir değişiklik ifadesi kabul edilir
uk: Помилковий вираз SQL, прийнято лише одну інструкцію з внесення змін

source: Internal error: the "prepared-stmt" property has not been set
ca: Error intern: no s'ha establert la propietat «prepared-stmt»
ro: Eroare internă: proprietatea „prepared-stmt” nu a fost stabilită
tr: İç hata: "prepared-stmt" özelliği ayarlanmamış
uk: Внутрішня помилка: властивість «prepared-stmt» не було встановлено

source: Can't get the prepared statement's actual statement
ca: No es pot obtenir la declaració preparada de la declaració real
ro: Nu se poate obține comanda actuală a comenzii pregătite
tr: Hazırlanmış ifadenin gerçek ifadesi alınamıyor
uk: Не вдалося отримати справжню інструкцію з приготованої інструкції

source: Unsupported type of SELECT statement
ca: Tipus de declaració SELECT no suportada
ro: Tip nesuportat de comandă SELECT
tr: SELECT ifadesinin desteklenmeyen türü
uk: Непідтримуваний тип інструкції SELECT

source: INSERT statement must contain values to insert
ca: La declaració INSERT necessita valors a inserir
ro: Comanda INSERT trebuie să conțină valorile de inserat
tr: INSERT ifadesi eklenecek değerler içermelidir
uk: Інструкція INSERT має містити значення для вставлення

source: INSERT statement must insert only one row
ca: La declaració INSERT ha d'inserir només una fila
ro: Comanda INSERT trebuie să introducă numai un rând
tr: INSERT ifadesi yalnızca bir satır eklemelidir
uk: Інструкція INSERT має вставляти лише один рядок

source: DELETE statement must have a WHERE part
ca: La declaració DELETE ha de contenir una condició WHERE
ro: Comanda DELETE trebuie să dețină o parte WHERE
tr: DELETE ifadesinin bir WHERE kısmı olmalıdır
uk: Інструкція DELETE має містити частину WHERE

source: UPDATE statement must have a WHERE part
ca: La declaració UPDATE ha de contenir una condició WHERE
ro: Comanda UPDATE trebuie să dețină o parte WHERE
tr: UPDATE ifadesinin bir WHERE kısmı olmalıdır
uk: Інструкція UPDATE має містити частину WHERE

source: Modification statement uses an unknown '%s' parameter
ca: La modificació de la declaració fa servir un paràmetre «%s» desconegut
ro: Comanda de modificare utilizează un parametru necunoscut „%s”
tr: Değişiklik ifadesi, bilinmeyen bir '%s' parametresi kullanıyor
uk: Інструкція з внесення змін використовує невідомий параметр «%s»

source: Modification statement's '%s' parameter is a %s when it should be a %s
ca: La modificació del paràmetre «%s» de la declaració és un %s quan hauria de ser un %s
ro: Parametrul %s al comenzii de modificare este un %s când ar trebui să fie un %s
tr: Değişiklik ifadesinin '%s' parametresi bir %s, %s olması gerektiğinde
uk: Параметр «%s» інструкція із внесення змін має значення %s, але він повинен мати значення %s

source: Modification statement must be an INSERT, UPDATE or DELETE statement
ca: La declaració de modificació ha de ser una declaració INSERT, UPDATE o DELETE
ro: Comanda de modificare trebuie să fie o comandă INSERT, UPDATE, sau DELETE
tr: Değişiklik ifadesi, INSERT, UPDATE, veya DELETE ifadelerinden birine sahip olmalıdır
uk: Інструкцією із внесення змін має бути інструкція INSERT, UPDATE або DELETE

source: No connection to use
ca: No hi ha cap connexió a utilitzar
ro: Nicio conexiune de utilizat
tr: Kullanılacak bağlantı yok
uk: Немає з'єднання для використання

source: Invalid unique row condition (only equal operators are allowed)
ca: Condició de fila única no vàlida (només es permeten operadors d'igual)
ro: Condiție de rând unică nevalidă (numai operatorii egal sunt admiși)
tr: Geçersiz eşsiz satır durumu (yalnızca eşit operatörlere izin verilir)
uk: Некоректна умова унікальності рядка (можна використовувати лише оператори рівності)

source: Unique row condition has already been specified
ca: Ja s'ha especificat una condició única de fila
ro: Condiția de rând unic a fost deja specificată
tr: Eşsiz satır durumu zaten belirtilmiş
uk: Умову унікальності рядка вже було вказано

source: No table to select from in SELECT statement
ca: No hi ha taula per a seleccionar en la declaració SELECT
ro: Nicio tabelă de selectat din comanda SELECT
tr: SELECT ifadesi ile seçilecek bir tablo yok
uk: У інструкції SELECT немає таблиці для вибору

source: SELECT statement uses more than one table to select from
ca: La declaració SELECT involucra més d'una taula o expressió des de la qual seleccionar
ro: Comanda SELECT utilizează mai mult de o tabelă din care să selecteze
tr: SELECT ifadesi bir yerden seçmek için birden fazla tablo kullanır
uk: Інструкція SELECT використовує декілька таблиць для вибору

source: Data model does only support random access
ca: El model de dades només admet l'accés aleatori
ro: Modelul de date suportă doar accesul aleator
tr: Veri modeli yalnızca rastgeler erişimi destekliyor
uk: У моделі даних передбачено підтримку лише випадкового доступу
