Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Data sources...
ca: Font de dades...
ro: Surse de date...
tr: Veri kaynakları...
uk: Джерела даних…

source: Could not execute the Database access control center
ca: No s'ha pogut executar el centre de control d'accés a la Base de dades
ro: Nu s-a putut executa centrul de control pentru accesul la baza de date
tr: Veri tabanı erişim denetim merkezi yürütülemedi
uk: Не вдалося запустити центр керування доступом до бази даних

source: Data to display
ca: dades a mostrar
ro: Date de afișat
tr: Gösterilecek veri
uk: Дані для показу

source: Can't append row to data model: %s
ca: No s'ha pogut afegir la fila al model de dades: %s
ro: Nu se poate adăuga rândul la modelul de date: %s
tr: Veri modeline satır eklenemiyor: %s
uk: Не вдалося дописати рядок до моделі даних: %s

source: Pointer to an XML layout specification (as an xmlNodePtr to a <gdaui_grid> node)
ca: Punter a una especificació de distribució de dades XML (com un xmlNodePtr cap a un node <gdaui_grid>)
ro: Indicator la o specificație de aranjament XML (ca un xmlNodePtr pentru un nod <gdaui_grid>)
tr: XML düzen tanımlamasına işaretçi (xmlNodePtr olarak <gdaui_grid> düğümü)
uk: Вказівник на специфікацію компонування XML (як xmlNodePtr на вузол <gdaui_grid>)

source: Info cell visible
ca: Cel·la d’informació visible
ro: Celula cu informații vizibilă
tr: Bilgi hücresi görünür
uk: Видимість інформаційних комірок

source: Can't be NULL
ca: No pot ser NULL
ro: Nu poate fi NULL
tr: NULL olamaz
uk: Не може бути NULL

source: No title
ca: Sense títol
ro: Fără titlu
tr: Başlık yok
uk: Без заголовка

source: Shown columns
ca: Columnes mostrades
ro: Afișează coloane
tr: Gösterilen sütunlar
uk: Показані стовпчики

source: _Copy
ca: _Copia
tr: _Kopyala
uk: _Копіювати

source: Select _All
ca: Selecciona-ho _tot
ro: Selecte_ază tot
tr: _Tümünü Seç
uk: Позначити _все

source: _Clear Selection
ca: _Neteja la selecció
ro: _Curăță selecție
tr: _Seçimi Temizle
uk: О_чистити позначене

source: Show Column _Titles
ca: Mostra els _títols de les columnes
ro: Afișează _titlurile coloanei
tr: Sütun _Başlıklarını Göster
uk: Показувати за_головки стовпчиків

source: Save _As
ca: _Anomena i desa
ro: Salvează c_a
tr: _Farklı Kaydet
uk: Зберегти _як

source: Saving Data
ca: S'estan desant les dades
ro: Se salvează datele
tr: Veri Kaydetme
uk: Збереження даних

source: Saving data to a file
ca: Desant les dades en un fitxer
ro: Se salvează datele într-un fișier
tr: Veriyi bir dosyaya kaydetme
uk: Збереження даних до файла

source: The data will be exported to the selected file.
ca: Les dades s'exportaran al fitxer seleccionat.
ro: Datele vor fi exportate în fișierul selectat.
tr: Veri, seçili dosyaya aktarılacak.
uk: Дані буде експортовано до вибраного файла.

source: File name
ca: Nom del fitxer
ro: Nume de fișier
tr: Dosya adı
uk: Назва файла

source: Details
ca: Detalls
ro: Detalii
tr: Ayrıntılar
uk: Подробиці

source: File type:
ca: Tipus de fitxer:
ro: Tip de fișier:
tr: Dosya türü:
uk: Тип файла:

source: Tab-delimited
ca: Delimitat per tabuladors
ro: Delimitat de tab
tr: Sekmeye ayrılmış
uk: Відокремлення табуляціями

source: Comma-delimited
ca: Delimitat per comes
ro: Delimitat de virgulă
tr: Virgüle ayrılmış
uk: Відокремлення комами

source: Data to save:
ca: Dades a desar:
ro: Date de salvat:
tr: Kaydedilecek veri:
uk: Дані для збереження:

source: All data (without any local modification)
ca: Totes les dades (sense modificacions locals)
ro: Toate datele (fără nicio modificare locală)
tr: Tüm veri (herhangi bir yerel değişim olmadı)
uk: Усі дані (без будь-якої локальної модифікації)

source: Only displayed data
ca: Només les dades mostrades
ro: Doar datele afișate
tr: Yalnızca gösterilmiş veri
uk: Лише показані дані

source: Only selected data
ca: Només les dades seleccionades
ro: Doar datele selectate
tr: Yalnızca seçili veri
uk: Лише позначені дані

source: Other options
ca: Altres opcions
ro: Alte opțiuni
tr: Diğer seçenekler
uk: Інші параметри

source: Empty string when NULL?
ca: Cadena buida quan sigui NULL?
ro: Se eliberează șirul când este NULL?
tr: NULL olduğunda karakter dizisini boşalt?
uk: Порожній рядок, якщо NULL?

source: Export NULL values as an empty "" string
ca: Exporta els valors NULL com una cadena buida «»
ro: Exportă valorile NULL ca șiruri ””” libere
tr: NULL değerlerini boş "" karakter dizisi olarak dışarı aktar
uk: Експортувати значення NULL як порожній рядок ""

source: Invalid data as NULL?
ca: Dades no vàlides com a NUL?
ro: Date nevalide ca NULL?
tr: NULL olarak geçersiz veri?
uk: Некоректні дані як NULL?

source: Don't export invalid data, but export a NULL value instead
ca: No exportar dades no vàlides, però exportar un valor NULL en el seu lloc
ro: Nu exporta date nevalide, dar exportă în schimb o valoare NULL
tr: Geçersiz veriy dışarı aktarma, ancak yerine NULL kullan
uk: Не експортувати некоректні дані, замість них експортувати значення NULL

source: Field names on first row?
ca: Noms de camp a la primera fila?
ro: Câmpuri de nume pe primul rând?
tr: İlk satırda alan adları?
uk: Назви полів у першому рядку?

source: Add a row at beginning with columns names
ca: Afegir una fila al principi amb els noms de les columnes
ro: Adaugă un rând la început cu numele coloanelor
tr: Sütun adlarıyla, başlangıça bir satır ekle
uk: Додавати на початку рядок із назвами стовпчиків

source: Could not save file %s
ca: No s'ha pogut desar el fitxer %s
ro: Nu s-a putut salva fișierul %s
tr: %s dosyası kaydedilemedi
uk: Не вдалося зберегти файл %s

source: You must specify a file name
ca: Heu d’especificar el nom del fitxer
ro: Trebuie să specificați un nume de fișier
tr: Bir dosya adı belirtmelisiniz
uk: Вам слід вказати назву файла

source: Got empty file while converting the data
ca: El fitxer està buit mentre es converteixen les dades
ro: S-a obținut un fișier liber în timpul conversiei datelor
tr: Veri dönüştürülürken boş dosya alındı
uk: При перетворенні даних отримано порожній файл

source: File '%s' already exists. Do you want to overwrite it?
ca: El fitxer «%s» ja existeix. El voleu sobreescriure?
ro: Fișierul „%s” există deja. Doriți să îl suprascrieți?
tr: '%s' dosyası zaten var. Üzerine yazmak istiyor musunuz?
uk: Файл «%s» вже існує. Бажаєте переписати його?

source: If you choose yes, the contents will be lost.
ca: Si trieu sí, es perdran els continguts.
ro: Dacă alegeți da, conținuturile se vor pierde.
tr: Evet seçerseniz, tüm içerik kaybolacak.
uk: Якщо ви виберете варіант «так», дані буде втрачено.

source: The '%s' attribute should be a G_TYPE_STRING value
ca: L'atribut «%s» hauria de ser un valor G_TYPE_STRING
ro: Atributul „%s” ar trebui să fie o valoare G_TYPE_STRING
tr: '%s' özniteliği, G_TYPE_STRING değeri olmalıdır
uk: Атрибутом «%s» має бути значення G_TYPE_STRING

source: """= Title level 1 = == Title level 2 == """= Title level 1 = == Title level 2 == """For beautifiers we have **bold** and //italic//. There is also __underline__, --strike-- and ``monospaced``. """ For beautifiers we have **bold** and //italic//. There is also __underline__, --strike-- and ``monospaced``. """- This is a list of items - Just use hyphens - And starting space for indenting """- This is a list of items - Just use hyphens - And starting space for indenting Raw areas are enclosed inside three doublequotes and no markup is interpreted
ca: """= Títol de nivell 1 = == Títol de nivell 2 == """= Títol de nivell 1 = == Títol de nivell 2 == """Per a embellir tenim la **negreta** i la //italic//. També hi ha el __subratllat__, --ratllat-- i ``monoespaiat``. """ """Per a embellir tenim la **negreta** i la //itàlica//. També hi ha el __subratllat__, --ratllat-- i ``monoespaiat``. """- Això és una llista d'elements - Simplement utilitza els guions - I espaiat inicial per al sagnat """- Això és una llista d'elements - Simplement utilitza els guions - I espaiat inicial per al sagnat Les àrees en brut es delimiten dins de cometes dobles i no s'interpreta cap marcat
ro: ”””= Nivel de titlu 1 = == Nivel de titlu 2 == ”””= Nivel de titlu 1 = == Nivel de titlu 2 == ”””Pentru estetică avem **aldin** și //cursiv//. Există de asemenea și __subilniat__, --tăiat-- și ``monospațiat``. ””” Pentru estetică avem **aldin** și //cursiv//. Există de asemenea __subliniat__, --tăiat-- și ``monospațiat``. ”””- Aceasta este o listă cu elemente - Folosiți doar cratime - Și spațiu de început pentru indentare ”””- Aceasta este o listă cu elemente - Folosiți doar cratime - Și spațiu de început pentru indentare Zonele sunt închise între trei ghilimele și nu se interpretează nicio marcare
tr: """= Düzey 1 başlık = == Düzey 2 başlık == """= Düzey 1 başlık = == Düzey 2 başlık == """Güzelleştirici olarak **kalın** ve //yatık// var. Ek olarak __altı çizili__, --üstü çizili-- ve ``tekli boşluk``. """ Güzelleştirici olarak **kalın** ve //yatık// var. Ek olarak __altı çizili__, --üstü çizili-- ve ``tekli boşluk``. """- Bu bir madde listesi - Yalnızca tire kullanın - Girinti için bir boşlukla başlatın """- Bu bir madde listesi - Yalnızca tire kullanın - Girinti için de bir boşlukla başlatın Ham alanlar üçlü çift tırnak içine alınır ve biçimlemeler yorumlanmaz

source: _Bold
ca: Ne_greta
ro: Îngr_oșat
tr: _Kalın
uk: _Напівжирний

source: Bold text
ca: Text en negreta
ro: Text îngroșat
tr: Kalın metin
uk: Текст напівжирним

source: _Italic
ca: Curs_iva
ro: Încl_inat
tr: _Eğik
uk: _Курсив

source: Italic text
ca: Text en cursiva
ro: Text înclinat
tr: Yatık metin
uk: Текст курсивом

source: _Underline
ca: S_ubratlla
ro: S_ubliniat
tr: _Altı çizili
uk: _Підкреслений

source: Underline text
ca: Text subratllat
ro: Text subliniat
tr: Altı çizili metin
uk: Підкреслити текст

source: _Strike through
ca: _Ratllar
ro: _Tăiat
tr: _Üstü Çizili
uk: За_креслити

source: Strike through text
ca: _Ratllar el text
ro: Text tăiat
tr: Üstü çizili metin
uk: Закреслити текст

source: _Syntax help
ca: Ajuda de _sintaxi
ro: Ajutor de _sintaxă
tr: _Sözdizimi yardımı
uk: Довідка щодо с_интаксису

source: Show syntax help
ca: Mostra l'ajuda de sintaxi
ro: Afișează ajutorul de sintaxă
tr: Sözdizimi yardımını göster
uk: Показати довідку щодо синтаксису

source: _Add image
ca: _Afegir imatge
ro: _Adaugă imagine
tr: Resmi _sona ekle
uk: _Додати зображення

source: Insert image
ca: Inserir imatge
ro: Inserează imagine
tr: Resmi _araya ekle
uk: Вставити зображення

source: _Normal text
ca: _Text normal
ro: Text _normal
tr: _Normal metin
uk: Зви_чайний текст

source: Reset to normal text
ca: Restablir a text normal
ro: Restabilește la text normal
tr: Normal metne sıfırla
uk: Скинути параметри до звичайного тексту

source: Don't display a specific background for the text
ca: No mostrar un fons específic per al text
ro: Nu afișa un fundal specific pentru text
tr: Metin için özel bir arkaplan gösterme
uk: Не показувати специфічне тло для тексту

source: Display raw markup text instead of formatted text
ca: Mostrar un marcat en brut per al text en lloc del text formatat
ro: Afișează textul de marcare brut în schimbul textului formatat
tr: Biçimlendirilmiş veri yerine ham veriyi göster
uk: Показати простий текст розмітки замість форматованого тексту

source: The buffer which is displayed
ca: La memòria intermèdia que es mostra
ro: Amortizorul care este afișat
tr: Görüntülenecek tampon
uk: Буфер, який показано

source: Determines if the contents appears in a scrolled window
ca: Determina si els continguts apareixen en una finestra amb barres de desplaçament
ro: Determină dacă conținutul apare într-o fereastră cu derulare
tr: Verinin kaydırılan pencerede görünmesini belirler
uk: Визначає, чи буде показано дані у вікні з гортанням

source: Reset font size
ca: Restablir la mida de la lletra
ro: Restabilește dimensiunea fontului
tr: Yazı tipi boyutunu sıfırla
uk: Скинути розмір шрифту

source: Decrease font size (zoom out)
ca: Disminuir la mida de la lletra (zoom out)
ro: Micșorează dimensiunea fontului (micșorare)
tr: Yazı tipi boyutunu küçült (uzaklaştır)
uk: Зменшити розмір шрифту (зменшити)

source: Increase font size (zoom in)
ca: Augmentar la mida de la lletra (zoom in)
ro: Mărește dimensiunea fontului (mărire)
tr: Yazı tipi boyutunu arttır (yakınlaştır)
uk: Збільшити розмір шрифту (збільшити)

source: Show source markup
ca: Mostra l'origen del marcat
ro: Afișează marcarea sursei
tr: Kaynak biçimlemesini göster
uk: Показати розмітку джерела

source: The specification of the operation to implement
ca: L'especificació de l'operació per a implementar
ro: Specificația operației de implementat
tr: Uygulanacak olan işlemin tanımlaması
uk: Специфікація операції для реалізації

source: Request section header to be hidden if there is only one section
ca: Sol·licitar que la capçalera de la secció s'oculti si només hi ha una secció
ro: Cere ca antelul de secțiune să fie ascuns dacă există numai o secțiune
tr: Yalnızca tek bir bölüm varsa, istek bölüm başlğı gizli olsun
uk: Вимагати приховування заголовка розділу, якщо існує лише один розділ

source: Mal formed Server Operation. No Node at path: '%s'
ca: Operació de servidor mal formulat. No hi ha node al camí: «%s»
ro: Operație de server malformată. Nu există vreun nod la calea: „%s”
tr: Hatalı Biçimlendirilmiş Sunucu İşlemi. Yolda Düğüm yok: '%s'
uk: Помилкове форматування дій з сервером. Немає вузла з таким шляхом: «%s»

source: Add a new field
ca: Afegir un camp nou
ro: Adaugă un câmp nou
tr: Yeni bir alan ekle
uk: Додати нове поле

source: Remove selected field
ca: Treure el camp seleccionat
ro: Elimină câmpul selectat
tr: Seçili alanı kaldır
uk: Вилучити позначене поле

source: Add
ca: Afegeix
ro: Adaugă
tr: Ekle
uk: Додати

source: Server operation specification
ca: Especificació del funcionament del servidor
ro: Specificație de operație a serverului
tr: Sunucu işlemleri tanımlaması
uk: Специфікація операцій із сервером

source: No group exists for Set
ca: No existeix cap grup per a Conjunt
ro: Nu există grupuri pentru Set
tr: 'Set' için hiçbir grup yok
uk: Немає групи для набору

source: GdaTree to use
ca: GdaTree que s'ha d'utilitzar
ro: GdaTree de utilizat
tr: Kullanılacak GdaTree
uk: GdaTree для використання

source: Unknown column number %d
ca: Nombre de columna %d desconegut
ro: Număr de coloană %d necunoscut
tr: Bilinmeyen sütun sayısı %d
uk: Невідомий номер стовпчика %d

source: Type mismatch: expected a value of type %s and got of type %s
ca: El tipus no coincideix: s'esperava un valor de tipus %s i es va obtenir un tipus %s
ro: Nepotrivire de tip: s-a așteptat o valoare de tipul %s și s-a obținut o valoare de tipul %s
tr: Tür eşleşmiyor: beklenen değer tipi %s, gelen değer tipi %s
uk: Невідповідність типів: мало бути значення типу %s, а отримано значення типу %s

source: Can't set authentification string: no authentication is needed
ca: No es pot configurar la cadena d'autentificació: no cal autenticació
ro: Nu se poate stabili șirul de autentificare: autentificarea nu este necesară
tr: Kimlik doğrulama dizgesi ayarlanamıyor: kimlik doğrulama gerekli değil
uk: Не вдалося встановити рядок розпізнавання: немає потреби у розпізнаванні

source: Unknown provider '%s'
ca: Proveïdor «%s» desconegut
ro: Furnizor necunoscut „%s”
tr: Bilinmeyen sağlayıcı '%s'
uk: Невідомий постачальник «%s»

source: Provider '%s' does not report the required parameters for DSN
ca: El proveïdor «%s» no ha informat dels paràmetres necessaris per DSN
ro: Furnizorul „%s” nu raportează parametrii necesari pentru DSN
tr: Sağlayıcı '%s' DSN için gerekli parametreleri bildirmiyor
uk: Надавач даних «%s» не повідомляє потрібні параметри для DSN

source: Unset
ca: Desassigna
ro: Destabilit
tr: Kaldır
uk: Зняти

source: Set to default value
ca: Assignar el valor per defecte
ro: Stabilește la valoarea implicită
tr: Öntanımlı değere ayarla
uk: Встановити типове значення

source: Reset to original value
ca: Assignar el valor original
ro: Restabilește la valoarea originală
tr: Özgün değere sıfırla
uk: Скинути до початкового значення

source: Current modified data is invalid
ca: Les dades actuals modificades no són vàlides
ro: Datele curente modificate nu sunt valide
tr: Şu anki değiştirilmiş veri geçersiz
uk: Поточні змінені дані є некоректними

source: You may now choose to correct it, or to discard the modifications. What do you want to do?
ca: Ara pot triar entre corregir, o descartar les modificacions. Què vol fer?
ro: Acum aveți posibilitatea să alegeți corectarea acestora, sau renunțarea la modificări. Ce doriți să faceți?
tr: Şuanda onu düzeltebilirsiniz ya da değişiklikleri iptal edebilirsiniz. Ne yapmak istiyorusunuz?
uk: Тепер ви можете виправити її або відкинути внесені зміни. Що ви хочете зробити?

source: please correct it and try again, or discard the modifications.
ca: si us plau corregeix-ho i intenta-ho de nou, o descarta les modificacions.
ro: corectați și încercați din nou, sau renunțați la modificări.
tr: lütfen onu düzeltin ve tekrar deneyin ya da değişiklikleri iptal edin.
uk: будь ласка, внесіть виправлення або відкиньте внесені зміни.

source: Part of the current modified data was invalid
ca: Una part de les dades modificades actuals no eren vàlides
ro: O parte din datele modificate curent nu a fost validă
tr: Şu anki değiştirilmiş verinin parçası geçersiz
uk: Частина поточних змінених даних була некоректною

source: As no transaction was used, only a part of the valid data has been written, and the remaining modification have been discarded.
ca: Com que no es va utilitzar cap transacció, només una part de les dades vàlides s'han escrit i les restants s'han descartat.
ro: Cum nu a fost folosită nicio tranzacție, numai o parte din datele valide au fost scrise, și modificările rămase au fost ignorate.
tr: Hiç çoklu işlem kullanılmadığında ya da geçerli verinin bir bölümü yazılmış ise, kalan değişiklikler iptal edilir.
uk: Оскільки не було використано жодних операцій, було записано лише частину коректних даних, а решту змін було відкинуто.

source: Discard modified data
ca: Descartar les dades modificades
ro: Renunță la datele modificate
tr: Değiştirilmiş veriyi iptal et
uk: Відкинути змінені дані

source: Correct data first
ca: Corregir dades primer
ro: Corectează datele mai întâi
tr: Öncelikle veriyi düzelt
uk: Спочатку виправити дані

source: Ok
ca: D'acord
tr: Tamam
uk: Гаразд

source: Database file
ca: Fitxer de la base de dades
ro: Fișierul bazei de date
tr: Veri tabanı dosyası
uk: Файл бази даних

source: Berkeley DB database filename to be used
ca: Nom de fitxer de base de dades Berkeley DB per a ser utilitzat
ro: Nume de fișier de utilizat pentru baza de date Berkeley DB
tr: Berkeley DB veri tabanı dosya adı
uk: Назва файла бази даних Berkeley DB, яку слід використати

source: Directory
ca: Directori
ro: Dosar
tr: Dizin
uk: Каталог

source: Directory where the database file is stored
ca: Directori on s'emmagatzema el fitxer de base de dades
ro: Dosarul în care fișierul bazei de date este stocat
tr: Veri tabanı dosyasının tutulacağı dizin
uk: Каталог, у якому зберігається файл бази даних

source: Database name
ca: Nom de la base de dades
ro: Numele bazei de date
tr: Veri tabanı adı
uk: Назва бази даних

source: Name of the database in the database file to be used
ca: Nom de la base de dades en el fitxer de base de dades que es farà servir
ro: Numele bazei de date în fișierul bazei de date de utilizat
tr: Kullanılan veri tabanı dosyasındaki veri tabanı adı
uk: Назва бази даних у файлі бази даних

source: The DB_NAME parameter is not defined in the connection string.
ca: El paràmetre DB_NAME no està definit a la cadena de connexió.
ro: Parametrul DB_NAME nu este definit în șirul de conexiune.
tr: DB_NAME parametresi bağlantı dizgesinde tanımlı değil.
uk: У рядку з'єднання не визначено параметр DB_NAME.

source: An error occurred while accessing the BDB database
ca: S'ha produït un error en accedir a la base de dades de BDB
ro: A apărut o eroare în timpul accesării bazei de date BDB
tr: BDB veri tabanına erişilirken bir hata oluştu
uk: Під час спроби доступу до бази даних BDB сталася помилка

source: Could not add BDB data model to connection: %s
ca: No s'ha pogut afegir el model de dades de BDB a la connexió:: %s
ro: Nu se poate adăuga modelul de date BDB la conexiunea: %s
tr: Bağlantı için BDB veri modeli eklenemedi: %s
uk: Не вдалося додати модель даних BDB до з'єднання: %s

source: Provider for Berkeley databases
ca: Proveïdor per a bases de dades Berkeley
ro: Furnizor pentru bazele de date Berkeley
tr: Berkeley veritabanları için sağlayıcı
uk: Постачальник для баз даних Berkeley

source: Column's description
ca: Descripció de la columna
ro: Descrierea coloanei
tr: Sütunun açıklaması
uk: Опис ствопчика

source: Table
ca: Taula
ro: Tabelă
tr: Tablo
uk: Таблиця

source: Table's name
ca: Nom de la taula
ro: Numele tabelei
tr: Tablo adı
uk: Назва таблиці

source: Field name
ca: Nom del camp
ro: Nume de câmp
tr: Alan adı
uk: Назва поля

source: Data type
ca: Tipus de dada
ro: Tip de date
tr: Veri türü
uk: Тип даних

source: Size
ca: Mida
ro: Dimensiune
tr: Boyut
uk: Розмір

source: Scale
ca: Escala
ro: Scală
tr: Ölçekle
uk: Масштаб

source: Not NULL
ca: No NULL
ro: Nu este NULL
tr: NULL değil
uk: Не NULL

source: Default value, mandatory if column is NOT NULL
ca: Valor per defecte, obligatori si la columna és NOT NULL
ro: Valoare implicită, obligatorie în cazul în care coloana este NOT NULL
tr: Öntanımlı değer, sütun NOT NULL değilse zorunludur
uk: Типове значення, обов'язкове, якщо стовпчик є NOT NULL

source: Check
ca: Marca
ro: Verifică
tr: Denetle
uk: Перевірити

source: Check constraint
ca: Comproveu la restricció
ro: Verifică restricția
tr: Kısıtları denetle
uk: Перевірити обмеження

source: Database's description
ca: Descripció de la base de dades
ro: Descrierea bazei de date
tr: Veri tabanı açıklaması
uk: Опис бази даних

source: The name of a database to create
ca: El nom d'una base de dades a crear
ro: Numele unei baze de date de creat
tr: Oluşturulacak veri tabanının adı
uk: Назва бази даних, яку слід створити

source: Directory where the database file will be
ca: Directori on estarà el fitxer de base de dades
ro: Dosar în care se va afla fișierul bazei de date
tr: Veri tabanı dosyasının duracağı dizin
uk: Каталог, у якому буде зберігатися файл бази даних

source: Index description
ca: Descripció de l'índex
ro: Descriere indice
tr: İndeks açıklaması
uk: Опис покажчика

source: Type
ca: Tipus
ro: Tip
tr: Tür
uk: Тип

source: Name
ca: Nom
ro: Nume
tr: Ad
uk: Назва

source: Index name
ca: Nom de l'índex
ro: Nume indice
tr: İndeks adı
uk: Назва покажчика

source: On table
ca: En la taula
ro: Pe tabelă
tr: Tabloda
uk: У таблиці

source: Only if it does not yet exist
ca: Només si encara no existeix
ro: Doar dacă nu există încă
tr: Yalnızca henüz yoksa
uk: Навіть якщо його ще не існує

source: Create index only if it does not yet exist
ca: Creeu índex només si encara no existeix
ro: Creează indice numai dacă nu există încă
tr: Yalnızca henüz yoksa oluştur
uk: Створити покажчик, лише якщо його не існує

source: Indexed field(s)
ca: Camp(s) indexat
ro: Câmpuri indexate
tr: İndekslenmiş alan(lar)
uk: Індексовані поля

source: Indexed field or expression
ca: Camp o expressió indexada
ro: Câmp sau expresie indexată
tr: İndekslenmiş alan ya da ifade
uk: індексоване поле або вираз

source: Compare method
ca: Mètode de comparació
ro: Metodă de comparare
tr: Yöntemi karşılaştır
uk: Метод порівняння

source: Collation name (BINARY|NOCASE)
ca: Nom de la intercalació (BINARI | NOCASE)
ro: Numele tipului de ordonare alfabetică (BINARY|NOCASE)
tr: Karşılaştırma adı (BINARY|NOCASE)
uk: Назва злиття (BINARY|NOCASE)

source: Sort type
ca: Tipus d'ordenació
ro: Sortează tip
tr: Sıralama türü
uk: Тип сортування

source: Table's description
ca: Descripció de la taula
ro: Descrierea tabelei
tr: Tablonun tanımlaması
uk: Опис таблиці

source: Temporary table
ca: Taula temporal
ro: Tabelă temporară
tr: Geçici tablo
uk: Тимчасова таблиця
