Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Counter for auto incremented fields is incremented by this value + 1 (DEFAULT: 0)
ca: El comptador de camps incrementats automàticament s'incrementa en aquest valor + 1 (per defecte: 0)
ro: Contorul pentru câmpurile incrementate automat este incrementat cu această valoare + 1(DEFAULT: 0)
tr: Otomatik arttırımlı alanlar için sayaç bu değeri +1 arttırır (ÖNTANIMLI: 0)
uk: Лічильник для полів із автоматичним збільшенням буде збільшено на це значення + 1 (ТИПОВЕ ЗНАЧЕННЯ: 0)

source: Average row length
ca: Longitud de fila mitjana
ro: Lungime medie a rândului
tr: Ortalama satır uzunluğu
uk: Середня довжина рядка

source: An approximation of the average row length for your table
ca: Una aproximació de la longitud de fila mitjana de la taula
ro: O aproximație a lungimii medii a rândului pentru tabela dumneavoastră
tr: Tablonuz için ortalama satır sayısının tahmini
uk: Наближення середньої довжини рядка для вашої таблиці

source: Checksum
ca: Suma de verificació
ro: Sumă de control
tr: Sağlama Toplamı
uk: Контрольна сума

source: Min rows
ca: Mínim de files
ro: Rânduri minime
tr: Asgari satırlar
uk: Мін. рядків

source: Max rows
ca: Màxim de files
ro: Rânduri maxime
tr: Azami satır
uk: Макс. рядків

source: Pack keys
ca: Empaqueta les claus
ro: Împachetează chei
tr: Paket tuşları
uk: Пакування ключів

source: Delay key write
ca: Retarda l'escriptura de la clau
ro: Întârzie scrierea cheii
tr: Yazma tuşu gecikmesi
uk: Затримка запису ключів

source: Row format
ca: Format de la fila
ro: Formatul rândului
tr: Satır biçimi
uk: Формат рядка

source: Union
ca: Unió
ro: Unire
tr: Birleşim
uk: Об'єднання

source: tbl_name[,tbl_name]...: only with MERGE engine
ca: tbl_name[,tbl_name]...: només amb motor MERGE
ro: tbl_name[,tbl_name]...: doar cu motorul MERGE
tr: tbl_adı[,tbl_adı]...: yalnızca MERGE motoru ile
uk: назва_таблиці[,назва_таблиці]...: лише з рушієм MERGE

source: Insert method
ca: Mètode d'inserció
ro: Metodă de inserare
tr: Ekleme yöntemi
uk: Метод вставлення

source: FIRST, LAST or NO: only with MERGE engine
ca: FIRST, LAST o NO: només amb motor MERGE
ro: FIRST, LAST or NO: doar cu motorul MERGE
tr: FIRST, LAST ya da NO. yalnızca MERGE motoru ile
uk: FIRST, LAST або NO: лише з рушієм MERGE

source: Data directory
ca: Directori de dades
ro: Director de date
tr: Veri dizini
uk: Каталог даних

source: Index directory
ca: Directori d'índex
ro: Dosar index
tr: İndeks dizini
uk: Каталог покажчика

source: Match simple
ca: Coincidència senzilla
ro: Potrivește simplu
tr: Basit eşleştirme
uk: Проста відповідність

source: Match partial
ca: Coincidència parcial
ro: Potrivește parțial
tr: Kısmi eşleştirme
uk: Часткова відповідність

source: Match full
ca: Coincidència completa
ro: Potrivește complet
tr: Tam eşleştirme
uk: Повна відповідність

source: No action
ca: Cap acció
ro: Fără acțiune
tr: Eylem yok
uk: Нічого не робити

source: Restrict
ca: Restringeix
ro: Restricționează
tr: Kısıtla
uk: Обмежити

source: Cascade
ca: Cascada
ro: Cascadă
tr: Kadameli
uk: Уступами

source: Set to NULL
ca: Estableix a NULL
ro: Stabilește la NULL
tr: NULL ayarla
uk: Встановити NULL

source: Don't pack keys
ca: No empaquetis les claus
ro: Nu împacheta cheile
tr: Anahtarları paketleme
uk: Не пакувати ключі

source: Only pack long CHAR/VARCHAR columns
ca: Només empaquetar columnes CHAR / VARCHAR
ro: Împachetează doar coloanele lungi CHAR/VARCHAR
tr: Yalnızca uzun CHAR/VARCHAR sütunlarını paketle
uk: Пакувати лише довгі стовпчики CHAR/VARCHAR

source: MyISAM (default)
ca: MyISAM (per defecte)
ro: MyISAM (implicit)
tr: MyISAM (öntanımlı)
uk: MyISAM (типовий)

source: Archive
ca: Arxiu
ro: Arhivă
tr: Arşivle
uk: Архів

source: Comma Separated Value (CSV)
ca: Valor separat per comes (CSV)
ro: Valoare separată prin virgulă (CSV)
tr: Virgülle Ayrılmış Değerler (CSV)
uk: Відокремлені комами значення (CSV)

source: Example
ca: Exemple
ro: Exemplu
tr: Örnek
uk: Приклад

source: Federated
ca: Federat
ro: Extern
tr: Birleşmiş
uk: Інтегрований

source: In Memory (MEMORY/HEAP)
ca: En memòria (MEMORY/HEAP)
ro: În memorie (MEMORY/HEAP)
tr: Bellekte (MEMORY/HEAP)
uk: У пам'яті (MEMORY/HEAP)

source: Merge
ca: Combina
ro: Îmbină
tr: Birleştir
uk: Об'єднати

source: Clustered, fault-tolerant, memory-based
ca: En clúster, tolerant a fallades, basat en memòria
ro: Organizat în mănunchiuri, deține toleranță la defecțiuni, se bazează pe memorie
tr: Kümelenmiş, hataya dayanıklı, bellek tabanlı
uk: Із поділом на кластери, стійкістю до помилок, на основі пам'яті

source: Dynamic
ca: Dinàmic
ro: Dinamic
tr: Dinamik
uk: Динамічний

source: Fixed
ca: Fix
ro: Fixat
tr: Sabit
uk: Фіксований

source: Compressed
ca: Comprimit
ro: Compresat
tr: Sıkıştırılmış
uk: Стиснений

source: Redundant
tr: Artık
uk: Із резервуванням

source: Compact
ca: Compacta
tr: Sıkıştır
uk: Компактний

source: Replace if it already exists
ca: Substituïu-lo si ja existeix
ro: Înlocuiește dacă există deja
tr: Zaten varsa yer değiştir
uk: Замінити, якщо вже існує

source: Replace view definition if it already exists
ca: Substituïu la definició de la vista si ja existeix
ro: Înlocuiește definiția vizualizării dacă există deja
tr: Zaten varsa görünüm tanımı değiştir
uk: Замінити визначення перегляду, якщо воно вже існує

source: Columns' names
ca: Noms de les columnes
ro: Numele coloanei
tr: Sütunları adları
uk: Назви стовпчиків

source: column name
ca: Nom de la columna
ro: numele coloanei
tr: sütun adı
uk: назва стовпчика

source: Only if existing
ca: Només si existeix
ro: Doar dacă există
tr: Yalnızca varsa
uk: Лише якщо існує

source: Drop database only if it exists
ca: Descarta la base de dades només si existeix
ro: Renunță la baza de date doar dacă există
tr: Yalnızca varsa veri tabanını sil
uk: Відкинути базу даних, лише якщо вона існує

source: Drop table only if it is temporary
ca: Eliminar la taula només si és temporal
ro: Renunță la tabela doar dacă este temporară
tr: Yalnızca tablo geçici ise sil
uk: Відкинути базу даних, лише якщо вона тимчасова

source: References
ca: Referències
ro: Referințe
tr: Referanslar
uk: Посилання

source: What to do with references
ca: Què fer amb les referències
ro: Ce să faci cu referințele
tr: Referanslar ile yapılacaklar
uk: Що робити із посиланнями

source: Automatically drop objects that depend on the table (CASCADE)
ca: Deixa automàticament objectes que depenen de la taula (CASCADE)
ro: Renunță automat la obiectele care depind de tabela (CASCADE)
tr: Tabloya bağlı olarak nesneleri kendiliğinden sil (CASCADE)
uk: Автоматично відкидати об'єкти, які залежать від цієї таблиці (CASCADE)

source: Refuse to drop the table if any objects depend on it (RESTRICT)
ca: Rebutjar l'esborrat de la taula si qualsevol objecte depèn d'ella (RESTRICT)
ro: Refuză să renunți la tabelă dacă există obiecte care depind de aceasta (RESTRICT)
tr: Eğer herhangi bi nesne ona (RESTRICT) bağlı ise tablo silmeyi reddet
uk: Відмовляти у викиданні таблиці, якщо від неї залежить якісь об'єкти (RESTRICT)

source: Compress
ca: Comprimeix
ro: Compresează
tr: Sıkıştır
uk: Стиснути

source: Use compression protocol
ca: Utilitzeu el protocol de compressió
ro: Utilizează protocolul de compresie
tr: Sıkıştırma iletişim kuralı kullan
uk: Використати протокол зі стисканням

source: Interactive
tr: Etkileşimli
uk: Інтерактивний

source: The client's session wait timeout set to the value of the session interactive_timeout variable.
tr: İstemcinin oturum bekleme zaman aşımı,oturumun interactive_timeout değişken değerine ayarlandı.
uk: Час очікування на сеанс клієнта встановлено за значенням змінної interactive_timeout.

source: Table to ALTER
tr: ALTER edilecek tablo
uk: Таблиця для ALTER

source: Column
ca: Columna
ro: Coloană
tr: Sütun
uk: Стовпчик

source: Column to rename
tr: Yeniden adlandırılacak sütun
uk: Стовпчик для перейменування

source: New column name
tr: Yeni sütun adı
uk: Нова назва стовпчика

source: Could not fetch next row
ca: No s'ha pogut obtenir la fila següent
ro: Nu s-a putut aduce rândul următor
tr: Sonraki satır çekilemedi
uk: Не вдалося отримати наступний рядок

source: Could not get a description handle
ca: No s'ha pogut obtenir una descripció del gestor
ro: Nu s-a putut obține un operator de descriere
tr: Tanımlama işlemi alınamadı
uk: Не вдалося отримати обробник опису

source: Could not get parameter handle
ca: No s'ha pogut obtenir el paràmetre del gestor
ro: Nu s-a putut obține operatorul parametrului
tr: Parametre işlemi alınamadı
uk: Не вдалося отримати обробник параметрів

source: Could not get attribute
ca: No s'ha pogut obtenir l'atribut
ro: Nu s-a putut obține atributul
tr: Öznitelik alınamadı
uk: Не вдалося отримати атрибут

source: NO DESCRIPTION
ca: SENSE DESCRIPCIÓ
tr: AÇIKLAMA YOK
uk: НЕМАЄ ОПИСУ

source: Invalid Oracle handle
ca: El gestor d'Oracle no és vàlid
ro: Operator Oracle nevalid
tr: Geçersiz Oracle işleme
uk: Неправильний логічний номер Oracle

source: Could not allocate Lob locator
ca: No s'ha pogut reservar el localitzador Lob
ro: Nu s-a putut aloca descriptorul Lob
tr: Lob konumlandırıcı ayrılamadı
uk: Не вдалося розмістити у пам'яті локатор Lob

source: Could not copy Lob locator
ca: No s'ha pogut copiar el localitzador Lob
ro: Nu s-a putut copia descriptorul Lob
tr: Lob konumlandırıcısı kopyalanamadı
uk: Не вдалося скопіювати локатор Lob

source: Dataholder type is unknown.
ca: El tipus de titular de dades és desconegut.
ro: Tipul de date păstrat nu este cunoscut.
tr: Veri tutucu türü bilinmiyor.
uk: Невідомий тип утримувача даних.

source: Dataholder type is unknown. Report this as a bug.
ca: El tipus de titular de dades és desconegut. Informeu-lo com a error.
ro: Tipul de date păstrat nu este cunoscut. Raportați acest defect.
tr: Veri tutucu türü bilinmiyor. Bunu hata olarak bildir.
uk: Невідомий тип утримувача даних. Повідомте розробникам про цю ваду.

source: PostgreSQL binary representation
ca: Representació binària de PostgreSQL
ro: Reprezentare binară PostgreSQL
tr: PostgreSQL ikili gösterimi
uk: Двійкове представлення PostgreSQL

source: Insufficient memory to convert binary buffer to string
ca: Memòria insuficient per a convertir la memòria intermèdia binària en cadena
ro: Memorie insuficientă pentru a converti amortizorul binar la șir
tr: İkili tamponu karakter dizisine çevirmek için yetersiz bellek
uk: Недостатньо пам'яті для перетворення двійкового буфера на рядок

source: Insufficient memory to convert string to binary buffer
ca: Memòria insuficient per a convertir la cadena en memòria intermèdia binària
ro: Memorie insuficientă pentru a converti șirul la amortizor binar
tr: Karakter dizisini ikili tampona çevirmek için yetersiz bellek
uk: Недостатньо пам'яті для перетворення рядка на двійковий буфер

source: Could not determine the default date format
ca: No s'ha pogut determinar el format de data predeterminat
ro: Nu s-a putut determina formatul de dată implicit
tr: Öntanımlı tarih biçimi belirlenemedi
uk: Не вдалося визначити формат типової дати

source: The connection string must contain a DB_NAME value
ca: La cadena de connexió ha de contenir un valor de DB_NAME
ro: Șirul de conexiune trebuie să conțină o valoare DB_NAME
tr: Bağlantı dizgesi DB_NAME değerini içermek zorundadır
uk: Рядок з'єднання має містити значення DB_NAME

source: The connection string format has changed: replace DATABASE with DB_NAME and the same contents
ca: El format de cadena de connexió ha canviat: substituïu DATABASE per DB_NAME i el mateix contingut
ro: Formatul șirului de conexiune s-a modificat: înlocuiți DATABASE cu DB_NAME și aceleași conținuturi
tr: Bağlantı dizgesi biçimi değişti: DATABASE ile DB_NAME değişmeli ve aynı içerikler
uk: Формат рядка з'єднання було змінено: замініть DATABASE на DB_NAME із тим самим вмістом

source: Could not set search_path to %s
ca: No s'ha pogut establir search_path a %s
ro: Nu s-a putut stabili search_path la %s
tr: search_path (arama yolu) %s olarak ayarlanamadı
uk: Не вдалося встановити для search_path значення %s

source: Search path %s is invalid
ca: El camí de cerca %s no és vàlid
ro: Calea de căutat %s nu este validă
tr: Arama yolu %s geçersiz
uk: Шлях пошуку %s є некоректним

source: Transactions are not supported in read uncommitted isolation level
ca: Les transaccions no són compatibles amb el nivell d’aïllament de lectura no efectuada
ro: Tranzacțiile nu sunt suportate în citirea nivelului de izolare necomis
tr: Toplu işlemler, okuma kaydedilmemiş yalıtım düzeyinde desteklenmiyor
uk: Транзакції не підтримуються на рівні ізоляції незафіксованого читання

source: Transactions are not supported in repeatable read isolation level
ca: Les transaccions no són compatibles amb el nivell d’aïllament de lectura repetible
ro: Tranzacțiile nu sunt suportate în citirea repetabilă a nivelului de izolare
tr: Toplu işlemler, tekrarlanabilir okuma yalıtım düzeyinde desteklenmiyor
uk: Транзакції не підтримуються на рівні ізоляції повторювального читання

source: Internal error
ca: Error intern
ro: Eroare internă
tr: İç hata
uk: Внутрішня помилка

source: Wrong savepoint name '%s'
ca: Nom del punt de recuperació incorrecte «%s»
ro: Nume de punct de salvare „%s” incorect
tr: Yanlış kaydetme noktası adı '%s'
uk: Помилкова назва точки збереження, «%s»

source: Cannot start transaction
ca: No es pot iniciar la transacció
ro: Nu se poate porni tranzacția
tr: Toplu işlem başlatılamıyor
uk: Не вдалося розпочати транзакцію

source: Could not set the XA transaction ID parameter
ca: No s'ha pogut establir el paràmetre d'ID de transacció XA
ro: Nu s-a putut configura parametrul ID-ului de tranzacție XA
tr: XA toplu işlemi ID parametresi kaydedilemedi
uk: Не вдалося встановити параметр ідентифікатор операції XA

source: Number of rows chunks read since the object creation
ca: Nombre de trossos de la fila llegits des de la creació l'objecte
ro: Numărul de bucăți de rânduri citite de la crearea obiectului
tr: Nesne oluşana kadarki satır parçası okuma sayısı
uk: Кількість прочитаних фрагментів рядків з моменту створення об'єкта

source: Invalid date format '%s'
ca: El format de data no és vàlid «%s»
ro: Format de dată nevalid „%s”
tr: Geçersiz tarih biçimi '%s'
uk: Некоректний формат дати «%s»

source: Invalid timestamp value '%s'
ca: El valor de marca de temps «%s» no és vàlid
ro: Valoare de marcaj de timp nevalid „%s”
tr: Geçersiz zaman damgası değeri '%s'
uk: Некоректне значення часової позначки «%s»

source: Invalid binary string representation '%s ...'
ca: La representació de cadena binària no és vàlida '%s ...'
ro: Reprezentare binară nevalidă a șirului „%s ...”
tr: Geçersiz ikili dizge gösterimi '%s ...'
uk: Некоректне представлення двійкового рядка «%s ...»

source: Provider for PostgreSQL databases
ca: Proveïdor per a bases de dades PostgreSQL
ro: Furnizor pentru bazele de date PostgreSQL
tr: PostgreSQL veritabanları için sağlayıcı
uk: Постачальник для баз даних PostgreSQL

source: Ignore descendants
ca: Ignora els descendents
ro: Ignoră descendenți
tr: Türemişleri yoksay
uk: Ігнорувати похідні

source: Don't add the column to descendants of the table
ca: No afegir la columna als descendents de la taula
ro: Nu adăugați coloana la descendenții tabelei
tr: Tablodan türemişlere sütun eklenemez
uk: Не додавати стовпчик до похідних таблиці

source: Only if it exist
ca: Només si hi existeix
ro: Doar dacă există
tr: Sadece varsa
uk: Лише якщо він існує

source: Add column only if it exist
ca: Afegir la columna només si existeix
tr: Yalnızca varsa sütun ekle
uk: Додати стовпчик, лише якщо він існує

source: Add column only if it does not yet exist
ca: Afegir la columna només si encara no existeix
tr: Yalnızca henüz yoksa, sütun ekle
uk: Додати стовпчик, навіть якщо його ще не існує

source: Host on which the database server is running (for servers running on unix domain sockets, enter the socket's path (usually /tmp), or leave this field empty)
ca: Amfitrió en el qual s'està executant la base de dades (per als servidors executant-sota sòcols de domini UNIX, introduïu el camí del sòcol (generalment /tmp), o deixeu aquest camp buit)
ro: Gazda la care serverul bazei de date rulează (pentru serverele care rulează pe socketuri din domeniul unix, introduceți calea (de obicei /tmp), sau lăsați acest câmp liber)
tr: Veri tabanı sunucusunun koştuğu makine (unix alan soketinde koşan sunucular için, soketin yolunu girin (genellikle /tmp) ya da bu alanı boş bırakın)
uk: Вузол, на якому запущено сервер бази даних (для серверів, що працюють на сокетах домену UNIX, введіть шлях до сокета (зазвичай /tmp), можна не заповнювати)

source: Database server port (for servers running on unix domain sockets, enter the socket's file name extension (usually 5432), or leave this field empty)
ca: El port de servidor de la base de dades (per als servidors executant-sota sòcols de domini UNIX, introduïu l'extensió del nom del sòcol (generalment 5432), o deixeu aquest camp buit)
ro: Portul pentru serverul bazei de date (pentru serverele care rulează pe socketuri din domeniul unix, introduceți extensia fișierului de socket (de obicei 5432), sau lăsați acest câmp liber)
tr: Veri tabanı sunucusu bağlantı noktası (unix alan soketinde koşan sunucular için, soketin dosya adı uzantısını girin (genellikle 5432 ya da bu alanı boş bırakın)
uk: Порт сервера бази даних (для серверів, що працюють на сокетах домену UNIX, введіть суфікс назви файла сокета (зазвичай 5432), можна не заповнювати)

source: Extra connection options
ca: Opcions addicionals de la connexió
ro: Opțiunile conexiunii suplimentare
tr: Fazladan bağlantı seçenekleri
uk: Додаткові параметри з'єднання

source: Whether to require SSL or not when connecting
ca: Si es requereix SSL en connectar
ro: Dacă necesită sau nu SSL atunci când se conectează
tr: Bağlantı yapılırken SSL gerekip gerekmediği
uk: Використовувати SSL чи не використовувати

source: Owner
ca: Propietari
ro: Posesor
tr: Sahibi
uk: Власник

source: The name of the database user who will own the new database
ca: El nom de l'usuari de la base de dades que serà propietari de la base de dades nova
ro: Numele utilizatorului de bază de date care va deține baza de date nouă
tr: Yeni veri tabanın sahibinin veri tabanı kullanıcısının adı
uk: Ім'я користувача-власника нової бази даних

source: Template
ca: Plantilla
ro: Șablon
tr: Şablon
uk: Шаблон

source: The name of the template from which to create the new database
ca: El nom de la plantilla des de la qual es crearà la base de dades nova
ro: Numele șablonului de la care se creează baza de date nouă
tr: Yeni veri tabanının oluşturulacağı şablonun adı
uk: Назва шаблона, на основі якого слід створити базу даних

source: The name of the tablespace that will be associated with the new database
ca: El nom de l'espai de taules que s'associarà a la nova base de dades
ro: Numele spațiului de tabelă care va fi asociat cu baza de date nouă
tr: Yeni veri tabanı ile ilişkilendirilecek tablespace adı
uk: Назва простору таблиць, який буде пов'язано із новою базою даних

source: Japanese EUC
ca: EUC japonès
ro: EUC Japoneză
tr: Japonca EUC
uk: Японське (EUC)

source: Chinese EUC
ca: EUC xinès
ro: EUC Chineză
tr: Çince EUC
uk: Китайське (EUC)

source: Korean EUC
ca: EUC coreà
ro: EUC Coreeană
tr: Korece EUC
uk: Корейське (EUC)

source: Korean EUC (Hangle base)
ca: EUC coreà (base Hangle)
ro: EUC Coreeană (bază Hangle)
tr: Korece EUC (Hangle base)
uk: Корейське (EUC, основа хангиля)

source: Taiwan EUC
ca: EUC taiwanès
ro: EUC Taiwan
tr: Tayvanca EUC
uk: Тайванське (EUC)

source: ISO 8859-1/ECMA 94 (Latin alphabet no.1)
ca: ISO 8859-1/ECMA 94 (alfabet llatí núm. 1)
ro: ISO 8859-1/ECMA 94 (Alfabetul latin nr.1)
tr: ISO 8859-1/ECMA 94 (Latin alfebesi no.1)
uk: ISO 8859-1/ECMA 94 (латинська абетка №1)

source: ISO 8859-1/ECMA 94 (Latin alphabet no.2)
ca: ISO 8859-1/ECMA 94 (alfabet llatí núm. 2)
ro: ISO 8859-1/ECMA 94 (Alfabetul latin nr.2)
tr: ISO 8859-1/ECMA 94 (Latin alfebesi no.2)
uk: ISO 8859-1/ECMA 94 (латинська абетка №2)

source: ISO 8859-1/ECMA 94 (Latin alphabet no.3)
ca: ISO 8859-1/ECMA 94 (alfabet llatí núm. 3)
ro: ISO 8859-1/ECMA 94 (Alfabetul latin nr.3)
tr: ISO 8859-1/ECMA 94 (Latin alfebesi no.3)
uk: ISO 8859-1/ECMA 94 (латинська абетка №3)

source: ISO 8859-1/ECMA 94 (Latin alphabet no.4)
ca: ISO 8859-1/ECMA 94 (alfabet llatí núm. 4)
ro: ISO 8859-1/ECMA 94 (Alfabetul latin nr.4)
tr: ISO 8859-1/ECMA 94 (Latin alfebesi no.4)
uk: ISO 8859-1/ECMA 94 (латинська абетка №4)

source: ISO 8859-1/ECMA 94 (Latin alphabet no.5)
ca: ISO 8859-1/ECMA 94 (alfabet llatí núm. 5)
ro: ISO 8859-1/ECMA 94 (Alfabetul latin nr.5)
tr: ISO 8859-1/ECMA 94 (Latin alfebesi no.5)
uk: ISO 8859-1/ECMA 94 (латинська абетка №5)

source: ISO 8859-1/ECMA 94 (Latin alphabet no.6)
ca: ISO 8859-1/ECMA 94 (alfabet llatí núm. 6)
ro: ISO 8859-1/ECMA 94 (Alfabetul latin nr.6)
tr: ISO 8859-1/ECMA 94 (Latin alfebesi no.6)
uk: ISO 8859-1/ECMA 94 (латинська абетка №6)

source: ISO 8859-1/ECMA 94 (Latin alphabet no.7)
ca: ISO 8859-1/ECMA 94 (alfabet llatí núm. 7)
ro: ISO 8859-1/ECMA 94 (Alfabetul latin nr.7)
tr: ISO 8859-1/ECMA 94 (Latin alfabesi no.7)
uk: ISO 8859-1/ECMA 94 (латинська абетка №7)

source: ISO 8859-1/ECMA 94 (Latin alphabet no.8)
ca: ISO 8859-1/ECMA 94 (alfabet llatí núm. 8)
ro: ISO 8859-1/ECMA 94 (Alfabetul latin nr.8)
tr: ISO 8859-1/ECMA 94 (Latin alfabesi no.8)
uk: ISO 8859-1/ECMA 94 (латинська абетка №8)

source: ISO 8859-1/ECMA 94 (Latin alphabet no.9)
ca: ISO 8859-1/ECMA 94 (alfabet llatí núm. 9)
ro: ISO 8859-1/ECMA 94 (Alfabetul latin nr. 9)
tr: ISO 8859-1/ECMA 94 (Latin alfabesi no.9)
uk: ISO 8859-1/ECMA 94 (латинська абетка №9)

source: ISO 8859-1/ECMA 94 (Latin alphabet no.10)
ca: ISO 8859-1/ECMA 94 (alfabet llatí núm. 10)
ro: ISO 8859-1/ECMA 94 (Alfabetul latin nr.10)
tr: ISO 8859-1/ECMA 94 (Latin alfabesi no.10)
uk: ISO 8859-1/ECMA 94 (латинська абетка №10)

source: ISO 8859-5/ECMA 113 (Latin/Cyrillic)
ca: ISO 8859-5/ECMA 113 (llatí/ciríl·lic)
ro: ISO 8859-5/ECMA 113 (Latină/Chirilic)
tr: ISO 8859-5/ECMA 113 (Latin/Kiril)
uk: ISO 8859-5/ECMA 113 (латиниця/кирилиця)

source: ISO 8859-6/ECMA 114 (Latin/Arabic)
ca: ISO 8859-6/ECMA 114 (llatí/àrab)
ro: ISO 8859-6/ECMA 114 (Latină/Arabă)
tr: ISO 8859-6/ECMA 114 (Latin/Arapça)
uk: ISO 8859-6/ECMA 114 (латиниця/арабська)

source: ISO 8859-7/ECMA 118 (Latin/Greek)
ca: ISO 8859-7/ECMA 118 (llatí/grec)
ro: ISO 8859-7/ECMA 118 (Latină/Greacă)
tr: ISO 8859-7/ECMA 118 (Latin/Yunanca)
uk: ISO 8859-7/ECMA 118 (латиниця/грецька)

source: ISO 8859-8/ECMA 121 (Latin/Hebrew)
ca: ISO 8859-8/ECMA 121 (llatí/hebreu)
ro: ISO 8859-8/ECMA 121 (Latină/Ebraică)
tr: ISO 8859-8/ECMA 121 (Latin/İbranice)
uk: ISO 8859-8/ECMA 121 (латиниця/іврит)

source: Windows CP874 (Thai)
ro: Windows CP874 (Thailandez)
tr: Windows CP874 (Tai)
uk: Windows CP874 (тайське)

source: Windows CP1256 (Arabic)
ca: Windows CP1256 (àrab)
tr: Windows CP1256 (Arapça)
uk: Windows CP1256 (арабське)

source: TCVN-5712/Windows CP1258 (Vietnamese)
ca: TCVN-5712/Windows CP1258 (vietnamita)
ro: TCVN-5712/Windows CP1258 (Vietnameză)
tr: TCVN-5712/Windows CP1258 (Vietnamca)
uk: TCVN-5712/Windows CP1258 (в'єтнамське)

source: Constraint expression for a partial index
ca: Expressió de restricció per a un índex parcial
ro: Expresie de restricție pentru un indice parțial
tr: Kısmi index için kısıtlama ifadesi
uk: Вираз обмеження для часткового покажчика

source: Collation name
ca: Nom de la intercalació
tr: Karşılaştırma adı
uk: Назва злиття

source: Role's definition
ca: Definició del rol
ro: Definiția rolului
tr: Rol tanımı
uk: Визначення ролі

source: Role's name
ca: Nom del rol
ro: Numele rolului
tr: Rolün adı
uk: Назва ролі

source: Role's password
ca: Contrasenya del rol
ro: Parola rolului
tr: Rolün parolası
uk: Пароль ролі

source: Encrypt password
ca: Xifra la contrasenya
ro: Criptează parola
tr: Şifrelenmiş parola
uk: Зашифрувати пароль
