Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: No object found
ca: No s'ha trobat cap objecte
ro: Niciun obiect găsit
tr: Nesne bulunamadı
uk: Не знайдено об'єкта

source: Nullable
ca: Que pot ser nul
ro: Poate fi null
tr: Null olabilir
uk: Можливе нульове значення

source: Extra
ro: Suplimentar
tr: Ekstra
uk: Додатково

source: List of columns for view '%s'
ca: Llista de columnes per a la vista «%s»
ro: Listă de coloane pentru vizualizarea „%s”
tr: '%s' görünümü için sütunları listele
uk: Список стовпчиків для перегляду «%s»

source: List of columns for table '%s'
ca: Llista de columnes per a la taula «%s»
ro: Listă de coloane pentru tabela „%s”
tr: '%s' tablosu için sütunları listele
uk: Список стовпчиків таблиці «%s»

source: yes
ca: sí
ro: da
tr: evet
uk: так

source: no
ro: nu
tr: hayır
uk: ні

source: Could not determine columns of view '%s'
ca: No s'ha pogut determinar les columnes de la vista «%s»
ro: Nu s-au putut determina coloanele vizualizării „%s”
tr: '%s' görünümünün sütunları belirlenemedi
uk: Не вдалося визначити стовпчики перегляду «%s»

source: Could not determine columns of table '%s'
ca: No s'ha pogut determinar les columnes de la taula «%s»
ro: Nu s-au putut determina coloane a tabelei „%s”
tr: '%s' görünümünün sütunları belirlenemedi
uk: Не вдалося визначити стовпчики таблиці «%s»

source: View definition: %s
ca: Definició de la vista: %s
ro: Definiția vizualizării: %s
tr: Görünüm tanımı: %s
uk: Визначення перегляду: %s

source: references %s
ca: fa referència a %s
ro: face referire la %s
tr: referanslar %s
uk: посилання %s

source: references %s.%s
ca: fa referència a %s.%s
ro: face referire la %s.%s
tr: referanslar %s.%s
uk: посилання %s.%s

source: Unknown output format: '%s', reset to default
ca: Format de sortida desconegut: «%s». S'ha restablert el valor predeterminat
ro: Format de ieșire necunoscut: „%s”, restabilește la implicit
tr: Bilinmeyen çıktı biçimi: '%s', öntanımlı değere sıfırla
uk: Невідомий формат виведення: «%s», повертаємося до типового

source: No option named '%s'
ca: No hi ha cap opció amb el nom «%s»
ro: Nicio opțiune cu numele „%s”
tr: '%s' olarak adlandırılmış bir seçenek yok
uk: Немає параметра із назвою «%s»

source: List of options
ca: Llista d’opcions
ro: Listă de opțiuni
tr: Seçeneklerin listesi
uk: Список параметрів

source: Current connection's information
ca: Informació de la connexió actual
tr: Geçerli bağlantının bilgisi
uk: Дані щодо поточного з'єднання

source: Could not get home directory: %s
ca: No s'ha pogut obtenir el directori d'inici: %s
ro: Nu s-a putut obține dosarul personal: %s
tr: Ev dizinine ulaşılamadı: %s
uk: Не вдалося отримати домашній каталог: %s

source: Working directory is now: %s
ca: El directori de treball actual és: %s
ro: Dosarul în care se lucrează este acum: %s
tr: Şu andaki iş çalışma dizini: %s
uk: Тепер робочим каталогом є цей каталог: %s

source: Could not change working directory to '%s': %s
ca: No s'ha pogut canviar el directori de treball a «%s»: %s
ro: Nu s-a putut modifica dosarul în care se lucrează la „%s”: %s
tr: Çalışma dizini '%s' olarak değiştirilemedi: %s
uk: Не вдалося змінити робочий каталог на «%s»: %s

source: DSN list
ca: Llista DSN
ro: Listă DSN
tr: DSN listesi
uk: Список DSN

source: Missing arguments
ca: Arguments perduts
ro: Lipsesc argumentele
tr: Değişkenler eksik
uk: Не вказано аргументів

source: Missing provider name
ca: Manca el nom del proveïdor
ro: Lipsește numele furnizorului
tr: Sağlayıcı adı eksik
uk: Не вказано назви постачальника

source: Missing DSN name
ca: Manca el nom del DSN
ro: Lipsește numele DSN
tr: DSN adı eksik
uk: Не вказано назви DSN

source: Getting database schema information, this may take some time...
ca: Per a obtenir informació sobre l'esquema de la base de dades, això pot trigar una mica...
ro: Se obțin informațiile pentru schema bazei de date, acest lucru poate să dureze ceva timp...
tr: Veri tabanı şema bilgisi getiriliyor, bu biraz zaman alabilir...
uk: Отримуємо відомості щодо структури бази даних, дія може бути досить тривалою…

source: error: %s
ro: eroare: %s
tr: hata: %s
uk: помилка: %s.

source: Done.
ca: Fet.
ro: Gata.
tr: Tamam.
uk: Виконано.

source: A connection named '%s' already exists
ca: Ja existeix una connexió anomenada «%s»
ro: O conexiune cu numele „%s” deja există
tr: '%s' adlı bağlantı zaten var
uk: З'єднання із назвою «%s» вже існує

source: No opened connection
ca: No s'ha obert cap connexió
ro: Nicio conexiune deschisă
tr: Açılmış bağlantı yok
uk: Немає відкритого з'єднання

source: DSN or connection string
ca: DSN o cadena de connexió
ro: DSN sau șir de conexiune
tr: DSN ya da bağlantı dizgesi
uk: DSN або рядок з'єднання

source: Missing required connection names
ca: Falten els noms de connexió obligatoris
ro: Lipsesc numele de conexiune necesare
tr: Gerekli bağlandı adları eksik
uk: Не вказано обов'язкові назви з'єднань

source: Connection name '%s' is invalid
ca: El nom de la connexió «%s» no és vàlid
ro: Conexiunea cu numele „%s” nu este validă
tr: Bağlantı adı '%s' geçersiz
uk: Назва з'єднання «%s» є некоректним

source: No connection or dataset named '%s' found
ca: No s'ha trobat cap connexió o conjunt de dades anomenat «%s»
ro: Nu s-a găsit o conexiune sau set de date cu numele „%s”
tr: '%s' olarak adlandırılmış bir bağlantı ya da ver kümesi bulunamadı
uk: Не знайдено з'єднання або набору даних із назвою «%s»

source: Connections were bound as:
ca: Les connexions estaven vinculades com a:
tr: Bağlantılar şöyle bağlandı:
uk: З'єднання прив'язано як:

source: %s in the '%s' namespace
ca: %s de l'espai de noms «%s»
ro: %s în spațiul de nume „%s”
tr: %s, '%s' ad alanı içinde
uk: %s у просторі назв «%s»

source: %s mapped to the %s table
ca: %s assenyalat a la taula %s
ro: %s cartografiat la tabelul %s
tr: %s eşleşiyor %s tablosu ile
uk: %s пов'язано із таблицею %s

source: No connection opened
ca: No s'ha obert cap connexió
ro: Nicio conexiune deschisă
tr: Bağlantı açılmadı
uk: Немає відкритого з'єднання

source: Could not write to temporary file '%s': %s
ca: No s'ha pogut escriure al fitxer temporal «%s»: %s
ro: Nu s-a putut scrie la fișierul temporar „%s”: %s
tr: '%s' geçici dosyasına yazılamadı: %s
uk: Не вдалося записати тимчасовий файл «%s»: %s

source: could not start editor '%s'
ca: no ha pogut iniciar l'editor «%s»
ro: nu s-a putut porni editorul „%s”
tr: '%s' düzenleyicisi başlatılamadı
uk: не вдалося запустити редактор «%s»

source: Could not start /bin/sh
ca: No s'ha pogut iniciar /bin/sh
ro: Nu s-a putut porni /bin/sh
tr: /bin/sh başlatılamadı
uk: Не вдалося запустити /bin/sh

source: Missing FILE to write to
ca: Falta FILE per a escriure-ho
ro: Lipsește FILE în care se scrie
tr: Yazılacak dosya eksik
uk: Не вказано ФАЙЛ, до якого слід виконати запис

source: Favorite name
ca: Nom del preferit
ro: Denumirea favoritului
tr: Favori adı
uk: Назва вибраного запису

source: Comments
ca: Comentaris
ro: Comentarii
tr: Yorumlar
uk: Коментарі

source: Missing query buffer name
ca: Manca el nom de la memòria intermèdia de consulta
ro: Lipsește numele amortizorului de interogare
tr: Sorgu tampon adı eksik
uk: Не вказано назви буфера запиту

source: Query buffer is empty
ca: La memòria intermèdia de consulta és buida
ro: Amortizorul de interogare este liber
tr: Sorgu tamponu boş
uk: Буфер запитів порожній

source: Could not find favorite
ca: No s'ha pogut trobar el preferit
ro: Nu s-a putut găsi favorit
tr: Favori bulunamadı
uk: Не вдалося знайти вибраний запис

source: No parameter named '%s' defined
ca: No s'ha definit cap paràmetre amb el nom «%s»
ro: Niciun parametru cu numele „%s” definit
tr: '%s' olarak adlandırlımış parametre yok
uk: Параметр із назвою «%s» не визначено

source: List of defined parameters
ca: Llista de paràmetres definits
ro: Listă de parametri definiți
tr: Tanımlanmış parametrelerin listesi
uk: Список визначених параметрів

source: dimensions (columns x rows)
ca: dimensions (columnes x files)
ro: dimensiuni (coloane x rânduri)
tr: boyutlar (sütun x satır)
uk: розмірності (стовпчики x рядки)

source: List of kept data
ca: Llista de dades desades
ro: Listă de date păstrate
tr: Tutulan verinin listesi
uk: Список збережених даних

source: Missing argument
ca: Argument perdut
ro: Lipsește un argument
tr: Değişken eksik
uk: Пропущено аргумент

source: Could not find dataset named '%s'
ca: No s'ha pogut trobar el conjunt de dades anomenat «%s»
ro: Nu s-a putut găsi setul de date cu numele „%s”
tr: '%s' olarak adlandırılmış veri kümesi bulunamadı
uk: Не вдалося знайти набір даних із назвою «%s»

source: Could not identify column '%s'
ca: No s'ha pogut identificar la columna «%s»
ro: Nu s-a putut identifica coloana „%s”
tr: '%s' sütunu tanımlanamadı
uk: Не вдалося ідентифікувати стовпчик «%s»

source: Unknown import format '%s'
ca: Format d'importació «%s» desconegut
ro: Format de importare „%s” necunoscut
tr: Bilinmeyen içeri aktarma biçimi '%s'
uk: Невідомий формат імпортування «%s»

source: Could not import file '%s'
ca: No s'ha pogut importar el fitxer «%s»
ro: Nu s-a putut importa fișierul „%s”
tr: '%s' dosyası içeri aktarılamadı
uk: Не вдалося імпортувати файл «%s»

source: Graph written to '%s'
ca: Gràfica escrita en «%s»
ro: Grafic scris la „%s”
tr: Grafik şuraya yazıldı: '%s'
uk: Графік записано до «%s»

source: Graph written to '%s' Use 'dot' (from the GraphViz package) to create a picture, for example: dot -Tpng -o graph.png %s Note: set the GDA_SQL_VIEWER_PNG or GDA_SQL_VIEWER_PDF environment variables to view the graph
ca: Gràfica escrita en «%s» Utilitza 'dot' (del paquet GraphViz) per a crear una imatge, per exemple: dot -Tpng -o graph.png %s Nota: activi les variables d'entorn GDA_SQL_VIEWER_PNG o GDA_SQL_VIEWER_PDF per a veure la gràfica
ro: Grafic scris la „%s” Utilizează „do” (din pachetul Grafviz) pentru a crea o imagine, de exemplu: dot -Tpng -o graph.png %s Notă: stabilește variabilele de mediu GDA_SQL_VIEWER_PNG sau GDA_SQL_VIEWER_PDF pentru a vizualiza graficul
tr: Grafik şuraya yazıldı: '%s' Bir resim oluşturmak için 'dot' komutunu kullanın (GraphViz paketi ile geliyor), örneğin: dot -Tpng -o graph.png %s Not: Grafiği görüntüleyebilmek için GDA_SQL_VIEWER_PNG ya da GDA_SQL_VIEWER_PDF çevre değişkenini ayarlayın
uk: Граф записано до «%s» Скористайтеся «dot» (з пакунка GraphViz) для створення зображення. Приклад: dot -Tpng -o graph.png %s Зауваження: встановіть змінну середовища GDA_SQL_VIEWER_PNG або GDA_SQL_VIEWER_PDF для перегляду графу

source: Could not start HTTPD server
ca: No s'ha pogut iniciar el servidor HTTPD
ro: Nu s-a putut porni serverul HTTPD
tr: HTTPD sunucusu başlatılamadı
uk: Не вдалося запустити сервер HTTPD

source: HTTPD server stopped
ca: El servidor HTTPD s'ha aturat
ro: Serverul HTTPD s-a oprit
tr: HTTPD sunucusu durdu
uk: Роботу сервера HTTPD зупинено

source: HTTPD server started
ca: S'ha iniciat el servidor HTTPD
ro: Serverul HTTPD a pornit
tr: HTTPD sunucusu başladı
uk: Роботу сервера HTTPD розпочато

source: Invalid port specification
ca: L'especificació del port no és vàlida
ro: Specificație de port nevalidă
tr: Geçersiz bağlantı noktası tanımlaması
uk: Некоректна специфікація порту

source: Wrong row condition
ca: Condició de fila incorrecta
ro: Condiție de rând incorectă
tr: Yanlış satır durumu
uk: Помилкова умова щодо рядків

source: No unique row identified
ca: No s'ha identificat una fila única
ro: Niciun rând unic identificat
tr: Eşsiz tanımlanmış satır yok
uk: Не визначено унікального рядка

source: Wrong number of arguments
ca: Nombre d'arguments incorrecte
ro: Număr incorect de argumente
tr: Yanlış sayıda değişken
uk: Помилкова кількість параметрів

source: Could not write file
ca: No s'ha pogut escriure el fitxer
ro: Nu s-a putut scrie fișierul
tr: Dosya yazılamadı
uk: Не вдалося записати файл

source: Missing data on which to operate
ca: Falten dades sobre les quals operar
ro: Lipsesc datele pe care să se opereze
tr: İşlem yapılacak veri eksik
uk: Не вказано даних, з якими слід виконати дії

source: Missing row fields specifications
ca: Falten les especificacions dels camps de fila
ro: Lipsesc specificațiile de câmpuri rând
tr: Satır alanı tanımlamaları eksik
uk: Не вказано специфікації полів рядка

source: Wrong SELECT argument
ca: Argument SELECT incorrecte
ro: Argumentul SELECT este incorect
tr: Yanlış SELECT değişkeni
uk: Помилковий аргумент SELECT

source: Wrong data field argument
ca: Argument del camp de dades incorrecte
ro: Argumentul câmpului de date este incorect
tr: Yanlış veri alanı değişkeni
uk: Помилковий аргумент поля даних

source: Missing foreign key declaration specification
ca: Manca l'especificació de declaració de clau externa
ro: Lipsește specificația declarației cheii străine
tr: Yabancı anahtar tanımlaması eksik
uk: Не вказано специфікації оголошення сторонніх ключів

source: Malformed foreign key declaration specification
ca: Especificació de declaració de clau externa incorrecta
ro: Specificația de declarație a cheii străine este greșită
tr: Kusurlu yabancı anahtar tanımlaması
uk: Помилкове форматування специфікації оголошення сторонніх ключів

source: Malformed table name specification '%s'
ca: Especificació de nom de taula incorrecta «%s»
ro: Specificația de nume de tabelă „%s” este greșită
tr: Kusurlu tablo adı tanımlaması '%s'
uk: Помилкове форматування специфікації назв таблиць «%s»

source: Missing foreign key name argument
ca: Falta l'argument el nom de la clau externa
ro: Lipsește argumentul numele cheii străine
tr: Yabancı anahtar adı değişkeni eksik
uk: Не вказано аргумент назви стороннього ключа

source: Connection is not an LDAP connection
ca: La connexió no és una connexió LDAP
ro: Conexiunea nu este de tip LDAP
tr: Bağlantı, bir LDAP bağlantısı değil
uk: З'єднання не є з'єднанням LDAP

source: Unknown search scope '%s'
ca: Àmbit de cerca «%s» desconegut
ro: Scop de căutare necunoscut „%s”
tr: Bilinmeyen arama alanı '%s'
uk: Невідомий діапазон пошуку «%s»

source: Missing filter which to operate
ca: Falta el filtre sobre el qual operar
ro: Lipsește filtrul cu care să se opereze
tr: İşlenecek süzgeç eksik
uk: Не вказано фільтр, з яким слід працювати

source: Missing current DN or new DN specification
ca: Falta el DN actual o la nova especificació DN
ro: Lipsesc specificațiile curente de DN sau noile specificații DN
tr: Geçerli DN ya da yeni DN tanımlaması eksik
uk: Не вказано поточної або нової специфікації DN

source: Missing DN of LDAP entry
ca: Falta el DNP de l'entrada LDAP
ro: Lipsește DN-ul intrării LDAP
tr: LDAP girdisinde DN eksik
uk: Не вказано DN запису LDAP

source: Missing operation to perform on LDAP entry's attributes
ca: Falta l'operació a realitzar sobre els atributs de l'entrada LDAP
ro: Lipsește operația de executat pe atributele intrării LDAP
tr: LDAP girdisinin özniteliklerinde yapılacak işlem eksik
uk: Не вказано дію, яку слід виконати над атрибутами запису LDAP

source: Unknown operation '%s' to perform on LDAP entry's attributes
ca: Operació «%s» a realitzar sobre els atributs de l'entrada LDAP desconeguda"
ro: Operație necunoscută „%s” pentru a executa atributele intrării LDAP
tr: LDAP girdilerinin özniteliklerinde uygulamak için '%s' bilinmeyen işlemi
uk: Невідома дія «%s», яку слід виконати над атрибутами запису LDAP

source: Wrong attribute value specification '%s'
ca: Especificació «%s» incorrecta del valor dels atributs
ro: Specificația valorii atributului „%s” este greșită
tr: '%s' yanlış öznitelik değeri tanımlaması
uk: Помилкова специфікація значення атрибута «%s»

source: Missing DN (Distinguished name) argument
ca: Falta l'argument DN (nom distintiu)
ro: Lipsește argumentul DN (Distinguished name)
tr: Eksik DN (Ayır edici ad) değişleni
uk: Не вказано аргументу DN (Розпізнаваної назви)

source: Unknown '%s' argument
ca: Argument «%s» desconegut
ro: Argument „%s” necunoscut
tr: Bilinmeyen '%s' değişkeni
uk: Невідомий аргумент «%s»

source: Could not find entry with DN '%s'
ca: No s'ha pogut trobar l'entrada amb DN «%s»
ro: Nu s-a putut găsi o intrare cu DN-ul „%s”
tr: '%s' DN ile bir girdi bulunamadı
uk: Не вдалося знайти запис із DN «%s»

source: Attribute
ca: Atribut
ro: Atribut
tr: Öznitelik
uk: Атрибут

source: Required?
ca: Necessari?
ro: Necesar?
tr: Gerekli mi?
uk: Обов'язковий?

source: LDAP entry's Attributes
ca: Atributs de l'entrada LDAP
ro: Atributele intrării LDAP
tr: LDAP girdisinin Öznitelikleri
uk: Атрибути запису LDAP

source: Installed providers list
ca: Llista de proveïdors instal·lats
ro: Lista cu furnizorii instalați
tr: Kurulu sağlayıcıların listesi
uk: Список встановлених постачальників

source: Could not find provider '%s'
ca: No s'ha pogut trobar el proveïdor «%s»
ro: Nu s-a putut găsi furnizorul „%s”
tr: '%s' sağlayıcısı bulunamadı
uk: Не вдалося знайти постачальника «%s»

source: Provider '%s' description
ca: Descripció del proveïdor «%s»
ro: Descrierea furnizorului „%s”
tr: '%s' sağlayıcısı tanımlaması
uk: Опис постачальника «%s»

source: Could not find data source '%s'
ca: No s'ha pogut trobar l'origen de les dades «%s»
ro: Nu s-a putut găsi sursa de date „%s”
tr: '%s' veri kaynağı bulunamadı
uk: Не вдалося знайти джерело даних «%s»

source: DSN '%s' description
ca: Descripció del DSN «%s»
ro: Descriere DSN „%s”
tr: '%s' DSN açıklaması
uk: Опис DSN «%s»

source: DSN name
ca: Nom del DSN
ro: Nume DSN
tr: DSN adı
uk: Назва DSN

source: System DSN?
ca: DSN del sistema
ro: DSN sistem?
tr: Sistem DSN?
uk: Системний DSN?

source: Yes
ca: Sí
ro: Da
tr: Evet
uk: Так

source: No
ro: Nu
tr: Hayır
uk: Ні

source: Last used
ca: Utilitzada per últim cop
ro: Ultima utilizare
tr: Son kullanılan
uk: Використано востаннє

source: Unknown criteria '%s'
ca: Criteris «%s» desconeguts
ro: Criteriu necunoscut „%s”
tr: Bilinmeyen kıstas '%s'
uk: Невідомі критерії «%s»

source: No home directory exists. No configuration directory is in use
ca: No hi ha cap directori d'inici. No hi ha cap directori de configuració en ús
tr: Ev dizini yok. Yapılandırma dizini kullanılmıyor
uk: Немає домашнього каталогу. Не використовується жоден каталог налаштувань

source: Was not possible to create configuration directory at: %s
ca: No s'ha pogut crear el directori de configuració a: %s
tr: Yapılandırma dizini oluşturmak mümkün değildi: %s
uk: Не вдалося створити каталог налаштувань тут: %s

source: Analysing database schema
ca: S'està analitzant l'esquema de la base de dades
ro: Se analizează schema bazei de date
tr: Veri tabanı şema analizi
uk: Аналізуємо схему бази даних

source: Error while fetching meta data from the connection: %s
ca: S'ha produït un error en obtenir les metadades des de la connexió: %s
ro: Eroare în timpul aducerii de date meta de la conexiunea: %s
tr: Bağlantıdan üst veri çekerken hata: %s
uk: Помилка під час отримання метаданих зі з'єднання: %s

source: File containing the meta data associated to the connection
ca: Fitxer que conté les metadades associades a la connexió
tr: Bağlantıyla ilişkili üst veri içeren dosya
uk: Файл, що містить метадані, пов'язані зі з'єднанням

source: Username for '%s':
ca: Nom d'usuari de «%s»:
ro: Nume de utilizator pentru „%s”:
tr: '%s' için kullanıcı adı:
uk: Ім'я користувача для «%s»:

source: No username for '%s'
ca: No hi ha cap nom d'usuari per a «%s»
ro: Fără nume de utilizator pentru „%s”
tr: '%s' için kullanıcı adı yok
uk: Немає імені користувача для «%s»

source: Password for '%s':
ca: Contrasenya de «%s»:
ro: Parolă pentru „%s”:
tr: '%s' için parola:
uk: Пароль до «%s»:

source: No password for '%s'
ca: No hi ha cap contrasenya per a «%s»
ro: Fără parolă pentru „%s”
tr: '%s' için parola yok
uk: Немає пароля до «%s»

source: Date format for this connection will be: %s, where YYYY is the year, MM the month and DD the day
ca: El format de data per a aquesta connexió serà: %s, on AAAA és l'any, MM el mes i DD el dia
tr: Bu bağlantı için tarih biçimi %s olmalıdır. YYYY yıl, MM ay ve DD günü temsil eder
uk: Форматом дати для цього з'єднання буде такий: %s, де YYYY є роком, MM — місяцем, а DD — днем

source: Format of the date used for the connection, where YYYY is the year, MM the month and DD the day
ca: El format de la data utilitzada per a la connexió, en què AAAA és l'any, MM el mes i DD el dia
tr: Bağlantı için kullanılan tarihin biçimi, YYYY yıl, MM ay ve DD günü temsil eder
uk: Формат дати, який буде використано для з'єднання, де YYYY — рік, MM — місяць і DD — день

source: Data source
ca: Font de dades
tr: Veri kaynağı
uk: Джерело даних

source: unnamed
ca: sense nom
ro: nedenumit
tr: adlandırılmamış
uk: без назви

source: data source
ca: font de dades
ro: sursă de date
tr: veri kaynağı
uk: джерело даних

source: Getting database schema information
ca: Obtenint informació sobre l'esquema de la base de dades
ro: Se obțin informații despre schema bazei de date
tr: Veri tabanı şema bilgisi alınıyor
uk: Отримання даних щодо схеми бази даних

source: Connection not yet opened
ca: Encara no s'ha obert la connexió
ro: Conexiunea nu este încă deschisă
tr: Bağlantı henüz açık değil
uk: З'єднання ще не відкрито

source: Can't initialize dictionary to store table preferences
ca: No es pot inicialitzar el diccionari per a desar les preferències de la taula
ro: Nu se poate inițializa dicționarul pentru a stoca preferințele tabelei
tr: Tablo tercihlerinin kaydı için dizin oluşturulamıyor
uk: Не вдалося ініціалізувати словник для зберігання налаштувань таблиці

source: Can't initialize transaction to access favorites
ca: No es pot inicialitzar la transacció per a accedir a preferits
ro: Nu se poate inițializa tranzacția pentru a accesa favoritele
tr: Favorilere erişim için toplu işlem oluşturulamıyor
uk: Не вдалося ініціалізувати транзакцію для доступу до вибраних записів

source: Can't commit transaction to access favorites
ca: No es poden realitzar transaccions per a accedir a preferits
ro: Nu se poate comite tranzacția pentru a accesa favoritele
tr: Favorilere erişim için toplu işlem kaydedilemez
uk: Не вдалося внести транзакцію для доступу до вибраних записів

source: Could not execute LDAP search
ca: No s'ha pogut executar la cerca a l'LDAP
ro: Nu s-a putut executa căutarea LDAP
tr: LDAP araması çalıştırılamadı
uk: Не вдалося виконати пошук LDAP

source: Could not interpret the '%s' parameter's value
ca: No s'ha pogut interpretar el valor del paràmetre «%s»
ro: Nu s-a putut interpreta valoarea parametrului „%s”
tr: '%s' parametre değeri işlenemedi
uk: Не вдалося обробити значення параметра «%s»

source: No internal parameter named '%s' required by query
ca: No es requereix cap paràmetre intern anomenat «%s» a la consulta
ro: Niciun parametru intern cu numele „%s” cerut de interogare
tr: Sorguca gereksinilen '%s' adlı iç parametre yok
uk: Немає внутрішнього параметра із назвою «%s», який потрібен запиту

source: Connection closed
ca: S'ha tancat la connexió
ro: S-a închis conexiunea
tr: Bağlantı kapatıldı
uk: З'єднання завершене

source: Can't open file '%s' for writing: %s
ca: No es pot obrir «%s» per a escriure-hi: %s
ro: Nu se poate deschide fișierul „%s” pentru scriere: %s
tr: Yazma için '%s' dosyası açılamıyor: %s
uk: Не вдалося відкрити файл «%s» для запису: %s

source: Can't open pipe '%s': %s
ca: No es pot obrir canonada «%s»: %s
ro: Nu se poate deschide conexiunea „%s”: %s
tr: '%s' borusu açılamıyor: %s
uk: Не вдалося відкрити канал «%s»: %s

source: Can't initialize dictionary to store favorites
ca: No es pot inicialitzar el diccionari per a emmagatzemar preferits
ro: Nu se poate inițializa dicționarul pentru a stoca favoritele
tr: Favorileri depolamak için dizin oluşturulamıyor
uk: Не вдалося ініціалізувати словник для збереження вибраних записів

source: Can't initialize dictionary to store favorites :%s
ca: No es pot inicialitzar el diccionari per a emmagatzemar preferits :%s
tr: Sık kullanılanları depolamak için sözlük başlatılamıyor: %s
uk: Не вдалося ініціалізувати словник для збереження вибраних записів: %s
