Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Clear history
ca: Neteja l'historial
ro: Eliberează istoric
tr: Geçmişi temizle
uk: Спорожнити журнал

source: Execution Results:
ca: Resultats de l'execució:
ro: Rezultatele executării:
tr: Çalışma Sonuçları:
uk: Результати виконання:

source: New favorite
ca: Preferit nou
ro: Favorit nou
tr: Yeni favori
uk: Новий вибраний запис

source: Modify favorite '%s'
ca: Modifica el preferit «%s»
ro: Modifică favoritul „%s”
tr: '%s' favorisini değiştir
uk: Змінити вибраний запис «%s»

source: Modify a favorite
ca: Modifica un preferit
ro: Modifică un favorit
tr: Bir favoriyi değiştir
uk: Змінити вибраний запис

source: Favorite's name
ca: Nom del preferit
ro: Denumirea favoritului
tr: Favori adı
uk: Назва вибраного запису

source: Unnamed query
ca: Consulta sense nom
ro: Interogare nedenumită
tr: Adlandırılmamış sorgu
uk: Запит без назви

source: Name of the favorite to create
ca: Nom del preferit a crear
ro: Numele favoritului care va fi creat
tr: Oluşturulacak favorinin adı
uk: Назва вибраного запису, який слід створити

source: Enter the name of the favorite to create
ca: Introduïu el nom del preferit a crear
ro: Introduceți numele favoritului care va fi creat
tr: Oluşturulacak favorinin adının girin
uk: Введіть назву вибраного запису, який слід створити

source: Invalid variable's contents
ca: El contingut de la variable no és vàlid
ro: Conținuturi de variabilă nevalide
tr: Geçersiz değişkenin içeriği
uk: Некоректний вміст змінної

source: assign values to the following variables
ca: assignar valors a les següents variables
ro: atribuie valori pentru următoarele variabile
tr: aşağıdaki değişkenlere değer ata
uk: встановити значення для вказаних нижче змінних

source: A query is already being executed, to execute another query, open a new connection.
ca: Ja s'està executant una consulta, per a executar una altra consulta, obriu una nova connexió.
ro: O interogare este deja executată, pentru a executa altă interogare, deschideți o conexiune nouă.
tr: Bir sorgu zaten çalıştırılmış, başka bir sorgu çalıştırmak için bir bağlantı açın.
uk: Запит вже виконується. Щоб виконати інший запит, відкрийте нове з'єднання.

source: Error while parsing code: %s
ca: S'ha produït un error en analitzar el codi: %s
ro: Eroare la analizarea codului: %s
tr: Kod ayrıştırılırken hata oluştu: %s
uk: Помилка під час обробки коду: %s

source: A transaction has automatically been started during this statement's execution, this usually happens when blobs are selected (and the transaction will have to remain opened while the blobs are still accessible, clear the corresponding history item before closing the transaction).
ca: S'ha iniciat una transacció automàtica durant l'execució d'aquesta declaració, això generalment passa quan se seleccionen «blobs» (i la transacció haurà de romandre oberta mentre els «blobs» estiguin accessibles, netegi l'element corresponent de l'històric abans de tancar la transacció).
ro: O tranzacție a început automat în timpul executării comenzii, acest lucru se întâmplă de obicei când bloburile sunt selectate (și tranzacția va trebui să rămână deschisă în timp ce bloburile sunt încă accesibile, eliberați elementul de istoric corespunzător înainte de a închide tranzacția).
tr: Toplu işlem, ifadenin çalışması sırasında otomatik olarak başlamış, bu genellikle blob seçili olduğunda meydana gelir (ve toplu işlem blob erişilebilirken sürdürmek zorundadır, bu işlemi kapatmadan önce\ilgili geçmiş ögesini silin)

source: Statement executed
ca: Declaració executada
ro: Comandă executată
tr: İfade yürütülmüş
uk: Виконано інструкцію

source: Error executing query: %s
ca: S'ha produït un error en executar la consulta: %s
ro: Eroare la executarea interogării: %s
tr: Sorgu çalıştırma hatası: %s
uk: Помилка при виконанні запиту: %s

source: Internal error, please report error to http://gitlab.gnome.org/GNOME/libgda/issues
ca: Error intern, informeu de l'error a http://gitlab.gnome.org/GNOME/libgda/issues
tr: İç hata, lütfen hatayı http://gitlab.gnome.org/GNOME/libgda/issues adresine bildirin
uk: Внутрішня помилка. Будь ласка, повідомте про неї за допомогою сторінки http://gitlab.gnome.org/GNOME/libgda/issues

source: Execute query
ca: Executa la consulta
ro: Execută interogare
tr: Sorguyu çalıştır
uk: Виконати запит

source: Copy all in a single line
ca: Copia-ho tot a una sola línia
ro: Copiază tot într-o singură linie
tr: Tümünü tek bir satır olarak kopyala
uk: Копіювати усе до одного рядка

source: In the future:
ca: En el futur:
ro: În viitor:
tr: Gelecekte:
uk: У майбутньому:

source: Less than a minute ago:
ca: Fa menys d’un minut:
ro: Mai puțin de un minut în urmă:
tr: Bir dakikadan daha az:
uk: Менше хвилини тому:

source: %lu minute ago:
ca: fa %lu minut:
ro: %lu minut în urmă:
tr: %lu dakika önce:
uk: %lu хвилину тому:

source: %lu hour ago
ca: fa %lu hora
ro: %lu oră în urmă
tr: %lu saat önce
uk: %lu годину тому

source: %lu day ago
ca: fa %lu dia
ro: %lu zi în urmă
tr: %lu gün önce
uk: %lu день тому

source: Enter SQL code to execute (must be understood by the database to which the connection is opened, except for the variables definition) The following shortcuts are allowed: <small><b>CTRL - l</b></small> to clear the editor <small><b>CTRL - ENTER</b></small> to execute SQL <small><b>CTRL - Up</b></small> to move to previous executed SQL in history <small><b>CTRL - Down</b></small> to move to next executed SQL in history <small><b>CTRL - SPACE</b></small> to obtain a completion list
ca: Introduïu el codi SQL a executar (ha de ser entès per la base de dades a la qual s'obre la connexió, excepte per a la definició de variables) Les següents dreceres estan permeses: <small><b>CTRL - l</b></small> netejar l'editor <small><b>CTRL - Retorn</b></small> executar SQL <small><b>CTRL - Fletxa amunt</b></small> moure a l'anterior SQL executada a l'historial <small><b>CTRL - Fletxa avall</b></small> moure a la següent SQL executada en l'historial <small><b>CTRL - Espai</b></small> obtenir una llista de finalització
ro: Introduceți codul SQL de executat (trebuie înțeles de baza de date la care conexiunea este deschisă, exceptând definiția variabilelor) Următoarele scurtături sunt permise: <small><b>CTRL - l</b></small> pentru a curăța editorul <small><b>CTRL - ENTER</b></small> pentru a executa SQL <small><b>CTRL - Sus</b></small> pentru a muta în istoric la SQL executat anterior <small><b>CTRL - Jos</b></small> pentru a muta în istoric la SQL executat următor <small><b>CTRL - SPAȚIU</b></small> pentru a obține o listă de completare
tr: Yürütülecek SQL kodunu girin (değişken tanımı dışında, bağlantının açıldığı veri tabanınca anlaşılmalıdır) Aşağıdaki kısayollara izin verilir: <small><b>CTRL - l</b></small> editörü temizlemek için <small><b>CTRL - ENTER</b></small> SQL yürütmek için <small><b>CTRL - Yukarı</b></small> geçmişte çalıştırılan SQL'e geçmek için <small><b>CTRL - Aşağı</b></small> geçmişte bir sonraki çalıştırılan SQL'e geçmek için <small><b>CTRL - BOŞLUK</b></small> tamamlama listesi almak için

source: New query execution tab
ca: Pestanya nova d'execució de consultes
tr: Yeni sorgu yürütme sekemsi
uk: Нова вкладка виконання запиту

source: Could not add action: %s
ca: No s'ha pogut afegir l'acció: %s
ro: Nu s-a putut adăuga acțiunea: %s
tr: Eylem eklenemedi: %s
uk: Не вдалося додати дію: %s

source: SQL Code
ca: Codi SQL
ro: Cod SQL
tr: SQL Kodu
uk: Код SQL

source: Is action
ca: És una acció
ro: Este acțiune
tr: Eylem mi
uk: Є дією

source: Check this option to make this favorite an action which can be proposed for execution from grids containing data. The parameters required to execute the query will be defined from the row selected in the grid
ca: Marqueu aquesta opció perquè aquest preferit sigui una acció que es pot proposar per a executar-se des de les graelles que continguin dades. Els paràmetres requerits per a executar la consulta es definiran des de la fila seleccionada a la graella
ro: Bifați această opțiune pentru a face acest favorit o acțiune care poate fi propusă pentru execuție din grile ce conțin date. Parametrii necesari pentru a executa interogarea vor fi definiți din rândul selectat în grilă
tr: Izgaraların içerdiği veriden önerilen şekilde çalıştırmak, favoriyi bir eylem yapmak için bu seçeneği işaretleyin. Sorgunun çalışması için parametreler gereklidir ve ızgaradaki seçili satırdan gelirler

source: Statement:
ca: Declaració:
ro: Comandă:
tr: İfade:
uk: Виписка:

source: Execution Parameters
ca: Paràmetres d'execució
ro: Parametrii de executare
tr: Çalışma Parametreleri
uk: Параметри виконання

source: No result selected
ca: No s'ha seleccionat cap resultat
ro: Niciun rezultat selectat
tr: Hiç sonuç seçilmemiş
uk: Не вибрано результатів

source: Execution error:
ca: Error d’execució:
ro: Eroare de executare:
tr: Çalıştırma hatası:
uk: Помилка виконання:

source: Table not found
ca: No s'ha trobat la taula
ro: Nu s-a găsit tabela
tr: Tablo bulunamadı
uk: Таблицю не знайдено

source: Requested object is not a table or view
ca: L'objecte sol·licitat no és una taula o vista
ro: Obiectul cerut nu este o tabelă sau o vizualizare
tr: İstenen nesne bir tablo veya görünüm değil
uk: Запитаний об'єкт не є таблицею або переглядом

source: Auto incremented
ca: Increment automàtic
ro: Incrementat automat
tr: Otomatik artan
uk: Автозбільшення

source: Index of tables and views
ca: Índex de taules i vistes
ro: Index de tabele și vizualizări
tr: Tabloların ve görünümlerin indeksi
uk: Покажчик таблиць і переглядів

source: Schema browser
ca: Visor d'esquemes
ro: Navigator de schemă
tr: Şema tarayıcısı
uk: Навігатор схемою

source: Diagram
ca: Diagrama
ro: Diagramă
tr: Diyagram
uk: Діаграма

source: Could not save diagram
ca: No s'ha pogut desar el diagrama
ro: Nu s-a putut salva diagrama
tr: Diyagram kaydedilemedi
uk: Не вдалося зберегти діаграму

source: Canvas's name
ca: Nom del llenç
ro: Numele proiectului
tr: Tuval adı
uk: Назва полотна

source: Relations diagram
ca: Diagrama de relacions
ro: Diagramă de relații
tr: İlişkiler diyagramı
uk: Діаграма зв'язків

source: Error parsing favorite's contents
ca: S'ha produït un error en analitzar els continguts preferits
ro: Eroare la analizarea conținuturilor preferatei
tr: Favori içeriği ayrıştırma hatası
uk: Помилка під час обробки вмісту вибраного запису

source: '%s' diagram
ca: Diagrama «%s»
ro: diagramă „%s”
tr: '%s' diyagramı
uk: Діаграма «%s»

source: Missing table attribute in favorite's contents
ca: Falta un atribut de la taula en el contingut dels preferits
ro: Lipsește atributul tabelei în conținuturile preferatei
tr: Favorinin içeriğinde tablo özniteliği eksik
uk: Пропущено атрибут таблиці у вмісті вибраного запису

source: Manage data in selected tables
ca: Gestiona les dades de les taules seleccionades
tr: Seçilen tablolardaki veriyi yönet
uk: Керувати даними у вибраних таблицях

source: Create a new diagram
ca: Crea un diagrama nou
ro: Creează o diagramă nouă
tr: Yeni bir diyagram oluştur
uk: Створити діаграму

source: Could not load diagram
ca: No s'ha pogut carregar el diagrama
ro: Nu s-a putut încărca diagrama
tr: Diyagram yüklenemedi
uk: Не вдалося завантажити діаграму

source: Declared foreign key '%s' on
ca: Clau externa «%s» declarada
ro: S-a declarat cheia străină „%s” la
tr: '%s' belirtilmiş yabancı anahtar
uk: Оголошено сторонній ключ «%s» на

source: Foreign key '%s' on
ca: Clau externa «%s» en
ro: Cheia străină „%s” la
tr: '%s' yabancı anahtar
uk: Сторонній ключ «%s» на

source: incompatible types: '%s' for the foreign key and '%s' for the referenced primary key
ca: tipus incompatibles: «%s» per a la clau externa i «%s» per a la clau primària referenciada
ro: tipuri incompatibile: „%s” pentru cheia străină și „%s” pentru cheia primară referențiată
tr: uyumsuz türler: yabancı anahtar için '%s' ve referanslanmış birincil anahtar için '%s'
uk: несумісні типи: «%s» для стороннього ключа і «%s» для основного ключа, на який посилаються

source: Could not compute table's UNIQUE constraints for %s.%s.%s
ca: No s'han pogut calcular les restriccions úniques de la taula de %s.%s.%s
ro: Nu s-au putut calcula restricțiile UNIQUE ale tabelei pentru %s.%s.%s
tr: %s.%s.%s için tablonun UNIQUE kısıtlamaları hesaplanamadı
uk: Не вдалося обчислити обмеження UNIQUE таблиці для %s.%s.%s

source: Unique constraint
ca: Restriccions úniques
ro: Restricție unică
tr: Eşsiz kısıtlama
uk: Обмеження унікальності

source: Tables referencing this one
ca: Taules que fan referència a aquesta
ro: Tabele care fac referință la aceasta
tr: Tablolar bunu referans gösteriyor
uk: Таблиці, які посилаються на цю

source: Column Name
ca: Nom de la columna
ro: Nume coloană
tr: Sütun Adı
uk: Назва стовпчика

source: Not NULL?
ca: No és NULL?
ro: Nenul?
tr: NULL değil?
uk: Не NULL?

source: LDAP virtual table definition
ca: Definició de taula virtual LDAP
ro: Definiția tabelei virtuale LDAP
tr: LDAP sanal tablo tanımlaması
uk: Визначення віртуальної таблиці LDAP

source: Constraints and integrity rules
ca: Restriccions i regles d'integritat
ro: Restricții și reguli de integritate
tr: Kısıtlamalar ve doğruluk kuralları
uk: Правила обмеження і цілісності

source: Could not find table '%s.%s'
ca: No s'ha pogut trobar la taula '%s.%s'
ro: Nu s-a putut găsi tabela „%s.%s”
tr: '%s.%s' tablosu bulunamadı
uk: Не вдалося знайти таблицю «%s.%s»

source: Could not find declared foreign key '%s'
ca: No s'ha pogut trobar cap clau externa declarada «%s»
ro: Nu s-a putut găsi cheia străină declarată „%s”
tr: '%s' tanımlanmış yabancı anahtar bulunamadı
uk: Не вдалося знайти оголошений сторонній ключ «%s»

source: Meta data not yet available
ca: Les metadades encara no estan disponibles
ro: Datele meta nu sunt încă disponibile
tr: Üst veri henüz kullanılabilir değil
uk: Метадані ще недоступні

source: Can't find information about table
ca: No es pot trobar informació sobre la taula
ro: Nu se pot găsi informații despre tabelă
tr: Tablo hakkında bilgi bulunamıyor
uk: Не вдалося знайти відомості щодо таблиці

source: Object
ca: Objecte
ro: Obiect
tr: Nesne
uk: Об'єкт

source: Table not found. If you think this is an error, please refresh the meta data from the database (menu Connection/Fetch meta data).
ca: No s'ha trobat la taula. Si creieu que això és un error actualitzeu les metadades de la base de dades (menú Connexió / Cerca metadades).
ro: Tabela nu a fost găsită. Dacă gândiți că aceasta este o eroare, reîmprospătați datele meta de la baza de date (meniul Conexiune/Adu date meta).
tr: Tablo bulunamadı. Bunun bir hata olduğunu düşünüyorsanız, lütfen veri tabanından üst veriyi yenileyin (menü Bağlantı/Üst veri getir).

source: Relations
ca: Relacions
ro: Relații
tr: İlişkiler
uk: Зв'язки

source: Preferences
ca: Preferències
ro: Preferințe
tr: Tercihler
uk: Параметри

source: Data successfully inserted
ca: S'han inserit les dades correctament
ro: Datele au fost inserate cu succes
tr: Veri başarıyla eklendi
uk: Дані успішно вставлено

source: Error executing query: %s
ca: S'ha produït un error en executar la consulta: %s
ro: Eroare la executarea interogării: %s
tr: Sorgu çalıştırma hatası: %s
uk: Помилка при виконанні запиту: %s

source: Internal error while building INSERT statement: %s
ca: Error intern al construir la declaració INSERT: %s
ro: Eroare internă în timpul construirii comenzii INSERT: %s
tr: INSERT ifadesi oluşturulurken iç hata: %s
uk: Внутрішня помилка під час побудови інструкції INSERT: %s

source: Default value: '%s'
ca: Valor per defecte: «%s»
ro: Valoare implicită: „%s”
tr: Öntanımlı değer: '%s'
uk: Типове значення: «%s»

source: Default value: auto incremented value
ca: Valor per defecte: valor autoincrementat
ro: Valore implicită: valoare incrementată automat
tr: Öntanımlı değer: otomatik artırılmış değer
uk: Типове значення: автоматично збільшуване значення

source: Values to insert into table
ca: Valors que cal inserir a la taula
ro: Valori de inserat în tabelă
tr: Tabloya eklenecek değerler
uk: Значення, які слід вставити до таблиці

source: Cancel
ca: Cancel·la
tr: İptal
uk: Скасувати

source: Can't find information about table '%s'
ca: No es pot trobar informació sobre la taula «%s»
ro: Nu se pot găsi informații despre tabela „%s”
tr: '%s' tablosu hakkında bilgi bulunamıyor
uk: Не вдалося знайти відомості щодо таблиці «%s»

source: Add to Favorites
ca: Afegir als preferits
tr: Favorilere Ekle
uk: Додати до вибраних

source: View table's contents
ca: Visualitza el contingut de la taula
ro: Vizualizează conținuturile tabelei
tr: Tablonun içeriğini görüntüle
uk: Вміст таблиці перегляду

source: Insert data into table
ca: Insereix dades a la taula
ro: Inserează date în tabelă
tr: Tabloya veri ekle
uk: Вставити дані до таблиці

source: Declare Foreign Key
ca: Declarar una Clau Externa
tr: Yabancı Anahtar Tanımla
uk: Оголосити сторонній ключ

source: default
ca: per defecte
ro: implicit
tr: öntanımlı
uk: типове

source: Table's fields
ca: Camps de la taula
ro: Câmpurile tabelei
tr: Tablonun alanları
uk: Поля таблиці

source: Field's display preferences
ca: Preferències de visualització del camp
ro: Preferințele de afișare ale tabelei
tr: Alanın görünüm tercihleri
uk: Налаштування показу поля

source: Data entry type:
ca: Tipus d'entrada de dades:
ro: Tip de intrare pentru date:
tr: Veri girdisi türü:
uk: Тип запису даних:

source: Defines how data for the selected column will be displayed in forms. Leave 'Default' to have the default display
ca: Defineix com es mostraran en els formularis les dades per a la columna seleccionada. Deixi-ho com «per defecte» per a tenir la pantalla per predeterminada
ro: Definește cum se vor afișa datele pentru coloanele selectate în formulare. Lăsați „implicit” pentru a avea afișarea implicită
tr: Form içinde, seçilmiş sütun için verinin nasıl gösterileceğini tanımlar. Öntanımlı görünüm için 'Öntanımlı' olarak bırakın

source: Options:
ca: Opcions:
ro: Opțiuni:
tr: Seçenekler:
uk: Параметри:

source: none
ca: cap
ro: nimic
tr: hiçbiri
uk: немає

source: Preview:
ca: Previsualització:
ro: Previzualizare:
tr: Ön izleme:
uk: Перегляд:

source: Free form to test the configured data entry
ca: Formulari gratuït per a provar l'entrada de dades configurada
ro: Eliberează formularul pentru a testa intrările de date configurate
tr: Yapılandırılmış veri girdisini testi etmek için serbest form
uk: Довільні дані для тестування налаштованого запису даних

source: Hide search toolbar
ca: Oculta la barra d'eines de cerca
ro: Ascunde bara de instrumente de căutare
tr: Arama çubuğunu gizle
uk: Приховати панелі інструментів пошуку

source: Search:
ca: Cerca:
ro: Căutare:
tr: Arama:
uk: Пошук:

source: Case sensitive
ca: Distingeix entre majúscules i minúscules
ro: Sensibil la majuscule
tr: Büyük küçük harf duyarlı
uk: З врахуванням регістру

source: _Execute
ca: _Executa
ro: _Execută
tr: _Çalıştır
uk: Вико_нати

source: Enable or disable auto update of data
ca: Activa o desactiva l'actualització automàtica de les dades
ro: Activează sau dezactivează actualizarea automată a datelor
tr: Verinin kendiliğinden güncellenmesini etkinleştir veya kapat
uk: Увімкнути або вимкнути автоматичне оновлення даних

source: Toggle between grid and form presentations
ca: Alterna entre presentacions de graella i de formulari
ro: Comută între grilă și prezentările formularului
tr: Izgara ve form gösterimi arası geçiş yap
uk: Перемкнутися між показом сітки і формою

source: Refresh data
ca: Actualitza les dades
ro: Reîmprospătează datele
tr: Veriyi tazele
uk: Освіжити дані

source: Execute action
ca: Executa l'acció
ro: Execută acțiunea
tr: Eylemi çalıştır
uk: Виконати дію

source: View LDAP entry's details
ca: Visualitza els detalls de l'entrada LDAP
ro: Vizualizează detaliile intrării LDAP
tr: LDAP girdilerinin ayrıntılarını görüntüle
uk: Переглянути подробиці щодо запису LDAP

source: Set or confirm the parameters to execute action '%s'
ca: Establiu o confirmeu els paràmetres per a executar l'acció «%s»
ro: Stabilește sau confirmă parametrii pentru a executa acțiunea „%s”
tr: '%s' eyleminin çalıştırmak için parametreleri ayarlayın veya onaylayın

source: Execution of action
ca: Execució de l'acció
ro: Executarea acțiunii
tr: Eylemin çalıştırılması
uk: Виконання дії

source: Action successfully executed
ca: S'ha executat correctament l'acció
ro: Acțiune executată cu succes
tr: İşlem başarıyla yürütüldü
uk: Дію успішно виконано

source: Abstract
ca: Resum
tr: Soyut
uk: Резюме

source: Structural
ca: Estructural
tr: Yapısal
uk: Структурний

source: Auxiliary
ca: Auxiliar
tr: Yardımcı
uk: Допоміжне обладнання

source: Error:
ro: Eroare:
tr: Hata:
uk: Помилка:

source: Information:
ca: Informació:
ro: Infomații:
tr: Bilgi:
uk: Інформація:

source: Unable to display help. Please make sure the documentation package is installed.
ca: No es pot mostrar l'ajuda. Assegureu-vos que hi hagi instal·lat el paquet de documentació.
ro: Nu se poate afișa ajutorul. Asigurați-vă că pachetul cu documentația este instalat.
tr: Yardım görüntülenemiyor. Lütfen belgelendirme paketinin kurulu olduğundan emin olun.
uk: Не вдалося показати довідку. Будь ласка, переконайтеся, що встановлено пакунок документації.

source: Unable to open help file
ca: No es pot obrir el fitxer d'ajuda
ro: Nu se poate deschide fișierul de ajutor
tr: Yardım dosyası açılamadı
uk: Не вдалося відкрити файл довідки

source: Close tab
ca: Tanca la pestanya
ro: Închide tab
tr: Sekmeyi kapat
uk: Закрити вкладку

source: <small>This area allows to give values to variables defined in the SQL code using the following syntax: <b><tt>##&lt;variable name&gt;::&lt;type&gt;[::null]</tt></b> For example: <span foreground="#4e9a06"><b><tt>##id::int</tt></b></span> defines <b>id</b> as a non NULL integer <span foreground="#4e9a06"><b><tt>##age::string::null</tt></b></span> defines <b>age</b> as a string Valid types are: <tt>string</tt>, <tt>boolean</tt>, <tt>int</tt>, <tt>date</tt>, <tt>time</tt>, <tt>timestamp</tt>, <tt>guint</tt>, <tt>blob</tt> and <tt>binary</tt></small>
ca: <small>Aquesta àrea permet donar valors a variables definides al codi SQL mitjançant la sintaxi següent <b><tt>##&lt;variable name&gt;::&lt;type&gt;[::null]</tt></b> Per exemple: <span foreground="#4e9a06"><b><tt>##id::int</tt></b></span> defineix <b>id</b> com un nombre sencer no NULL <span foreground="#4e9a06"><b><tt>##age::string::null</tt></b></span> defineix <b>edat</b> com una cadena Els tipus vàlids són: <tt>cadena</tt>, <tt>booleà</tt>, <tt>sencer</tt>, <tt>data</tt>, <tt>hora</tt>, <tt>marca horària</tt>, <tt>guint</tt>, <tt>blob</tt> i <tt>binari</tt></small>
ro: <small>Această zonă permite acordarea de valori la variabilele definite în codul SQL utilizând următoarea sintaxă: <b><tt>##&lt;nume variabilă&gt;::&lt;tip&gt;[::null]</tt></b> De exemplu: <span foreground="#4e9a06"><b><tt>##id::int</tt></b></span> definește <b>id</b> ca un întreg diferit de NULL <span foreground="#4e9a06"><b><tt>##age::string::null</tt></b></span> definește <b>age</b> ca un șir Tipurile valide sunt: <tt>șir</tt>, <tt>logic</tt>, <tt>întreg</tt>, <tt>dată</tt>, <tt>oră</tt>, <tt>marcaj de timp</tt>, <tt>guint</tt>, <tt>blob</tt> și <tt>binar</tt></small>
tr: <small>Bu alan, SQL kodunda tanımlanan değişkenlere değer verilmesine izin verir. aşağıdaki sözdizimini kullanarak: <b><tt>##&lt;değişken adı&gt;::&lt;tür&gt;[::null]</tt></b> Örneğin: <span foreground="#4e9a06"><b><tt>##id::int</tt></b></span> tanımlar <b>id</b> NULL olmayan bir tam sayı <span foreground="#4e9a06"><b><tt>##age::string::null</tt></b></span> tanımlar <b>yaş</b> dize olarak Valid types are: <tt>string</tt>, <tt>boolean</tt>, <tt>int</tt>, <tt>date</tt>, <tt>time</tt>, <tt>timestamp</tt>, <tt>guint</tt>, <tt>blob</tt> and <tt>binary</tt></small>

source: Generated by the GDA SQL console
ca: Generat per la consola GDA SQL
ro: Generat de consola GDA SQL
tr: GDA SQL konsolunca oluşturulmuştur
uk: Створено консоллю SQL GDA
