Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Console
ca: Consola
ro: Consolă
tr: Konsol
uk: Консоль

source: Set to TRUE when the 1st line of a CSV file holds column names
ca: Establir a TRUE quan la 1a línia d'un fitxer CSV conté noms de columnes
ro: Stabilește la ADEVĂRAT când prima linie a unui fișier CSV conține numele coloanelor
tr: CSV dosyasının ilk satırı sütun adlarından olduğunda TRUE olarak ayarla
uk: Встановіть значення TRUE, якщо перший рядок файла CSV містить назви стовпчиків

source: Quote character for CSV format
ca: Caràcter de coma del format CSV
ro: Caracterul ghilimele pentru formatul CSV
tr: CSV biçimi için alıntı karakteri
uk: Символ лапок для формату CSV

source: Separator character for CSV format
ca: Caràcter separador del format CSV
ro: Caracterul separator pentru formatul CSV
tr: CSV biçimi için ayırıcı karakter
uk: Символ-роздільник для формату CSV

source: Defines how the DN column is handled for LDAP searched (among "dn", "rdn" and "none")
ca: Defineix com es maneja la columna DN per a les recerques LDAP (entre «dn», «rdn» i «none»)
ro: Definește cum coloana DN este administrată pentru LDAP căutat (printre care „dn”, „rdn” și „none”)
tr: LDAP aramalarında, DNS sütunun nasıl işleneceğini tanımlar ("dn", "rdn" ve "none" arasında)
uk: Визначає, як обробляється стовпчик DN для LDAP, у якому виконується пошук (варіанти — "dn", "rdn" і "none")

source: Defines the LDAP attributes which are fetched by default by LDAP commands
ca: Defineix els atributs LDAP obtinguts de manera predeterminada per ordres LDAP
ro: Definește atributele LDAP care sunt preluate implicit de comenzile LDAP
tr: LDAP komutlarıyla, LDAP özniteliklerinin hangilerinin öntanımlı olarak çekileceğini tanımlar
uk: Визначає атрибути LDAP, які типово отримуються командами LDAP

source: Opening connection '%s' for:
ca: Obrint la connexió per a: «%s»:
ro: Se deschide conexiunea „%s” pentru:
tr: '%s' bağlantısı şunun için açılıyor:
uk: Відкриття з'єднання «%s» для:

source: %s [<FILE>]
ro: %s [<FIȘIER>]
tr: %s [<DOSYA>]
uk: %s [<ФАЙЛ>]

source: Show commands history, or save it to file
ca: Mostra l'historial d'ordres, o deseu-lo en un fitxer
ro: Afișează istoricul comenzilor, sau salvează-l în fișier
tr: Komut geçmişini göster veya bir dosyaya yaz
uk: Показати журнал команд або зберегти його до файла

source: Information
ca: Informació
ro: Infomații
tr: Bilgi
uk: Інформація

source: %s [<META DATA TYPE>]
ro: %s [<TIP DE METADATE>]
tr: %s [<ÜST VERİ TÜRÜ>]
uk: %s [<ТИП МЕТАДАНИХ>]

source: Force reading the database meta data (or part of the meta data, ex:"tables")
ca: Forçar la lectura de les metadades de la base de dades (o part de les metadades, ex: «taules»)
ro: Forțează citirea datelor meta ale bazei de date (sau o parte din datele meta, ex:„tabele”)
tr: Veri tabanı üst verisini okumaya zorla (veya üst verinin bir parçası olmaya, örn:"tablolar")
uk: Примусово прочитати метадані бази даних (або частину метаданих, приклад:"tables")

source: %s <fkname> <tableA>(<colA>,...) <tableB>(<colB>,...)
tr: %s <fk_adı> <tabloA>(<sütunA>,...) <tabloB>(<sütunB>,...)
uk: %s <назва-fk> <таблицяA>(<стовпчикA>,...) <таблицяB>(<стовпчикB>,...)

source: Declare a new foreign key (not actually in database): tableA references tableB
ca: Declarar una clau externa nova (que no estigui actualment a la base de dades): taulaA referències taulaB
ro: Declară o cheie străină nouă (care nu este fizic în baza de date): tableA face referire la tableB
tr: Yeni bir yabancı anahtar tanımla (aslında veri tabanı üstünde değil) tabloA, tabloB'yi işaret eder
uk: Оголосити новий сторонній ключ (якого насправді немає у базі даних): tableA посилається на tableB

source: %s <fkname> <tableA> <tableB>
tr: %s <fk_adı> <tabloA> <tabloB>
uk: %s <назва-fk> <таблицяA> <таблицяB>

source: Un-declare a foreign key (not actually in database)
ca: Anul·lar una clau externa (que no estigui actualment a la base de dades)
ro: Elimină o cheie străină (care nu este fizic în baza de date)
tr: Belirtilmemiş bir yabancı anahtar (gerçekte veri tabanında değil)
uk: Скасувати оголошення стороннього ключа (якого насправді немає у базі даних)

source: %s [<TABLE>]
ro: %s [<TABEL>]
tr: %s [<TABLO>]
uk: %s [<ТАБЛИЦЯ>]

source: List all tables (or named table)
ca: Llista de totes les taules (o la taula de nom)
ro: Enumeră toate tabelele (sau tabela denumită)
tr: Tüm tabloları listele (adlandırılmış tabloları)
uk: Вивести список усіх таблиць (або вказану за назвою таблицю)

source: %s [<VIEW>]
ro: %s [<VIZUALIZARE>]
tr: %s [<GÖRÜNÜM>]
uk: %s [<ПЕРЕГЛЯД>]

source: List all views (or named view)
ca: Llista de totes les vistes (o la vista de nom)
ro: Enumeră toate vizualizările (sau vizualizarea denumită)
tr: Tüm görünümleri listele (adlandırılmış görünümleri)
uk: Вивести список усіх переглядів (або вказаного за назвою перегляду)

source: %s [<SCHEMA>]
ro: %s [<SCHEMĂ>]
tr: %s [<ŞEMA>]
uk: %s [<СХЕМА>]

source: List all schemas (or named schema)
ca: Llistar tots els esquemes (o l'esquema amb nom)
ro: Enumeră toate schemele (sau schema denumită)
tr: Tüm şemaları listele (yada şema olarak adlandırılanları)
uk: Вивести список усіх схем (або названої схеми)

source: %s [<OBJ_NAME>|<SCHEMA>.*]
ro: %s [<NUME_OBIECT>|<SCHEMĂ>.*]
tr: %s [<NESNE_ADI>|<ŞEMA>.*]
uk: %s [<НАЗВА_ОБ'ЄКТА>|<СХЕМА>.*]

source: Describe object or full list of objects
ca: Descriure l'objecte o llista completa dels objectes
ro: Descrie obiectul sau lista completă de obiecte
tr: Nesne tanımla veya nesneleri tüm listesi
uk: Описати об'єкт або увесь список об'єктів

source: %s [<TABLE1> [<TABLE2>...]]
ro: %s [<TABEL1> [<TABEL2>...]]
tr: %s [<TABLO1> [<TABLO2>...]]
uk: %s [<ТАБЛИЦЯ1> [<ТАБЛИЦЯ2>...]]

source: Create a graph of all or the listed tables
ca: Crear una gràfica de totes les taules o de les llistades
ro: Creeză un grafic pentru toate tabelele enumerate
tr: Tümünün ya da listelenmiş tabloların grafiğini oluştur
uk: Створити графік на основі усіх або вказаних у списку таблиць

source: %s [<port> [<authentication token>]]
ro: %s [<port> [<jeton de autentificare>]]
tr: %s [<baglanti_noktasi> [<kimlik_dogrulama_jetonu>]]
uk: %s [<порт> [<ключ розпізнавання>]]

source: Start/stop embedded HTTP server (on given port or on 12345 by default)
ca: Iniciar / aturar el servidor HTTP incrustat (per port determinat o per defecte el 12345)
ro: Pornește/oprește serverul HTTP înglobat (la portul dat sau la 12345 în mod implicit)
tr: Gömülü HTTP sunucusunu başlat/durdur (verilen bağlantı noktasında veya öntanımlı olarak 12345 üzerinde)
uk: Запустити або зупинити вбудований сервер HTTP (на вказаному порті або на типовому порті 12345)

source: %s [[<CNC_NAME>] [<DSN>|<CONNECTION STRING>]]
ro: %s [[<NUME_CNC>] [<DSN>|<ȘIR DE CONEXIUNE>]]
tr: %s [[<CNC_ADI>] [<DSN>|<BAĞLANTI DİZGESİ>]]
uk: %s [[<НАЗВА_CNC>] [<DSN>|<РЯДОК ЗʼЄДНАННЯ>]]

source: Opens a new connection or lists opened connections
ca: Obre una connexió nova o enumera les connexions obertes
ro: Deschide o conexiune nouă sau enumeră conexiunile deschise
tr: Yeni bir bağlantı açar veya açılmış bağlantıları listeler
uk: Відкриває нове з'єднання або виводить список відкритих з'єднань

source: %s [<CNC_NAME>]
ro: %s [<NUME_CNC>]
tr: %s [<CNC_ADI>]
uk: %s [<НАЗВА_CNC>]

source: Close a connection
ca: Tancar una connexió
ro: Închide o conexiune
tr: Bağlantıyı kapat
uk: Закрити з'єднання

source: %s <CNC NAME> <OBJ NAME> [<OBJ NAME> ...]
ro: %s <NUME CNC> <NUME OBIECT> [<NUME OBIECT> ...]
tr: %s <CNC ADI> <OBJ ADI> [<OBJ ADI> ...]
uk: %s <НАЗВА CNC> <НАЗВА OBJ> [<НАЗВА OBJ> ...]

source: Bind connections or datasets (<OBJ NAME>) into a single new one (allowing SQL commands to be executed across multiple connections and/or datasets)
ca: Enllaça les connexions o conjunts de dades (<OBJ NAME>) en una de nova (permetent que les ordres SQL s'executin a través de múltiples connexions i/o conjunts de dades)
ro: Leagă conexiuni la seturi de date (<NUME OBIECT>) într-una singură (permițând comenzilor să fie executate în conexiuni și/sau seturi de date multiple)
tr: Bağlantıları ya da veri kümelerini (<OBJ NAME>) tek bir tanesine bağla (SQL komutlarına, birden çok bağlantıda ve bağlantılar arası çalışasına izin verir)

source: DSN (data sources) management
ca: Gestió de DSN (fonts de dades)
ro: Administrare DSN (surse de date)
tr: DSN (veri kaynakları) yönetimi
uk: Керування DSN (джерела даних)

source: List all DSN (or specified DSN's attributes)
ca: Llista tots els atributs de DSN (o atributs específics de DSN)
tr: Tüm DSN leri listele (veya belirtilen DSN özniteliklerini)
uk: Вивести список усіх DSN (або атрибути вказаного DSN)

source: %s <DSN_NAME> <DSN_DEFINITION> [<DESCRIPTION>]
ro: %s <NUME_DSN> <DEFINIȚIE_DSN> [<DESCRIERE>]
tr: %s <DSN_ADI> <DSN_TANIMI> [<TANIMLAMA>]
uk: %s <НАЗВА_DSN> <ВИЗНАЧЕННЯ_DSN> [<ОПИС>]

source: Create (or modify) a DSN
ca: Crea (o modifica) un DSN
ro: Creează (sau modifică) un DSN
tr: Bir DSN oluştur (ya da değişiklik yap)
uk: Створити (або змінити) DSN

source: %s <DSN_NAME> [<DSN_NAME>...]
ro: %s <NUME_DSN> [<NUME_DSN>...]
tr: %s <DSN_ADI> [<DSN_ADI>...]
uk: %s <НАЗВА_DSN> [<НАЗВА_DSN>...]

source: Remove a DSN
ca: Elimina un DSN
ro: Elimină un DSN
tr: DSN kaldır
uk: Вилучити DSN

source: %s [<PROVIDER>]
ro: %s [<FURNIZOR>]
tr: %s [<SAĞLAYICI>]
uk: %s [<НАДАВАЧ_ДАНИХ>]

source: List all installed database providers (or named one's attributes)
ca: Llisteu tots els proveïdors de bases de dades instal·lats (o algun atribut)
ro: Enumeră toți furnizorii de bază de date instalați (sau denumiți atributele sale)
tr: Tüm yüklenmiş veri tabanı sağlayıcılarını listele (veya adlandırılmış özniteliklerini)
uk: Вивести список усіх встановлених засобів роботи із базами даних (або атрибути вказаного засобу)

source: Input/Output
ca: Entrada/Sortida
ro: Intrare/Ieșire
tr: Girdi/Çıktı
uk: Вхід/Вихід

source: %s <FILE>
ro: %s <FIȘIER>
tr: %s <DOSYA>
uk: %s <ФАЙЛ>

source: Execute commands from file
ca: Executeu ordres des del fitxer
ro: Execută comenzi din fișier
tr: Dosyadan komutları çalıştır
uk: Виконати команду з файла

source: Send output to a file or |pipe
ca: Envia la sortida a un fitxer o |canonada
ro: Trimite ieșirea la un fișier sau |conexiune
tr: Çıktıyı bir dosyaya ya da |boruya gönder
uk: Надіслати виведені дані до файла або каналу обміну даними

source: %s [<TEXT>]
tr: %s [<METİN>]
uk: %s [<ТЕКСТ>]

source: Print TEXT or an empty line to standard output
ca: Imprimeix text o una línia buida a la sortida estàndard
ro: Tipărește TEXT sau o linie goală în ieșirea standard
tr: METİN i veya boş bir satırı standart çıktıya yaz
uk: Вивести ТЕКСТ або порожній рядок до стандартного виведення

source: Send TEXT or an empty line to current output stream
ca: Envia text o una línia buida al flux de sortida actual
ro: Trimite TEXT sau o linie goală către fluxul de ieșire curent
tr: METİNİ veya boş bir satırı geçerli çıktı akışına yaz
uk: Надіслати ТЕКСТ або порожній рядок до поточного потоку виведення даних

source: %s [<DIR>]
tr: %s [<DİZİN>]
uk: %s [<КАТАЛОГ>]

source: Change the current working directory
ca: Canvia el directori de treball actual
ro: Modifică dosarul în care se rulează curent
tr: Geçerli çalışma dizinini değiştir
uk: Змінити поточний робочий каталог

source: Show usage and distribution terms
ca: Mostra les condicions d'ús i de distribució
ro: Afișează termenii de utilizare și distribuție
tr: Kullanım ve dağıtım kurallarını göster
uk: Показати дані щодо користування і умов розповсюдження

source: %s [<NAME> [<VALUE>]]
ro: %s [<NUME> [<VALOARE>]]
tr: %s [<AD> [<DEĞER>]]
uk: %s [<НАЗВА> [<ЗНАЧЕННЯ>]]

source: Set or show an option, or list all options
ca: Configura o mostra una opció o llista totes les opcions
ro: Stabilește sau afișează o opțiune, sau listează toate opțiunile
tr: Bir seçeneği ayarla ya da göster, veya tüm seçenekleri listele
uk: Встановити або показати параметра або список усіх параметрів

source: %s [<NAME>]
ro: %s [<NUME>]
tr: %s [<AD>]
uk: %s [<НАЗВА>]

source: Show a piece of information, or all information about the connection
ca: Mostra tota la informació sobre la connexió o una part
tr: Bir parça bigi göster ya da bağlantı hakkındaki tüm bilgiyi göster
uk: Показати частину або усю інформацію щодо з'єднання

source: Query buffer & query favorites
ca: Memòria intermèdia de consulta i consultes preferides
ro: Memorie interogare și favorite interogare
tr: Sorgu tamponu & sorgu favorileri
uk: Буфер запитів і вибрані записи запитів

source: Edit the query buffer (or file) with external editor
ca: Edita la memòria intermèdia de consulta (o fitxer) amb un editor extern
ro: Editează amortizorul interogării (sau fișierul) cu un editor extern
tr: Harici bir düzenleyiciyle sorgu tamponunu (ya da dosyasını) düzenle
uk: Редагувати буфер запитів (або файл) за допомогою зовнішнього редактора

source: Reset the query buffer (or load file into query buffer)
ca: Restabliu la memòria intermèdia de consulta (o carregueu el fitxer a la memòria intermèdia de consulta)
ro: Restabilește memoria interogării (sau încarcă fișierul în memoria interogării)
tr: Sorgu tamponunu (veya dosyadan içine yükle) sıfırla
uk: Скинути буфер запитів (або завантажити файл до буфера запитів)

source: Show the contents of the query buffer
ca: Mostra el contingut de la memòria intermèdia de consulta
ro: Afișează conținuturile amortizorului de interogare
tr: Sorgu tamponunun içeriğini göster
uk: Показати вміст буфера запитів

source: %s [<FAVORITE_NAME>]
ro: %s [<NUME_FAVORIT>]
tr: %s [<FAVORI_ADI>]
uk: %s [<НАЗВА_ВИБРАНОГО>]

source: Execute contents of query buffer, or execute specified query favorite
ca: Executa el contingut de la memòria intermèdia de consulta o executa el preferit de consulta especificat
ro: Execută conținuturile memoriei de interogare, sau execută interogarea specificată favorită
tr: Sorgu tamponunun içeriğini ya da belirli bir favori sorguyu çalıştır
uk: Виконати вміст буфера запитів або виконати вказаний вибраний запис запитів

source: Write query buffer to file
ca: Escriu la memòria intermèdia de consulta al fitxer
ro: Scrie amortizorul de interogare la fișier
tr: Sorgu tamponunu dosyaya yaz
uk: Записати буфер запиту до файла

source: %s <FAVORITE_NAME>
ro: %s <NUME_FAVORIT>
tr: %s <FAVORİ_ADI>
uk: %s <НАЗВА_ВИБРАНОГО>

source: Save query buffer as favorite
ca: Desa la memòria intermèdia de consulta com a preferit
ro: Salvează memoria interogării ca favorit
tr: Sorgu tamponunu favori olarak kaydet
uk: Зберегти буфер запиту як вибраний запис

source: Load a query favorite into query buffer
ca: Carrega una consulta preferida a la memòria intermèdia de consulta
ro: Încarcă favorita interogării în memoria interogării
tr: Bir favori sorguyu sorgu tamponuna yaz
uk: Завантажити вибраний запис запиту до буфера запитів

source: Delete a query favorite
ca: Eliminar una consulta preferida
ro: Șterge favorita interogării
tr: Favori sorgusunu sil
uk: Вилучити вибраний запис запиту

source: List all query favorites
ca: Llista tots els preferits de la consulta
ro: Listează toți favoriții cererii
tr: Tüm favori sorguları listele
uk: Вивести список усіх вибраних записів запиту

source: Set output format
ca: Estableix el format de sortida
ro: Stabilește formatul de ieșire
tr: Çıktı biçimi ayarla
uk: встановити формат виведення даних

source: %s [<NAME>|<TABLE> <COLUMN> <ROW_CONDITION>] <FILE>
ro: %s [<NUME>|<TABEL> <COLOANĂ> <CONDIȚIA_RÂNDULUI>] <FIȘIER>
tr: %s [<AD>|<TABLO> <SÜTUN> <SATIR_DURUMU>] <DOSYA>
uk: %s [<НАЗВА>|<ТАБЛИЦЯ> <СТОВПЧИК> <УМОВА_РЯДКА>] <ФАЙЛ>

source: Export internal parameter or table's value to the FILE file
ca: Exporta el paràmetre intern o el valor de la taula al fitxer FILE
ro: Exportă parametrul intern sau valoarea tabelei în fișierul FILE
tr: İç parametreleri ya da tablonun değerlerinin DOSYA dosyasına aktar
uk: Експортувати значення внутрішнього параметра або таблиці до файла ФАЙЛ

source: Execution context
ca: Context d'execució
ro: Contextul execuției
tr: Çalışma içeriği
uk: Контекст виконання

source: %s [<NAME> [<VALUE>|_null_]]
ro: %s [<NUME> [<VALOARE>|_null_]]
tr: %s [<AD> [<DEĞER>|_null_]]
uk: %s [<НАЗВА> [<ЗНАЧЕННЯ>|_null_]]

source: Set or show internal parameter, or list all if no parameter specified
ca: Definiu o mostreu el paràmetre intern o enumereu-ne tot si no s'especifica cap paràmetre
ro: Stabilește sau afișează parametrul intern, sau listează toate dacă nu există parametri
tr: İç parametreyi ayarla ya da göster, parametre belirtilmemişse tümünü listele

source: Unset (delete) internal named parameter (or all parameters)
ca: Eliminar (unset) el paràmetre intern (o tots els paràmetres)
ro: Destabilește (șterge) parametrul intern denumit (sau toți parametrii)
tr: İç adlandırılmış parametreyi sil (veya tüm parametreleri)

source: %s <NAME> [<FILE>|<TABLE> <COLUMN> <ROW_CONDITION>]
ro: %s <NUME> [<FIȘIER>|<TABEL> <COLOANĂ> <CONDIȚIE_RÂND>]
tr: %s <AD> [<DOSYA>|<TABLO> <SÜTUN> <SATIR_DURUMU>]
uk: %s <НАЗВА> [<ФАЙЛ>|<ТАБЛИЦЯ> <СТОВПЧИК> <УМОВА_НА_РЯДКИ>]

source: Set internal parameter as the contents of the FILE file or from an existing table's value
ca: Definiu el paràmetre intern com a contingut del fitxer FILE o com a valor de la taula existent
ro: Stabilește parametrul intern ca fiind conținuturile fișierului FILE sau de la o valoare de tabelă existentă
tr: DOSYA dosyasının içeriği olarak iç parametre veya var olan bir tablonun değerinden ayarla

source: %s <SELECT> <ROW_FIELDS> [<COLUMN_FIELDS> [<DATA_FIELDS> ...]]
ro: %s <SELECT> <CÂMPURI_RÂND> [<CÂMPURI_COLOANĂ> [<CÂMPURI_DATE> ...]]
tr: %s <SELECT> <SATIR_ALANLARI> [<SÜTUN_ALANLARI> [<VERİ_ALANLARI> ...]]

source: Performs a statistical analysis on the data from SELECT, using ROW_FIELDS and COLUMN_FIELDS criteria and optionally DATA_FIELDS for the data
ca: Realitza una anàlisi estadística de les dades del SELECT usant criteris de "CAMPS_DE_FILES i CAMPS_DE_COLUMNES i, opcionalment, CAMPS_DE_DADES per les dades"
ro: Efectuează o analiză statistică a datelor din SELECT, utilizând criteriile ROW_FIELDS și COLUMN_FIELDS și opțional DATA_FIELDS pentru date
tr: SELECT üzerinden gelen veride istatistiksel analiz yapar, SATIR_ALANLARI ve SÜTUN_ALANLARI kriterlerini kullanır ve isteğe bağlı olarak veri için VERİ_ALANLARI nı da kullanabilir

source: Datasets' manipulations
ca: Manipulacions de conjunts de dades
ro: Manipulările setului de date
tr: Veri kümelerinin manipülasyonu
uk: Маніпуляції наборів даних

source: Lists all the datasets kept in memory for reference
ca: Llista tots els conjunts de dades guardats a la memòria per a la seva referència
ro: Listează toate seturile de date păstrate în memorie prin referință
tr: Kaynak için bellekte tutulan tüm veri kümelerini listeler
uk: Виводить список усіх наборів даних, які зберігаються у пам'яті із довідковою метою

source: %s <DATASET NAME> <PATTERN>
ro: %s <NUMELE SETULUI DE DATE> <MOSTRĂ>
tr: %s <VERİKÜMESİ_ADI> <DESEN>
uk: %s <НАЗВА НАБОРУ ДАНИХ> <ВЗІРЕЦЬ>

source: Show a dataset's contents where lines match a regular expression
ca: Mostra el contingut d'un conjunt de dades quan les línies coincideixen amb una expressió regular
ro: Arată conținutul unui set de date unde liniile se potrivesc unei expresii regulate
tr: Düzenli ifade ile eşleşen satırların veri kümesinin içeriğini göster
uk: Показати вміст набору даних, де рядки відповідають формальному виразу

source: %s <DATASET NAME> [<COLUMN> [<COLUMN> ...]]
ro: %s <NUMELE SETULUI DE DATE> [<COLOANĂ> [<COLOANĂ> ...]]
tr: %s <VERİKÜMESİ_ADI> [<SÜTUN> [<SÜTUN> ...]]
uk: %s <НАЗВА НАБОРУ ДАНИХ> [<СТОВПЧИК> [<СТОВПЧИК> ...]]

source: Show a dataset's contents, showing only the specified columns if any specified
ca: Mostra el contingut d’un conjunt de dades, mostrant només les columnes especificades si s'especifica
ro: Arată conținutul unui set de date, arătând numai colonele specificate
tr: Bir veri kümesinin içeriğini göster, varsa yalnızca belirtilmiş olan sütunları göster

source: %s <DATASET NAME> [<DATASET NAME> ...]
ro: %s <NUME SET DE DATE> [<NUME SET DE DATE> ...]
tr: %s <VERİKÜMESİ_ADI> [<VERİKÜMESİ_ADI> ...]

source: Remove one or more datasets
ca: Elimina un o més conjunts de dades
ro: Elimină unul sau mai multe seturi de date
tr: Bir veya daha fazla veri kümesini sil
uk: Вилучити один або декілька наборів даних

source: %s <DATASET NAME> <DATASET NAME>
ro: %s <NUMELE SETULUI DE DATE> <NUMELE SETULUI DE DATE>
tr: %s <VERİKÜMESİ_ADI> <VERİKÜMESİ_ADI>

source: Rename a dataset, useful to rename the '_' dataset to keep it
ca: Canvia el nom d'un conjunt de dades. Útil per a canviar el nom del conjunt de dades «_» i conservar-lo
ro: Redenumește setul de date, folositor la redenumirea setului de date „_” pentru a-l păstra
tr: Veri kümesini yeniden adlandır, '_' olarak yeniden adlandırmak, onları tutmak için kullanışlıdır

source: %s CSV <FILE NAME>
ro: %s CSV <NUME FIȘIER>
tr: %s CSV <DOSYA ADI>
uk: %s CSV <НАЗВА ФАЙЛА>

source: Import a dataset from a file
ca: Importeu un conjunt de dades des d’un fitxer
ro: Importă un set de date dintr-un fișier
tr: Dosyadan bir veri kümesini içeri aktar
uk: Імпортувати набір даних з файла

source: %s <filter> [<base|onelevel|subtree> [<base DN>]]
ca: %s <filter> [<base|un_nivell|subarbre> [<base DN>]]
ro: %s <filtru> [<base|onelevel|subtree> [<DN de bază>]]
tr: %s <süzgeç> [<ana|duzey|altagac> [<ana DN>]]
uk: %s <фільтр> [<base|onelevel|subtree> [<базова НД>]]

source: Search LDAP entries
ca: Cercar entrades LDAP
ro: Caută intrări LDAP
tr: LDAP girdisi ara
uk: Шукати записи LDAP

source: Shows attributes for the entry identified by its DN. If the "set" 2nd parameter is passed, then all set attributes are shown, if the "all" 2nd parameter is passed, then the unset attributes are also shown, and if the "unset" 2nd parameter is passed, then only non set attributes are shown.
ca: Mostra els atributs per a l'entrada identificada pel seu DN. Si es posa «set» com a 2n paràmetre, es mostren tots els atributs establerts; si es posa «all» com a 2n paràmetre també es mostren els atributs no establerts i si es posa «unset» com a 2n paràmetre, només es mostren els atributs no establerts.
tr: DN tarafından belirlenmiş girdi için öznitelikleri gösterir. Eğer 2. parametre "set" ise, tüm ayarlanmış öznitelikler gösterilir, "all" ise tüm öznitelikler gösterilir, "unset" ise yalnızca ayarlanmamış öznitelikler gösterilir.

source: %s <DN> <new DN>
ro: %s <DN> <DN nou>
tr: %s <DN> <yeni DN>
uk: %s <DN> <нова DN>

source: Renames an LDAP entry
ca: Canvia el nom d'una entrada LDAP
ro: Redenumește o intrare LDAP
tr: LDAP girdisini yeniden adlandırır
uk: Перейменовує запис LDAP

source: %s <DN> <OPERATION> [<ATTR>[=<VALUE>]] [<ATTR>=<VALUE> ...]
ro: %s <DN> <OPERAȚIE> [<ATRIBUT>[=<VALOARE>]] [<ATRIBUT>=<VALOARE> ...]
tr: %s <DN> <İŞLEM> [<ÖZNİTELİK>[=<DEĞER>]] [<ÖZNİTELİK>=<DEĞER> ...]
uk: %s <DN> <ДІЯ> [<АТРИБУТ>[=<ЗНАЧЕННЯ>]] [<АТРИБУТ>=<ЗНАЧЕННЯ> ...]

source: Modifies an LDAP entry's attributes; <OPERATION> may be DELETE, REPLACE or ADD
ca: Modifica els atributs d'una entrada LDAP; <OPERATION> pot ser DELETE, REPLACE o ADD
ro: Modifică atributele de intrare LDAP; <OPERAȚIE> poate fi DELETE, REPLACE sau ADD
tr: Bir LDAP girdisinin özniteliklerini değiştirir; <İŞLEM> DELETE, REPLACE veya ADD olabilir
uk: Змінює атрибути запису LDAP; записом <ДІЯ> може бути DELETE, REPLACE або ADD

source: History is not supported
ca: L'historial no és compatible
ro: Istoricul nu este suportat
tr: Geçmiş desteklenmiyor
uk: Підтримки журналу не передбачено

source: No current connection
ca: No hi ha cap connexió
ro: Nicio conexiune curentă
tr: Geçerli bir bağlantı yok
uk: Немає поточного з'єднання

source: List of tables
ca: Llista de taules
ro: Listă de tabele
tr: Tabloların listesi
uk: Список заголовків

source: List of views
ca: Llista de vistes
ro: Listă de vizualizări
tr: Görünümlerin listesi
uk: Список переглядів

source: List of schemas
ca: Llista d’esquemes
ro: Listă de scheme
tr: Şemaların listesi
uk: Список структур
