Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Can't open file '%s' for reading: %s
ca: No es pot obrir «%s» per a llegir-hi: %s
ro: Nu se poate deschide fișierul „%s” pentru scriere: %s
tr: Okuma için '%s' dosyası açılamıyor: %s
uk: Не вдалося відкрити файл «%s» для читання: %s

source: not enforced
ca: no obligatori
ro: neîncurajat
tr: uygulanmamış
uk: не примусово

source: stop with error
ca: parar amb error
ro: oprește cu eroare
tr: hata ile durmuş
uk: зупинитися з помилкою

source: stop with error, not deferrable
ca: parar amb error, no ajornable
ro: oprește cu eroare, nu poate fi amânat
tr: hata ile durmuş, ertelenebilir değil
uk: зупинено з помилкою, затримка є неприпустимою

source: cascade changes
ca: Canvis en cascada
ro: modificări de tip cascadă
tr: kaskad değişiklikleri
uk: каскадні зміни

source: set to NULL
ca: estableix a NULL
ro: setează la NULL
tr: NULL olarak ayarla
uk: встановити NULL

source: set to default value
ca: assignar el valor per defecte
ro: setează la valoarea implicită
tr: öntanımlı değer olarak ayarla
uk: встановити типове значення

source: Syntax error
ca: Error de sintaxi
tr: Sözdizimi hatası
uk: Синтаксична помилка

source: Bound connection is used
ca: S'està fent servir una connexió vinculada
ro: Conexiunea de legătură este utilizată
tr: Bağlı bağlantı kullanılmış
uk: Використано пов'язане з'єднання

source: Virtual connection using this connection is busy
ca: La connexió virtual que utilitza aquesta connexió està ocupada
ro: Conexiunea virtuală care utilizează această conexiune este ocupată
tr: Bu bağlantıyı kullanan sanal bağlantı yoğun
uk: Віртуальне з'єднання, яке використовує це з'єднання, зайнято

source: Authentication required
ca: Cal autenticació
ro: Necesită autentificare
tr: Kimlik doğrulaması gerekli
uk: Слід пройти розпізнавання

source: Enter authentification token as set from console, or leave empty if none required
ca: Introduïu el testimoni d'autenticació com s'ha establert des de la consola, o deixeu buit si no és necessari
ro: Introduceți semnul de autentificare așa cum este stabilit de la consolă, sau lăsați liber dacă nu este necesar niciunul
tr: Konsol kullanarak kimlik doğrulama jetonu girin, gerekli değilse boş bırakın
uk: Введіть жетон розпізнавання, як встановлено з консолі, або не заповнюйте, якщо жетон не потрібен

source: Token:
ca: Testimoni:
ro: Semn:
tr: Jeton:
uk: Ключ:

source: SQL console:
ca: Consola SQL:
ro: Consolă SQL:
tr: SQL konsolu:
uk: Консоль SQL:

source: Tables
ca: Taules
ro: Tabele
tr: Tablolar
uk: Таблиці

source: Tables in the '%s' schema
ca: Taules a l'esquema «%s»
ro: Tabele în schema „%s”
tr: '%s' şemasındaki tablolar
uk: Таблиці у схемі «%s»

source: Views
ca: Vistes
ro: Vizualizări
tr: Görünümler
uk: Відображення

source: Views in the '%s' schema
ca: Vistes a l'esquema «%s»
ro: Vizualizări în schema „%s”
tr: '%s' şemasındaki görünümler
uk: Перегляди у схемі «%s»

source: Columns for the '%s' table:
ca: Columnes per a la taula «%s»:
ro: Coloane pentru tabela „%s”:
tr: '%s' tablosunun sütunları:
uk: Стовпчики для таблиці «%s»:

source: Primary key:
ca: Clau primària:
ro: Cheie primară:
tr: Birincil anahtar:
uk: Основний ключ:

source: Relations:
ca: Relacions:
ro: Relații:
tr: İlişkiler:
uk: Зв'язки:

source: Foreign keys:
ca: Claus externes:
ro: Chei străine:
tr: Yabancı anahtarlar:
uk: Сторонні ключі:

source: To '%s':
ca: A «%s»:
ro: La „%s”:
tr: Alıcı '%s':
uk: До «%s»:

source: View definition:
ca: Definició de la vista:
ro: Definiția vizualizării:
tr: Görünüm tanımlaması:
uk: Визначення перегляду:

source: Trigger '%s' for the '%s.%s' table:
ca: Activador «%s» de la taula «%s.%s»:
ro: Declanșatorul „%s” pentru tabela „%s.%s”:
tr: '%s' tetikleyicisi, '%s.%s' tablosu için:

source: Trigger fired for: %s
ca: Activador executat per a: %s
ro: Declanșator pornit pentru: %s
tr: Tetikleyici şunun için çalışacak: %s

source: Time at which the trigger is fired: %s
ca: Hora a la qual s'executa l'activador: %s
ro: Timpul la care desclanșatorul este pornit: %s
tr: Tetikleyicinin çalışacağı zaman: %s
uk: Час вмикання перемикача: %s

source: Action:
ca: Acció:
ro: Acțiune:
tr: Eylem:
uk: Дія:

source: Triggers:
ca: Activadors:
ro: Declanșatoare:
tr: Tetikleyiciler:
uk: Перемикачі:

source: For the '%s.%s' table:
ca: Per a la taula «%s.%s»:
ro: Pentru tabela „%s.%s”:
tr: '%s.%s' tabloları için:
uk: Для таблиці «%s.%s»:

source: Triggers in the '%s' schema:
ca: Activadors a l'esquema «%s»:
ro: Declanșatoarele din schema „%s”:
tr: '%s' şemasındaki tetikleyiciler:
uk: Перемикачі у структурі «%s»:

source: Database information for '%s'
ca: Informació de la base de dades per «%s»
ro: Informații din baza de date pentru „%s”
tr: '%s' için veri tabanı bilgileri
uk: Дані щодо бази даних для «%s»

source: Database information
ca: Informació de la base de dades
ro: Informații din baza de date
tr: Veri tabanı bilgileri
uk: Відомості щодо бази даних

source: Objects
ca: Objectes
ro: Obiecte
tr: Nesneler
uk: Об'єкти

source: Triggers
ca: Activadors
ro: Declanșatoare
tr: Tetikleyiciler
uk: Перемикачі

source: Command is incomplete
ca: L'ordre no està completa
ro: Comanda nu este completă
tr: Komut tamamlanmadı
uk: Команда є неповною

source: Gda server operations list
ca: Llista d’operacions del servidor Gda
ro: Listă cu operațiile serverului gda
tr: Gda sunucu işlemleri listesi
uk: Список дій для сервера Gda

source: Using XML descriptions in %s
ca: S'estan utilitzant les descripcions XML a %s
ro: Se utilizează descrierile XML în %s
tr: %s içinde XML tanımlamaları kullan
uk: Використовуємо описи XML у %s

source: Could not create provider object: %s
ca: No s'ha pogut crear l'objecte del proveïdor: %s
ro: Nu s-a putut crea obiectul furnizor: %s
tr: Sağlayıcı nesne oluşturulamadı: %s
uk: Не вдалося створити об'єкт постачальника: %s

source: Existing operation types for provider '%s':
ca: Tipus d’operacions existents per al proveïdor «%s»:
ro: Tipurile de operații existente pentru furnizorul „%s”:
tr: '%s' sağlayıcısı için var olan işlem türleri:
uk: Наявні типи дій для надавача даних «%s»:

source: Existing operation types:
ca: Tipus d’operacions existents:
ro: Tipurile de operații existente:
tr: Var olan işlem türleri:
uk: Наявні типи дій:

source: Description for type: %s
ca: Descripció del tipus: %s
ro: Descrierea pentru tipul: %s
tr: Tür için açıklama: %s
uk: Опис для типу: %s

source: Operation not supported
ca: L'operació no és compatible
ro: Operația nu este suportată
tr: İşlem desteklenmiyor
uk: Підтримки дії не передбачено

source: Error: %s
ro: Eroare: %s
tr: Hata: %s
uk: Помилка: %s

source: Can't parse file '%s', ignoring it
ca: No es pot analitzar el fitxer «%s», ignorant-lo
ro: Nu se poate analiza fișierul „%s”, se ignoră
tr: '%s' dosyası ayrıştırılamıyor, gözardı ediliyor
uk: Не вдалося обробити файл «%s», ігноруємо його

source: YY
ca: AA
ro: AA
uk: РР

source: YYYY
ca: AAAA
ro: AAAA
uk: РРРР

source: <non-printable>
uk: <непридатний-до-друку>

source: Tablespace
ca: Espai de taules
ro: Spațiu de tabelă
uk: Простір таблиці

source: Predicate
ca: Predicat
ro: Predicat
uk: Предикат

source: Id
uk: Ід

source: Type mismatch for column %d: «%s» and '%s'
ca: Els tipus de la columna %d no coincideixen: «%s» i «%s»

source: CREATE_TABLE
ca: CREAR_TAULA

source: UTF-8 Unicode
ca: Unicode UTF-8
ro: Unicode UTF-8

source: UCS-2 Unicode
ca: Unicode UCS-2
ro: Unicode UCS-2

source: Base 64
ro: Baza 64

source: Berkeley DB
ro: DB Berkeley

source: InnoDB
ro: DBInno
