Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Controls whether the password is stored encrypted in the system catalogs. If the presented password string is already in MD5-encrypted format, then it is stored encrypted as-is.
ca: Controla si la contrasenya s'emmagatzema xifrada als catàlegs del sistema. Si la cadena de contrasenya presentada ja està en format xifrat MD5, es guardarà xifrada tal com és.
ro: Controlează dacă parola este stocată criptată în cataloagele de sistem. Dacă șirul de parolă prezentat este deja în formatul de criptare MD5, atunci ea este stocată criptată așa cum se află.
tr: Parolanın, sistem kataloglarında şifrelenmiş olarak saklanmasını denetler. Eğer belirtilen parola dizgesi zaten MD5-encrypted biçiminde ise, olduğu gibi saklanır.

source: Database superuser
ca: Usuari primari de la base de dades
ro: Superutilizator de bază de date
tr: Veri tabanı yöneticisi adı
uk: Надкористувач бази даних

source: Set to TRUE if the role is a database superuser
ca: Posar en TRUE si el rol és d'un usuari primari de la base de dades
ro: Stabilește la TRUE dacă rolul este un superutilizator al bazei de date
tr: Rol, veri tabanı yöneticisi ise TRUE olarak ayarla
uk: Встановіть значення TRUE, якщо роллю є «надкористувач бази даних»

source: Can create databases
ca: Pot crear bases de dades
ro: Poate crea baze de date
tr: Veri tabanı oluşturabilir
uk: Можна створити бази даних

source: Set to TRUE if the role is allowed to create databases
ca: Posar en TRUE si el rol permet crear bases de dades
ro: Stabilește la TRUE dacă îi este permis rolului de a crea baze de date
tr: Veri tabanı oluşturabilen bir rol ise TRUE olarak ayarla
uk: Встановіть значення TRUE, якщо ролі дозволено створення баз даних

source: Can create roles
ca: Pot crear rols
ro: Poate crea roluri
tr: Rol oluşturabilir
uk: Можна створити ролі

source: Set to TRUE if the role is allowed to create roles
ca: Configura a TRUE si es permet al rol crear rols
ro: Stabilește la TRUE dacă îi este permis rolului de a crea roluri noi
tr: Rolün rol oluşturma izni varsa, TRUE olarak ayarla
uk: Встановіть значення TRUE, якщо ролі дозволено створення ролей

source: Inherit
ca: Herència
ro: Moștenește
tr: Miras
uk: Спадок

source: Set to TRUE if the created role inherits the privileges of roles it is a member of
ca: Establir a TRUE si el rol creat hereta els privilegis dels rols dels quals és membre
ro: Stabilește la TRUE dacă rolul creat moștenește privilegiile rolurilor în care este membru
tr: Rol haklarını üyesi olduğu rolden miras aldıysa, TRUE olarak ayarla
uk: Встановіть значення TRUE, якщо створена роль успадковує права доступу ролей, учасником яких вона є

source: Can login
ca: Pot entrar
ro: Se poate autentifica
tr: Giriş yapabilir
uk: Може входити

source: Set to TRUE if the role is allowed to log in
ca: Establir a TRUE si es permet iniciar sessió al rol
ro: Stabilește la TRUE dacă îi este permis rolului autentificarea
tr: Rolün giriş yapma izni varsa, TRUE olarak ayarla
uk: Встановіть TRUE, якщо ролі дозволено входити

source: Login limit
ca: Límit d'entrada
ro: Limită de autentificare
tr: Giriş sınırı
uk: Обмеження входу

source: If the role is allowed to log in, defines the number of concurrent connections the role can make (-1 or unset for unlimited)
ca: Si es permet iniciar sessió al rol, defineix el nombre de connexions concurrents que el rol pot realitzar (-1 o sense establir per a connexions il·limitades)
ro: Dacă rolului îi este permisă autentificarea, definește numărul de conexiuni concurente pe care rolul poate să le realizeze (-1 sau destabilit pentru nelimitat)
tr: Eğer rolün giriş yapma izni var ise, yapabileceği eş zamanlı giriş sayısını tanımlar (-1 veya boş bırakırsanız sınırsız olur)

source: Valid until
ca: Vàlid fins
ro: Valid până când
tr: Geçerlilik süresi
uk: Строк дії

source: Specifies an expiration time for a password only (not for the user account per se: the expiration time is not enforced when logging in using a non-password-based authentication method)
ca: Especifica un temps d'expiració per a una contrasenya (no per al compte d'usuari en si: el temps de termini no es reforça a l'iniciar sessió fent servir un mètode d'autenticació no basat en contrasenya)
ro: Specifică un timp de expirare doar pentru o parolă (nu pentru contul de utilizator pe se: timpul de expirare nu este aplicat atunci când se autentifică utilizând o metodă de autentificare care nu se bazează pe o parolă)
tr: Parolalı giriş için sonlanma zamanını belirtir (yalnızca kullanıcı hesapları için değildir, parola olmayan giriş yöntemleri böyle bir zaman tanımlanmamıştır)

source: Member of
ca: Membre de
ro: Membru al
tr: Üyesi
uk: Член

source: Existing roles to which the new role will be immediately added as a new member
ca: Rols existents als quals s'afegirà immediatament l'usuari com a membre nou
ro: Rolurile existente la care rolul nou va fi adăuga imediat ca un membru nou
tr: Yeni bir üye olarak henüz eklenmiş rol için var olan roller
uk: Наявні ролі, до яких нову роль буде негайно додано як нового учасника

source: Role
ca: Rol
ro: Rol
tr: Rol
uk: Роль

source: Existing role
ca: Rol existent
ro: Rol existent
tr: Var Olan Rol
uk: Наявна роль

source: Role's members
ca: Membres del rol
ro: Membrii rolului
tr: Rolün üyeleri
uk: Учасники ролі

source: Lists one or more existing roles which are automatically added as members of the new role
ca: Llista un o més rols existents que s'afegeixen automàticament com a membres del nou rol
ro: Enumeră unul sau mai multe roluri existente care sunt automat adăugate ca membri ale rolului nou
tr: Yeni rolün üyeleri olarak kendiliğinden eklenmiş, bir veya daha fazla var olan rollerin listesi

source: Role's admins
ca: Administradors del rol
ro: Administratorii rolului
tr: Rollerin yöneticileri
uk: Адміністратори ролі

source: Lists one or more existing roles which are automatically added as members of the new role, giving them the right to grant membership in this role to others
ca: Llista un o més rols existents que s'afegeixen automàticament com a membres del nou rol, donant-los el dret d’atorgar la pertinença a aquest paper a altres persones
ro: Enumeră unul sau mai multe roluri existente care sunt adăugate automat ca membri ale noului rol, oferindu-le dreptul de a acorda calitatea de membru în acest rol pentru altele
tr: Yeni rolün üyeleri olarak kendiliğinden eklenmiş, bir veya daha çok var olan rollerin listesi, diğer rollerde tüm hakları verin

source: Parent table(s)
ca: Taula(es) pare
ro: Tabelă părinte
tr: Üst tablo(lar)
uk: Батьківські таблиці

source: Inheritance
ca: Herència
ro: Moștenire
tr: Miras
uk: Успадкування

source: Parent table
ca: Taula pare
ro: Tabelă superioară
tr: Üst tablo
uk: Батьківська таблиця

source: Keep coupled
ca: Conserva emparentat
ro: Păstreză cuplat
tr: Birleşik tut
uk: Лишати пов'язаним

source: Use INHERIT instead of LIKE
ca: Utilitza «INHERIT» (herència) en lloc de «LIKE» (semblant)
ro: Utilizează INHERIT în loc de LIKE
tr: LIKE yerine INHERIT kullan
uk: Використовувати INHERIT замість LIKE

source: Copy defaults
ca: Copia les opcions per defecte
ro: Copiază implicite
tr: Öntanımlı değerleri kopyala
uk: Копіювати типове

source: Copy default expressions
ca: Copia les expressions per defecte
ro: Copiază expresii implicite
tr: Varsayıla ifadeleri kopyala
uk: Копіювати типові вирази

source: Deferrable
ca: Ajornable
ro: Poate fi amânat
tr: Ertelenebilir
uk: Затримний

source: Set to default
ca: Estableix com a per defecte
ro: Stabilește ca implicit
tr: Öntanımlı olarak ayarla
uk: Типове значення

source: Not deferrable
ca: No ajornable
ro: Nu poate fi amânat
tr: Ertelenemez
uk: Незатримний

source: Deferrable initially immediate
ca: Diferit inicialment immediat
ro: Inițial poate fi amânat imediat
tr: Hemen başlangıçta ertelenebilir

source: Deferrable initially deferred
ca: Diferible inicialment diferit
ro: Inițial poate fi amânat mai tâziu
tr: Ertelenebilir başlangıçta ertelenmiş

source: User's definition
ca: Definició de l'usuari
ro: Definiția utilizatorului
tr: Kullanıcının tanımlaması
uk: Визначення користувача

source: User's name
ca: Nom de l'usuari
ro: Numele utilizatorului
tr: Kullanıcı adı
uk: Ім'я користувач

source: User's password
ca: Contrasenya de l'usuari
ro: Parola utilizatorului
tr: Kullanıcı parolası
uk: Пароль користувача

source: User ID
ca: Identificador de l'usuari
ro: ID-ul utilizatorului
tr: Kullanıcı kimliği
uk: Ідентифікатор користувача

source: Can be used to choose the PostgreSQL user ID of the new user
ca: Es pot usar per a triar un identificador d'usuari PostgreSQL o un nou usuari
ro: Poate fi utilizat pentru a alege ID-ul PostgreSQL de utilizator pentru utilizatorul nou
tr: Yeni kullanıcının PostgreSQL kullanıcı kimliğini seçmek için kullanılabilir
uk: Можна використовувати для вибору ідентифікатора користувача PostgreSQL нового користувача

source: Set to TRUE if the user is allowed to create databases
ca: Posar en TRUE si a l'usuari se li permet crear bases de dades
ro: Stabilește la TRUE dacă utilizatorul are permisiunea de a crea baze de date
tr: Kullanıcının veri tabanı oluşturma izni varsa TRUE olarak ayarla
uk: Встановіть значення TRUE, якщо користувачеві дозволено створювати бази даних

source: Can create users
ca: Pot crear usuaris
ro: Poate crea utilizatori
tr: Kullanıcı oluşturabilir
uk: Можна створити користувачів

source: Set to TRUE if the user is allowed to create users
ca: Configureu en TRUE si es permet que l'usuari pugui crear usuaris
ro: Stabilește la TRUE dacă utilizatorul are permisiunea de a crea utilizatori
tr: Kullanıcının kullanıcı oluşturma izni varsa TRUE olarak ayarla
uk: Встановіть TRUE, якщо користувачеві дозволено створювати облікові записи користувачів

source: Existing groups to which the new user will be immediately added as a new member
ca: Grups existents als quals s'afegirà immediatament el nou usuari com a membre nou
ro: Grupurile existente la care utilizatorul nou va fi adăugat imediat ca un membru nou
tr: Yeni kullanıcının, yeni bir üye olarak ekleneceği var olan gruplar

source: User
ca: Usuari
ro: Utilizator
tr: Kullanıcı
uk: Користувач

source: Existing user
ca: Usuari existent
ro: Utilizator existent
tr: Var olan kullanıcı
uk: Наявний користувач

source: Replace if already exists
ca: Reemplaçar si ja existeix
tr: Zaten varsa değiştir
uk: Замінити, якщо вже існує

source: What to do with references on the column to delete
ca: Què fer amb les referències de la columna a eliminar
ro: Ce să faci cu referințele de pe coloana de șters
tr: Sütunda silinecek kaynaklar ile ne yapılacağı
uk: Що робити із посиланнями на стовпчик, який має бути вилучено

source: Automatically drop objects that depend on the column (CASCADE)
ca: Desplega automàticament objectes que depenen de la columna (CASCADE)
ro: Renunță automat la obiectele care depinde de coloana (CASCADE)
tr: Sütuna bağlı olarak nesneleri kendiliğinden sil (CASCADE)
uk: Автоматично відкидати об'єкти, які залежать від стовпчика (CASCADE)

source: Refuse to drop the column if any objects depend on it (RESTRICT)
ca: Refusar l'eliminació de la taula si qualsevol objecte depèn d'ella (RESTRICT)
ro: Refuză să renunți la coloană dacă există obiecte care depind de aceasta (RESTRICT)
tr: Herhangi bir nesne ona bağlı ise sütunu silmeyi reddet (RESTRICT)
uk: Відмовляти у викиданні стовпчика, якщо від нього залежить якісь об'єкти (RESTRICT)

source: The name of a database to drop
ca: Nom de la base de dades que se suprimirà
ro: Numele bazei de date la care se renunță
tr: Silinecek veri tabanının adı
uk: Назва бази даних для скидання

source: Drop role only if it exists
ca: Suprimeix el rol només en cas que existeixi
ro: Renunță la rol doar dacă există
tr: Varsa rolü sil

source: Drop user only if it exists
ca: Suprimeix l'usuari només en cas que existeixi
ro: Renunță la utilizator doar dacă există
tr: Yalnızca varsa kullanıcıyı sil

source: What to do with objects referencing the view
ca: Què fer amb els objectes que fan referència a la vista
ro: Ce să faci cu obiectele referențiate la vizualizare
tr: Nesnelerin görünümü gösterdiğinde ne yapılacağı

source: Automatically drop objects that depend on the view (CASCADE)
ca: Desplega automàticament objectes que depenen de la vista (CASCADE)
ro: Renunță automat la obiectele care depind de vizualizarea (CASCADE)
tr: Görünüme bağlı olarak nesneleri kendiliğinden sil (CASCADE)

source: Refuse to drop the view if any objects depend on it (RESTRICT)
ca: Rebutgeu deixar anar la vista si hi ha objectes que en depenen (RESTRICT)
ro: Refuză să renunți la vizualizare dacă există obiecte care depind de aceasta (RESTRICT)
tr: Ona bağlı herhangi bir nesne varsa, görünümü silmeyi reddet (RESTRICT)

source: Search Path
ca: Camí de cerca
ro: Caută cale
tr: Arama Yolu
uk: Шлях пошуку

source: Search path among database's schemas ('search_path' variable)
ca: Camí de cerca entre els esquemes de la base de dades («search_path» variable)
ro: Caută cale prin schemele bazei de date (variabila „search_path”)
tr: Veri tabanı şemaları arasındaki arama yolu ('search_path' değişkeni)

source: Connection timeout
ca: Retard de la connexió
ro: Conexiune expirată
tr: Bağlantı zaman aşımı
uk: Перевищено час очікування на з'єднання

source: Maximum wait for connection, in seconds. Zero or not specified means wait indefinitely. It is not recommended to use a timeout of less than 2 seconds
ca: Espera màxima de la connexió en segons. Zero o no especificat significa esperar indefinidament. No es recomana utilitzar un temps inferior a 2 segons
ro: Timpul maxim de așteptat pentru o conexiune, în secunde. Zero sau nespecificat înseamnă așteptare infinită. Nu este recomandată o limită de timp mai mică de 2 secunde
tr: Bağlantı için en çok beklenecek süre, saniye cinsinden. Sıfır ve ya boş sonsuz bekleme anlamındadır. 2 saniye altında bir bekleme süresi seçmeniz tavsiye edilmez

source: Mysql version 5.0 at least is required
ca: Es requereix almenys la versió 5.0 de MySQL
ro: Este necesar cel puțin Mysql versiunea 5.0
tr: En az Mysql sürüm 5.0 gereklidir

source: Can't import data from web server
ca: No es poden importar dades del servidor web
ro: Nu se pot importa date de la serverul web
tr: Web sunucusundan veri içeri aktarılamıyor

source: could not determine the indexed columns for index
ca: no s'han pogut determinar les columnes indexades per l'índex
ro: nu s-a putut determina coloanele indexate pentru indice
tr: indeks için indekslenmiş sütunlar belirlenemedi

source: Can't get version data from server: %s
ca: No es poden obtenir dades de la versió del servidor: %s
tr: Sunucudan sürüm verileri alınamıyor: %s

source: Internal Error: Can't calculate PostgreSQL version: %s
ca: Error intern: No es pot calcular la versió PostgreSQL: %s
tr: İç Hata: PostgreSQL sürümünü hesaplayamıyor: %s

source: Can't find sqlcipher.
ca: No es pot trobar sqlcipher.
tr: sqlcipher bulunamıyor.

source: Provider for SQLCipher
ca: Proveïdor de SQLCipher
ro: Furnizor pentru SQLCipher
tr: SQLCipher için sağlayıcı

source: Passphrase
ca: Contrasenya
ro: Parolă tip frază
tr: Parola metni
uk: Пароль

source: Encryption passphrase
ca: Xifrat de la contrasenya
ro: Parolă de criptare tip frază
tr: Şifreleme parola metni

source: Provider for SQLite databases
ca: Proveïdor per a bases de dades SQLite
ro: Furnizor pentru bazele de date SQLite
tr: SQLite veritabanları için sağlayıcı
uk: Постачальник для баз даних SQLite

source: Invalid HOST/SCRIPT '%s'
ca: AMFITRIÓ/SCRIPT «%s» no vàlid
ro: HOST/SCRIPT „%s” nevalid
tr: Geçersiz HOST/SCRIPT '%s'

source: The connection string must contain the %s value
ca: La cadena de connexió ha de contenir el valor %s
ro: Șirul de conexiune trebuie să conțină valoarea %s
tr: Bağlantı dizgesi, %s değerini içermek zorundadır

source: Server operations not yet implemented
ca: Les operacions del servidor encara no s'han implementat
ro: Operațiile de server nu sunt încă implementate
tr: Sunucu işlemleri henüz tanımlanmamış
uk: Операції на боці сервера ще не реалізовано

source: Named transaction is not supported
ca: La transacció amb nom no és compatible
ro: Tranzacția numită nu este suportată
tr: Adlandırılmış toplu işlem desteklenmiyor
uk: Підтримки іменованих транзакцій не передбачено

source: Transaction level is not supported
ca: El nivell de transacció no és compatible
ro: Nivelul de tranzacție nu este suportat
tr: Toplu işlem düzeyi desteklenmiyor
uk: Підтримки рівня транзакцій не передбачено

source: Unnamed savepoint is not supported
ca: El punt de recuperació sense nom no és compatible
ro: Punctul de salvare nedenumit nu este suportat
tr: Adlandırılmamış kaydetme noktası desteklenmiyor
uk: Підтримки точок збереження без назви не передбачено

source: Could not parse server's response
ca: No s'ha pogut analitzar la resposta del servidor
tr: Sunucunun cevabı ayrıştırılamadı
uk: Не вдалося обробити відповідь сервера

source: Invalid response hash
ca: Hash de resposta no vàlid
ro: Valoare de dispersie de răspuns nevalidă
tr: Geçersiz yanıt özeti
uk: Некоректний хеш відповіді

source: Could not parse server's reponse
ca: No s'ha pogut analitzar la resposta del servidor
ro: Nu s-a putut analiza răspunsul serverului
tr: Sunucunun cevabı ayrıştırılamadı
uk: Не вдалося обробити відповідь сервера

source: Can't start new thread
ca: No es pot iniciar el fil nou
ro: Nu se poate deschide un nou fir de execuție
tr: Yeni bir iş parçacığı başlatılamıyor
uk: Не вдалося започаткувати новий потік обробки

source: Could not run PHP script on the server
ca: No s'ha pogut executar l'script PHP al servidor
ro: Nu s-a putut rula scriptul PHP pe server
tr: Sunucuda PHP betiği çalıştırılamadı
uk: Не вдалося запустити скрипт PHP на сервері

source: The transaction has been automatically rolled back
ca: La transacció s'ha revertit automàticament
ro: Tranzacția a fost anulată automat
tr: Toplu işlem kendiliğinden geri alındı
uk: Транзакцію було автоматично відкочено

source: Error cleaning data on the server for session %s
ca: S'ha produït un error en netejar les dades del servidor de la sessió %s
ro: Eroare la curățarea datelor de pe server pentru sesiune: %s
tr: %s oturumu için sunucuda veri temizleme hatası
uk: Помилка під час спроби вилучення даних на сервері для сеансу %s

source: Non detailed error
ca: Error no detallat
ro: Eroare nedetaliată
tr: Ayrıntılandırılmamış hata
uk: Недеталізована помилка

source: Provider for web server proxies
ca: Proveïdor de proxies del servidor web
ro: Furnizor pentru proximizările serverului web
tr: Web sunucu vekilleri için sağlayıcı
uk: Надавач даних для проксі-серверів

source: Connection password as defined on the web server
ca: La contrasenya de connexió tal com es defineix al servidor web
ro: Parolă de conexiune așa cum este definită pe serverul web
tr: Sunucuda tanımlanmış bağlantı parolası
uk: Пароль до з'єднання, як його визначено на вебсервері

source: Web server name
ca: Nom del servidor web
ro: Numele serverului web
tr: Web sunucusu adı
uk: Назва вебсервера

source: The name of the web server which proxies connections
ca: El nom de servidor web que encamina les connexions dels servidors intermediaris
ro: Numele serverului web care proximizează conexiunea
tr: Vekil bağlantıları için olan web sunucusunun adı
uk: Назва вебсервера, який є проксі-сервером з'єднань

source: Web server port (leave this field empty for default)
ca: Port del servidor web (deixeu aquest camp buit per defecte)
ro: Portul serverului web (lasă acest câmp liber în mod implicit)
tr: Web sunucusu bağlantı noktası (öntanımlı değer için bu alanı boş bırakın)
uk: Порт вебсервера (не заповнюйте, якщо слід використовувати типовий)

source: Path to PHP script
ca: Camí a l'script PHP
ro: Calea la scriptul PHP
tr: PHP betiği yolu
uk: Шлях до скрипту PHP

source: The path of the script to use if service is not at the web server's root
ca: El camí de l'script a utilitzar si el servei no està a l'arrel del servidor web
ro: Calea scriptului de utilizat dacă serviciul nu este la administratorul serverului web
tr: Servis web sunucusun kök dizininde değilse, kullanılacak betiğin yolu
uk: Шлях до скрипту, яким слід скористатися, якщо служба не перебуває у корені вебсервера

source: Server secret
ca: Secret del servidor
ro: Secret server
tr: Sunucu gizli nesnesi
uk: Ключ сервера

source: The name of a database to use
ca: Nom de la base de dades que es farà servir
ro: Numele bazei de date de utilizat
tr: Kullanılacak veri tabanının adı
uk: Назва бази даних, якою слід скористатися

source: DSN '%s' is not declared
ca: El DSN «%s» no està declarat
ro: DSN „%s” nu este declarat
tr: DSN '%s' belirtilmemiş
uk: «%s» DSN не оголошено

source: Can't open connection to DSN %s: %s
ca: No es pot obrir la connexió a DSN %s: %s
ro: Nu se poate deschide conexiunea la DSN %s: %s
tr: %s DSN için bağlantı açılamıyor: %s
uk: Не вдалося відкрити з'єднання з DSN %s: %s

source: Can't open specified connection: %s
ca: No s'ha pogut establir la connexió proporcionada: %s
ro: Nu se poate deschide conexiunea specificată: %s
tr: Belirtilen bağlantı açılamıyor: %s
uk: Не вдалося відкрити вказане з'єднання: %s

source: Connection successfully opened!
ca: S'ha establert la connexió correctament
ro: Conexiunea a fost deschisă cu succes!
tr: Bağlantı başarıyla açıldı!
uk: З'єднання успішно відкрито!

source: Can't close connection: %s
ca: No es pot tancar la connexió: %s
tr: Bağlantı kapatılamıyor: %s
uk: Не вдалося закрити з'єднання: %s

source: Invalid unnamed command
ca: Ordre sense nom no vàlida
ro: Comandă nedenumită nevalidă
tr: Geçersiz adlandırılmamış komut
uk: Некоректна команда без назви

source: Command '%s' not found
ca: No s'ha trobat l'ordre «%s»
ro: Nu s-a găsit comanda „%s”
tr: '%s' komutu bulunamadı
uk: Команду «%s» не знайдено

source: Syntax error after '\'
ca: Error de sintaxi després de '\'
ro: Eroare de sintaxă după „\”
tr: Şundan sonra sözdizimi hatası '\'
uk: Синтаксична помилка після «\»

source: Unbalanced usage of quotes
ca: Ús de cometes no equilibrat
ro: Utilizare nebalansată a ghilimelelor
tr: Kotaların dengesiz kullanımı
uk: Незбалансоване використання лапок

source: Usage
ca: Ús
ro: Utilizare
tr: Kullanım
uk: Використання

source: Could not save history file to '%s': %s
ca: No s'ha pogut desar el fitxer d'historial «%s»: %s
ro: Nu s-a putut salva fișierul istoric la „%s”: %s
tr: Geçmiş dosyası şuraya yazılamadı '%s': %s
uk: Не вдалося зберегти журналу файл до «%s»: %s

source: Execution delay
ca: Retard d’execució
ro: Întârzierea execuției
tr: Çalışma gecikmesi
uk: Затримка виконання

source: (%d row)
ca: (%d fila)
ro: (%d rând)
tr: (%d satır)
uk: (%d рядок)

source: Number of rows impacted
ca: Nombre de files afectades
ro: Numărul de rânduri consolidate
tr: Etkilenen satırların sayısı
uk: Кількість задіяних рядків

source: For connection
ca: Per a la connexió
ro: Pentru conexiune
tr: Bağlantı için
uk: Для з'єднання

source: enter authentication information
ca: introduïu la informació d'autenticació
ro: introduceți informațiile de autentificare
tr: kimlik doğrulama bilgisi gir

source: Could not open connection: %s
ca: No s'ha pogut establir la connexió: %s
ro: Nu s-a putut deschide conexiunea: %s
tr: Bağlantı açılamadı: %s
uk: Не вдалося відкрити з'єднання: %s

source: Provider: %s
ca: Proveïdor: %s
ro: Furnizor: %s
tr: Sağlayıcı: %s
uk: Постачальник: %s

source: Database provider
ca: Proveïdor de la base de dades
ro: Furnizor pentru baza de date
tr: Veri tabanı sağlayıcısı
uk: Постачальник бази даних

source: In memory
ca: En memòria
ro: În memorie
tr: Bellekte
uk: У пам'яті

source: Dictionary file
ca: Fitxer de diccionari
ro: Fișier de dicționar
tr: Sözlük dosyası
uk: Файл словника
