Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: _Delete
ca: _Suprimeix
ro: Ș_terge
tr: _Sil
uk: В_илучити

source: Data Sources
ca: Fonts de dades
ro: Surse de date
tr: Veri Kaynakları
uk: Джерела даних

source: Data sources are the means by which database connections are identified: all the information needed to open a connection to a specific database using a 'provider' is referenced using a unique name.
ca: Les fonts de dades són els mitjans pels quals s'identifiquen les connexions a bases de dades: a través d'un nom únic, el «proveïdor», es referencia tota la informació necessària per a establir una connexió a una base de dades específica.
ro: Sursele de date sunt mijloacele prin care sunt identificate conexiunile bazei de date: toate informațile necesare pentru a deschide o conexiune la o bază de date specifică utilizând un „furnizor” la care se face referire folosind un nume unic.
tr: Veri kaynakları, veri tabanı bağlantılarının tanımlandığı araçlardır: tüm bilgi, 'sağlayıcı' olarak benzersiz bir ad kullanılarak, belirli bir veri tabanına bağlantı için gereklidir.
uk: Джерела даних є засоби, за якими ідентифікуються з'єднання із базою даних: посилання на усі відомості, потрібні для відкриття з'єднання із певною базою даних з використанням «надавача даних» («provider»), виконується з використанням унікальної назви.

source: No data source selected.
ca: No s'ha seleccionat cap font de dades.
tr: Hiçbir veri kaynağı seçilmedi.
uk: Не вибрано джерела даних.

source: Definition
ca: Definició
ro: Definiție
tr: Tanımlama
uk: Означення

source: Parameters
ca: Paràmetres
ro: Parametri
tr: Parametreler
uk: Параметри

source: Authentication
ca: Autenticació
ro: Autentificare
tr: Kimlik Doğrulama
uk: Розпізнавання

source: Write changes made to the DSN
ca: Escriure els canvis realitzats al DSN
ro: Salvează modificările făcute la DSN
tr: Yapılan değişiklikleri DSN'e yaz
uk: Записати зміни, внесені до DSN

source: Could not save DSN definition: %s
ca: No s'ha pogut desar la definició DSN: %s
tr: DSN tanımı kaydedilemedi: %s
uk: Не вдалося зберегти визначення DSN: %s

source: No detail
ca: Sense detalls
ro: Niciun detaliu
tr: Ayrıntı yok
uk: Немає подробиць

source: Are you sure you want to remove the data source '%s'?
ca: Segur que voleu eliminar la font de dades «%s»?
ro: Sigur doriți să eliminați sursa de date „%s”?
tr: '%s' veri kaynağını kaldırmak istediğinizden emin misiniz?
uk: Ви впевнені, що хочете вилучити джерело даних «%s»?

source: Data source removal confirmation
ca: Confirmació de la supressió de la font de dades
ro: Confirmarea eliminării sursei de date
tr: Veri kaynağı kaldırma onayı
uk: Підтвердження вилучення джерела даних

source: From the database control center, you can manage the defined data sources (database connections), and check which database providers are installed (and usable to connect to different databases).
ca: Des del centre de control de bases de dades, podeu gestionar les fonts de dades definides (connexions de bases de dades) i comprovar quins proveïdors de bases de dades estan instal·lats (i es poden utilitzar per a connectar-se a diferents bases de dades).
ro: Din centrul de control al bazelor de date, puteți administra sursele de date definite (conexiuni de baze de date), și verifica care furnizori de baze de date sunt instalați (și folositori la conectarea la diferite baze de date).
tr: Veri tabanı denetim merkezinden, tanımlanmış veri kaynaklarını (veri tabanı bağlantıları) yönetebilir ve hangi veri tabanı sağlayıcılarının kurulu olduğunu denetleyebilirsiniz (ve başka veri tabanlarına bağlanmak için kullanılabilir).
uk: За допомогою центру керування базою даних ви можете керувати визначеними джерелами даних (з'єднаннями бази даних) і перевірити, які надавачі доступу до бази даних встановлено (і які є придатними для встановлення з'єднання із різними базами даних).

source: Database access control center
ca: Centre de control d'accés a bases de dades
ro: Centrul de control de acces la baza de date
tr: Veri tabanı erişimi denetleme merkezi
uk: Центр керування доступом до бази даних

source: Gda Control Center
ca: Centre de control de Gda
ro: Centru de control Gda
tr: Gda Denetim Merkezi
uk: Центр керування Gda

source: Configure your database access environment
ca: Configureu l'entorn d'accés a bases de dades
ro: Configurați mediul de acces la baza de date
tr: Veri tabanı erişim ortamınınızı yapılandırın
uk: Налаштовування середовища доступу до вашої бази даних

source: Missing mandatory information, to create database: '%s'
ca: Falta informació obligatòria per a crear base de dades: «%s»
tr: Veri tabanını oluşturmak için zorunlu bilgi eksik: '%s'
uk: Для створення бази даних не вистачає обов'язкової інформації: «%s»

source: Error creating database: %s
ca: S'ha produït un error en crear la base de dades: %s
ro: Eroare la crearea bazei de date: %s
tr: Veri tabanı oluşturma hatası: %s
uk: Помилка під час створення бази даних: %s

source: Unknown error
ca: Error desconegut
ro: Eroare necunoscută
tr: Bilinmeyen hata
uk: Невідома помилка

source: No provider exists
ca: No existeix cap proveïdor
tr: Hiçbir sağlayıcı yok
uk: Немає постачальника

source: No providers exists
ca: No existeixen proveïdors
tr: Hiçbir sağlayıcı yok
uk: Немає постачальників

source: No provider's information exists
ca: No hi ha informació del proveïdor
tr: Sağlayıcı bilgisi yok
uk: Немає даних щодо постачальника

source: New data source definition
ca: Definició d'una font de dades nova
ro: Definiție nouă pentru sursa de date
tr: Yeni veri kaynağı tanımlaması
uk: Визначення нового джерела даних

source: This assistant will guide you through the process of creating a new data source, and optionally will allow you to create a new database. Just follow the steps!
ca: L'auxiliar us guiarà a través del procés de creació d'una font de dades nova i, opcionalment, us permetrà crear una base de dades nova. Només heu de seguir els passos.
ro: Acest asistent vă va ghida prin procesul de creare a surselor de date noi, și vă va permite opțional să creați o bază de date nouă. Urmăriți pașii!
tr: Bu yardımcı, yeni bir veri kaynağı oluşturma sürecinde size rehberlik edecek ve isteğe bağlı olarak, yeni bir veri tabanı oluşturmanıza izin verecektir. Yalnızca adımları izleyin!
uk: За допомогою цієї допоміжної програми ви зможете виконати процедуру створення джерела даних і, якщо захочете, створити базу даних. Просто виконайте покрокові настанови!

source: Add a new data source...
ca: Afegeix una font de dades nova...
ro: Adaugă o sursă de date nouă...
tr: Yeni bir veri kaynağı ekle...
uk: Додати нове джерело даних…

source: The following fields represent the basic information items for your new data source. Mandatory fields are marked with a star. To create a local database in a file, select the 'SQLite' type of database.
ca: Els camps següents representen els elements bàsics d'informació per a la font de dades nova. Els camps obligatoris estan marcats amb asterisc. Per a crear una base de dades local en un fitxer, seleccioneu el tipus de base de dades «SQLite».
ro: Următoarele câmpuri reprezintă elementele de informație de bază pentru sursele de date noi. Câmpurile obligatorii sunt marcate cu o stea. Pentru a crea o bază de date locală într-un fișier, selectați tipul de bază de date „SQLite”.
tr: Aşağıdaki alanlar, sizin yeni veri kaynağınız için temel bilgiyi temsil eder. Zorunlu alanlar yıldız ile işaretlenmiştir. Bir dosyaya yerel bir veri tabanı oluşturmak için, veri tabanı türünü 'SQLite' seçin.
uk: Наступні поля пов'язано із записами базових даних вашого нового джерела даних. Обов'язкові до заповнення поля позначено зірочкою. Для створення локальної бази даних у файлі, виберіть тип бази даних «SQLite».

source: Data source name
ca: Nom de l'origen de les dades
ro: Numele sursei de date
tr: Veri kaynağı adı
uk: Назва джерела даних

source: System wide data source:
ca: Font de dades per tot el sistema:
ro: Sursă de date de sistem larg:
tr: Sistem geneli veri kaynağı:
uk: Загальносистемне джерело даних:

source: Database type
ca: Tipus de base de dades
ro: Tip de bază de date
tr: Veri tabanı türü
uk: Тип бази даних

source: Description:
ca: Descripció:
ro: Descriere:
tr: Açıklama:
uk: Опис:

source: General Information
ca: Informació general
ro: Informații generale
tr: Genel Bilgi
uk: Загальна інформація

source: This page lets you choose between using an existing database or to create a new database to use with this new data source
ca: Aquesta pàgina us permet triar entre una base de dades existent o crear-ne una de nova per a utilitzar amb aquesta font de dades nova
ro: Această pagină vă permite să alegeți între utilizarea unei baze de date existente sau crearea unei baze de date noi de utilizat cu această nouă sursă de date
tr: Bu sayfa, yeni veri kaynağı ile kullanmak için var olan bir veri tabanı kullanmanız veya yenisini oluşturmanız için seçenek sunar
uk: За допомогою цієї сторінки ви можете вибрати наявну базу даних або створити нову для використання із цим новим джерелом даних

source: Create a new database:
ca: Crea una base de dades nova:
ro: Creează o bază de date nouă:
tr: Yeni bir veri tabanı oluştur:
uk: Створити базу даних:

source: Create a new database?
ca: Voleu crear una base de dades nova?
ro: Creați o bază de date nouă?
tr: Yeni bir veri tabanı oluşturmak istiyor musunuz?
uk: Створити базу даних?

source: The following fields represent the information needed to create a new database (mandatory fields are marked with a star). This information is database-specific, so check the manual for more information.
ca: Els camps següents representen la informació necessària per a crear una nova base de dades (els camps obligatoris estan marcats amb un asterisc). Aquesta informació és específica de la base de dades; per tant, consulteu el manual per a obtenir més informació.
tr: Aşağıdaki alanlar bir bağlantı açmak için gerekli olan bilgilyi temsil etmektedir (zorunlu alanlar yıldız ile işaretlenmiştir). Bu bilgi veri tabanına özeldir. Bu nedenle daha fazla bilgi için kılavuza bakın.
uk: Вказані нижче поля відповідають відомостям, які потрібні для створення бази даних (обов'язкові до заповнення поля позначено зірочкою). Ці відомості є специфічними для бази даних, тому вам слід ознайомитися із підручником до неї, щоб дізнатися більше.

source: New database definition
ca: Definició de la base de dades nova
ro: Definiție pentru baza de date nouă
tr: Yeni veri tabanı tanımlaması
uk: Визначення нової бази даних

source: Connection's parameters
ca: Paràmetres de la connexió
ro: Parametrii conexiunii
tr: Bağlantının parametreleri
uk: Параметри з'єднання

source: The following fields represent the authentication information needed to open a connection.
ca: Els camps següents representen la informació d'autenticació necessària per a establir una connexió.
ro: Următoarele câmpuri reprezintă informațiile de autentificare pentru a deschide o conexiune.
tr: Aşağıdaki alanlar bir bağlantı açmak için gerekli olan kimlik doğrulama bilgisini temsil etmektedir.
uk: Наступні поля містять відомості щодо розпізнавання, які потрібні для відкриття з'єднання.

source: Authentication parameters
ca: Paràmetres d'autenticació
ro: Parametrii de autentificare
tr: Kimlik doğrulama parametreleri
uk: Параметри автентифікації

source: All information needed to create a new data source has been retrieved. Now, press 'Apply' to close this dialog.
ca: Ja s'ha obtingut tota la informació necessària per a crear una font de dades nova. Premeu «Aplica» per a tancar aquest diàleg.
ro: Toate informațiile necesare pentru a crea o sursă de date nouă au fost obținute. Acum, apăsați pe „Aplică” pentru a închide acest dialog.
tr: Yeni bir veri kaynağı oluşturmak için gerekli olan tüm bilgiler alındı. Şimdi, bu pencereyi kapatmak için 'Uygula' ya basın.
uk: Усі відомості, потрібні для створення джерела даних, отримано. Тепер натисніть кнопку «Застосувати», щоб закрити це діалогове вікно.

source: Ready to add a new data source
ca: A punt per a afegir una font de dades nova
ro: Gata pentru adăugarea unei surse de date noi
tr: Yeni bir veri kaynağı eklemek için hazır
uk: Готовність до додавання нового джерела даних

source: _System wide data source:
ca: Font de dades per tot el _sistema:
ro: _Sursă de date de sistem larg:
tr: _Sistem geneli veri kaynağı:
uk: За_гальносистемне джерело даних:

source: _Provider:
ca: _Proveïdor:
ro: _Furnizor:
tr: _Sağlayıcı:
uk: Пост_ачальник:

source: _Description:
ca: _Descripció:
ro: _Descriere:
tr: _Açıklama:
uk: _Опис:

source: <span foreground='red'>The database provider used by this data source is not available, editing the data source's attributes is disabled</span>
ca: <span foreground='red'>No està disponible el proveïdor de la base de dades que fa servir aquesta font de dades. S'ha inhabilitat l'edició dels atributs de la font de dades</span>
ro: <span foreground='red'>Furnizorul de bază de date utilizat de această sursă de date nu este disponibil, editarea atributelor sursei de date este dezactivată</span>
tr: <span foreground='red'>Bu veri kaynağınca kullanılan veri tabanı sağlayıcı kullanılabilir değil, veri kaynağının özniteliklerini değiştirme kapalı</span>
uk: <span foreground='red'>Надавач даних, який використовується цим джерелом даних, є недоступним, — редагування атрибутів джерела даних вимкнено.</span>

source: Login for %s
ca: Entrada per %s
ro: Autenficare pentru %s
tr: %s için oturum aç
uk: Вхідні дані для %s

source: Connection successfully opened!
ca: S'ha establert la connexió correctament
ro: Conexiune deschisă cu succes!
tr: Bağlantı başarıyla açıldı!
uk: З'єднання успішно відкрито!

source: Could not open connection
ca: No s'ha pogut establir la connexió
ro: Nu s-a putut deschide conexiunea
tr: Bağlantı açılamadı
uk: Не вдалося відкрити з'єднання

source: Data source copy
ca: Còpia de la font de dades
tr: Veri kaynağı kopyası
uk: Копія джерела даних

source: Create data source
ca: Crea una font de dades
tr: Veri kaynağı oluştur
uk: Створення джерела даних

source: _Cancel
ca: _Cancel·lar
ro: A_nulează
tr: _İptal
uk: _Скасувати

source: Define the name of the new data source which will be created as a copy of '%s':
ca: Definiu el nom de la nova font de dades que es crearà com a còpia de «%s»:
ro: Definiți numele noii surse de date care va fi creeată ca o copie a „%s”:
tr: '%s' kopyası olarak oluşturulacak yeni veri kaynağının adını tanımlayın:
uk: Визначте назву нового джерела даних, яке буде створено як копію «%s»:

source: Could not create data source: %s
ca: No s'ha pogut crear la font de dades: %s
tr: Veri kaynağı oluşturulamadı: %s
uk: Не вдалося створити джерело даних: %s

source: Connection opening
ca: Establiment de la connexió
ro: Deschidere conexiune
tr: Bağlantı açılışı
uk: Відкриття з'єднання

source: Fill in the following authentication elements to open a connection
ca: Empleneu els elements d'autenticació següents per a establir una connexió
ro: Completați următoarele elemente de autentificare pentru a deschide o conexiune
tr: Bağlantıyı açmak için aşağıdaki kimlik doğrulama ögelerini doldurun
uk: Заповніть наведені нижче дані для розпізнавання, щоб відкрити з'єднання

source: No authentication required, confirm connection opening
ca: No es requereix autenticació, confirmeu l'establiment de la connexió
ro: Autentificarea nu este necesară, confirmați deschiderea conexiunii
tr: Kimlik doğrulama gerekli değil, bağlantı açmayı onaylayın
uk: У розпізнаванні немає потреби, підтвердження відкриття з'єднання

source: C_onnect
ca: C_onnecta
ro: C_onectează
tr: Bağlan_tı
uk: _З'єднати

source: Could not declare new data source
ca: No s'ha pogut declarar la font de dades nova
ro: Nu s-a putut declara sursa de date nouă
tr: Yeni veri kaynağı bildirilemedi
uk: Не вдалося оголосити нове джерело даних

source: No valid data source info was created
ca: No s'ha creat una informació de font de dades vàlida
ro: Nu s-au creat informații valide pentru sursa de date
tr: Oluşturulmuş geçerli veri kaynağı yok
uk: Не було створено коректних даних щодо джерела даних

source: Database sources control center
ca: Centre de control de fonts de bases de dades
tr: Veri tabanı kaynakları denetim merkezi
uk: Центр керування джерелами баз даних

source: Database access services for the GNOME Desktop
ca: Serveis d'accés a bases de dades per a l'escriptori GNOME
ro: Serviciile de acces la baza de date pentru Desktop GNOME
tr: GNOME Masaüstü için veri tabanı erişim hizmetleri
uk: Служби керування доступом до баз даних для стільниці GNOME

source: Datasource access control center
ca: Centre de control d'accés de bases de dades
ro: Centrul de control de acces sursa de date
tr: Veri kaynağı erişim denetimi merkezi
uk: Центр керування доступом до джерел даних

source: Accepted connection parameters
ca: Paràmetres de connexió acceptats
tr: Bağlantı parametreleri kabul edildi
uk: Параметри прийнятого з'єднання

source: optional
ca: opcional
tr: isteğe bağlı
uk: необов'язкове

source: Shared object file
ca: Fitxer d'objecte compartit
tr: Paylaşılmış nesne dosyası
uk: Спільний файл об'єктів

source: Providers
ca: Proveïdors
ro: Furnizori
tr: Sağlayıcılar
uk: Надавачі даних

source: Providers are addons that actually implement the access to each database using the means provided by each database vendor.
ca: Els proveïdors són connectors que implementen l'accés a cada base de dades utilitzant els mitjans proveïts per cada fabricant de base de dades.
ro: Furnizorii sunt module care implementează accesul la fiecare bază de date utilizând mijloacele oferite de fiecare vânzător de baze de date.
tr: Sağlayıcılar, her bir veri tabanı sağlayıcısınca sağlanan araçlar kullanılarak veri tabanına erişim sağlamak için gerçeklenmiş eklentilerdir.
uk: Надавачі даних — додатки, які реалізують доступ до кожної з баз даних за допомогою засобів, які передбачено розробниками відповідних баз даних.

source: Statement could not be found in batch's statements
ca: No s'ha trobat cap declaració al lot de declaracions
ro: Comanda nu s-a putut găsi în comenzile seriei
tr: Komut, toplu komutlarda bulunamadı
uk: Не вдалося знайти інструкцію у пакетних інструкціях

source: Conflicting parameter '%s'
ca: Paràmetre conflictiu «%s»
ro: Parametru „%s” în conflict
tr: '%s' parametresinde çakışma var
uk: Конфлікт із параметром «%s»

source: Error loading authentication information for '%s' DSN: %s
ca: S'ha produït un error en carregar la informació d'autenticació per al DSN «%s»: %s
ro: Eroare la încărcarea informațiilor de autentificare pentru „%s” DSN: %s
tr: Kimlik doğrulama bilgisi yükleme hatası: '%s' DSN: %s
uk: Помилка під час спроби завантажити відомості для DSN «%s»: %s

source: Error creating user specific configuration directory '%s'
ca: S'ha produït un error en crear el directori de configuració específica de l'usuari «%s»
ro: Eroare la crearea dosarului „%s” de configurare specifică utilizatorului
tr: Kullanıcıya özel yapılandırma dizin '%s' için oluşturma hatası
uk: Помилка під час спроби створити специфічного для користувача каталогу налаштувань «%s»

source: User specific configuration directory '%s' exists and is not a directory
ca: Ja existeix el directori de configuració específica de l'usuari «%s» però no és un directori
ro: Dosarul „%s” de configurare specifică utilizatorului există și nu este un dosar
tr: Kullanıcıya özel yapılandırma dizini '%s' var ve bu bir dizin değil
uk: Каталог специфічних для користувача налаштувань «%s» вже існує і не є каталогом

source: Malformed data source name '%s'
ca: Nom de l'origen de les dades incorrecte «%s»
ro: Nume de sursă de date „%s” greșit
tr: Kusurlu veri kaynağı adı '%s'
uk: Помилкове форматування назви джерела даних «%s»

source: Couldn't save authentication information for DSN '%s': %s
ca: No s'ha pogut desar la informació d'autenticació de DSN «%s»: %s
ro: Nu s-au putut salva informațiile de autentificare pentru DSN „%s”: %s
tr: Kimlik doğrulama bilgisi kaydedilemedi: DSN '%s': %s
uk: Не вдалося зберегти відомості для розпізнавання для DSN «%s»: %s

source: Can't manage system-wide configuration
ca: No es pot gestionar la configuració a tot el sistema
ro: Nu se poate administra configurația aplicată sistemului
tr: Sistem genelindeki yapılandırma yönetilemez
uk: Не можна керувати загальносистемними налаштуваннями

source: Gnome-DB: authentication for the '%s' DSN
ca: Gnome-DB: autenticació de la versió «%s» DSN
tr: Gnome-DB: '%s' DSN için kimlik doğrulama
uk: Gnome-DB: розпізнавання для DSN «%s»

source: Couldn't delete authentication information for DSN '%s': %s
ca: No s'ha pogut suprimir la informació d'autenticació de DSN «%s»: %s
ro: Nu s-au putut șterge informațiile de autentificare pentru DSN „%s”: %s
tr: Kimlik doğrulama bilgisi silinemedi: DSN '%s': %s
uk: Не вдалося вилучити відомості для розпізнавання для DSN «%s»: %s

source: Unknown DSN '%s'
ca: DSN desconegut «%s»
ro: DSN „%s” necunoscut
tr: Bilinmeyen DSN '%s'
uk: Невідомий DSN «%s»

source: Provider '%s' not found
ca: No s'ha trobat el proveïdor «%s»
ro: Furnizorul „%s” nu a fost găsit
tr: '%s' sağlayıcısı bulunamadı
uk: Не знайдено постачальника «%s»

source: No provider '%s' installed
ca: No hi ha cap proveïdor «%s» instal·lat
ro: Nciun furnizor „%s” instalat
tr: '%s' sağlayıcısı yüklü değil
uk: Не встановлено постачальника «%s»

source: Can't load provider: %s
ca: No s'ha pogut carregar el proveïdor: %s
ro: Nu s-a putut încărca furnizorul: %s
tr: Sağlayıcı yüklenemiyor: %s
uk: Не вдалося завантажити постачальника: %s

source: Can't instantiate provider '%s'
ca: No s'ha pogut instanciar el proveïdor «%s»
ro: Nu s-a putut crea o instanță pentru furnizorul „%s”
tr: '%s' sağlayıcısı başlatılamıyor
uk: Не вдалося створити екземпляр надавача даних «%s»

source: Provider
ca: Proveïdor
ro: Furnizor
tr: Sağlayıcı
uk: Постачальник

source: Description
ca: Descripció
ro: Descriere
tr: Açıklama
uk: Опис

source: DSN parameters
ca: Paràmetres DSN
ro: Parametri DSN
tr: DSN parametreleri
uk: Параметри DSN

source: File
ca: Fitxer
ro: Fișier
tr: Dosya
uk: Файл

source: List of installed providers
ca: Llista de proveïdors instal·lats
ro: Listă cu furnizorii instalați
tr: Yüklü sağlayıcıların listesi
uk: Список встановлених постачальників

source: No default SQLite Provider Trying to create a new one. Error was: %s
ca: No hi ha un proveïdor de SQLite per defecte Intenta crear-ne un de nou. S'ha produït un error: %s
ro: Niciun furnizor implicit de SQLite, se încearcă creerea unuia nou. Eroarea a fost: %s
tr: Öntanımlı SQLite Sağlayıcısı Yok. Yeni bir tane oluşturulmaya çalışılıyor. Hata şuydu: %s
uk: Немає типового надавача даних SQLite. Намагаємося створити. Повідомлення про помилку: %s

source: Username
ca: Nom d'usuari
ro: Nume de utilizator
tr: Kullanıcı adı
uk: Користувач

source: Password
ca: Contrasenya
ro: Parolă
tr: Parola
uk: Пароль

source: Error loading provider '%s': %s
ca: S'ha produït un error en carregar el proveïdor «%s»: %s
ro: Eroare la încărcarea furnizorului „%s”: %s
tr: '%s' sağlayıcı yükleme hatası: %s
uk: Помилка під час спроби завантаження постачальника «%s»: %s

source: DSN to use
ca: El DSN que s'ha d'utilitzar
ro: DSN de utilizat
tr: Kullanılacak DSN
uk: DSN для використання

source: Connection string to use
ca: La cadena de connexió que s'ha d'utilitzar
ro: Șir de conexiune de utilizat
tr: Kullanılacak bağlantı karakter dizisi
uk: Рядок з'єднання, яким слід скористатися

source: Provider to use
ca: El proveïdor que s'ha d'utilitzar
ro: Furnizor de utilizat
tr: Kullanılacak sağlayıcı
uk: Постачальних для використання

source: Authentication string to use
ca: La cadena d'autenticació que s'ha d'utilitzar
ro: Șir de autentificare de utilizat
tr: Kullanılacak kimlik doğrulama karakter dizisi
uk: Рядок автентифікації для використання

source: Options
ca: Opcions
ro: Opțiuni
tr: Seçenekler
uk: Параметри
