Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: GdaSqlSelectField is not part of a SELECT statement
ca: GdaSqlSelectField no forma part d’una declaració SELECT
ro: GdaSqlSelectField nu este o parte a unei comenzi SELECT
tr: GdaSqlSelectField, SELECT ifadesinin bir parçası değil
uk: GdaSqlSelectField не є частиною інструкції SELECT

source: Missing table name in statement
ca: Falta el nom de la taula en la sentència
ro: Lipsește numele tabelei din comandă
tr: İfade içinde tablo adı eksik
uk: В інструкції пропущено назву таблиці

source: Table '%s' not found
ca: No s'ha trobat la taula «%s»
ro: Nu s-a găsit tabela „%s”
tr: '%s' tablosu bulunamadı
uk: Не знайдено таблиці «%s»

source: Could not identify table for field '%s'
ca: No es pot identificar la taula per al camp «%s»
ro: Nu s-a putut identifica tabela pentru câmpul „%s”
tr: '%s' alanı için bir tablo tanımlanamadı
uk: Не вдалося ідентифікувати таблицю для поля «%s»

source: Expression can't have both a type cast and a parameter specification
ca: L'expressió no pot tenir un canvi de tipus, type cast, i una especificació de paràmetres a la vegada
ro: Expresia nu poate avea un tip de distribuție și o specificație de parametru
tr: İfade, hem bir tür dönüşümü hem de bir parametre belirtimine sahip olamaz
uk: Вираз не може бути одночасно приведенням до типу і специфікацією параметра

source: '%s' is not a valid identifier
ca: «%s» no és un identificador vàlid
ro: „%s” nu este un identificator valid
tr: '%s' geçerli bir tanımayıcı değil
uk: «%s» не є коректним ідентифікатором

source: Empty identifier
ca: identificador buit
ro: Identificator liber
tr: Boş tanımlayıcı
uk: Порожній ідентифікатор

source: Operation has no operand
ca: L'operació no té cap operand
ro: Operația nu are operand
tr: İşlem, bir işlenene sahip değil
uk: У операції немає операнда

source: Wrong number of operands
ca: Nombre d'operands incorrecte
ro: Număr greșit de operanzi
tr: İşlenen sayısı yanlış
uk: Помилкова кількість операндів

source: Unknown operator %d
ca: Operador %d desconegut
ro: Operator necunoscut %d
tr: Bilinmeyen işleyici %d
uk: Невідомий оператор %d

source: Missing expression in select field
ca: Falta l'expressió en un camp seleccionat
ro: Lipsește expresia din câmpul selectat
tr: Seçim alanında ifade eksik
uk: Пропущено вираз у полі вибору

source: Missing expression in select target
ca: Falta l'expressió en una destinació seleccionada
ro: Lipsește expresia de la destinația selectată
tr: Seçim hedefinde eksik ifade
uk: Пропущено вираз у цілі вибору

source: Join can't at the same time specify a join condition and a list of fields to join on
ca: El JOINT no pot especificar una condició d'unió i al mateix temps una llista de camps als quals unir-se
ro: Asocierea nu poate specifica în același timp o condiție și o listă de câmpuri la care să se alăture
tr: Birleştirme, bir birleştirme durumunu ve birleşecek alanların listesini aynı anda belirtemez
uk: При об'єднанні не можна одночасно вказувати умову об'єднання та список полів для об'єднання

source: Cross join can't have a join condition or a list of fields to join on
ca: El «JOIN» creuat no pot tenir una condició de «JOIN» o una llista de camps en els quals unir-se
ro: Asocierea încrucișată nu poate avea o condiție de asociere sau o listă de câmpuri la care să se alăture
tr: Çapraz birleştirme, birleştirme durumu ya da birleşecek alanların listesine sahip olamaz
uk: Для перехресного об'єднання не можна вказувати умову об'єднання або список полів для об'єднання

source: Empty FROM clause
ca: Clàusula FROM buida
ro: Clauză FROM liberă
tr: Boş FROM cümlesi
uk: Порожній вираз FROM

source: Select field is not in a SELECT statement
ca: El camp Select no es troba en una instrucció SELECT
ro: Selectare câmp nu este o comandă SELECT
tr: Seçim alanı bir SELECT ifadesi içinde değil
uk: Поле вибору не перебуває у інструкції SELECT

source: COMPOUND statement contains an undefined COMPOUND statement
ca: La declaració COMPOUND conté una instrucció COMPOUND no definida
ro: Comanda COMPOUND conține o comandă COMPOUND neidentificată
tr: COMPOUND ifadesi, tanımsız COMPOUND ifadesi içerir
uk: Інструкція COMPOUND містить невизначену інструкцію COMPOUND

source: COMPOUND statement contains an undefined SELECT statement
ca: La declaració COMPOUND conté una declaració SELECT no definida
ro: Comanda COMPOUND conține o comandă SELECT neidentificată
tr: COMPOUND ifadesi, tanımsız SELECT ifadesi içerir
uk: Інструкція COMPOUND містить невизначену інструкцію SELECT

source: COMPOUND statement contains a non SELECT statement
ca: La declaració COMPOUND conté una declaració que no és SELECT
ro: Comanda COMPOUND conține o comandă diferită de SELECT
tr: COMPOUND ifadesi, SELECT olmayan bir ifade barındırır
uk: Інструкція COMPOUND містить інструкцію, відмінну від SELECT

source: COMPOUND statement does not contain any SELECT statement
ca: La declaració COMPOUND no conté cap declaració SELECT
ro: Comanda COMPOUND nu conține nicio comandă SELECT
tr: COMPOUND ifadesi, herhangi bir SELECT ifadesi içermiyor
uk: У інструкції COMPOUND не міститься жодної інструкції SELECT

source: COMPOUND statement only contains one SELECT statement
ca: La declaració COMPOUND només conté una declaració SELECT
ro: Comanda COMPOUND conține doar o comandă SELECT
tr: COMPOUND ifadesi yalnızca bir SELECT ifadesi içerir
uk: Інструкція COMPOUND містить лише одну інструкцію SELECT

source: COMPOUND statement contains an empty SELECT statement
ca: La declaració COMPOUND conté una declaració SELECT buida
ro: Comanda COMPOUND conține o comandă SELECT liberă
tr: COMPOUND ifadesi boş bir SELECT ifadesi içerir
uk: Інструкція COMPOUND містить порожню інструкцію SELECT

source: All statements in a COMPOUND must have the same number of columns
ca: Totes les declaracions d’un COMPOUND han de tenir el mateix nombre de columnes
ro: Toate comenzile dintr-un COMPOUND trebuie să aibă același număr de coloane
tr: COMPOUND içindeki tüm ifadeler aynı sayıda sütuna sahip olmalıdır
uk: Усі інструкції у COMPOUND повинні мати однакову кількість стовпчиків

source: DELETE statement needs a table to delete from
ca: La declaració DELETE necessita una taula des de la qual eliminar
ro: Comanda DELETE are nevoie de o tabelă din care să șteargă
tr: DELETE ifadesi, içinden silinecek bir tabloya gereksinir
uk: Інструкція DELETE повинна містити дані щодо таблиці, з якої слід вилучити дані

source: INSERT statement needs a table to insert into
ca: La declaració INSERT necessita una taula en la qual inserir
ro: Comanda INSERT are nevoie de o tabelă în care să insereze
tr: INSERT ifadesi, içine eklenecek bir tabloya gereksinir
uk: У інструкції INSERT має бути вказано таблицю, до якої слід вставити дані

source: Can't specify values to insert and SELECT statement in INSERT statement
ca: No es poden especificar valors per a inserir i una declaració SELECT en una declaració INSERT
ro: Nu se pot specifica valorile de inserat și comanda SELECT în comanda INSERT
tr: Eklenecek değerler belirtilmemiş ve SELECT ifadesi INSERT ifadesinin içinde
uk: Не можна вказувати значення для вставлення і інструкцію SELECT в інструкції INSERT

source: INSERT statement does not have the same number of target columns and expressions
ca: La declaració INSERT no té el mateix nombre de columnes de destinació i expressions
ro: Comanda INSERT nu are același număr de coloane de destinație și expresii
tr: INSERT ifadesi, aynı sayıda hedef sütun ve ifadeye sahip olamaz
uk: У інструкції INSERT немає тієї самої кількості стовпчиків і виразів призначення

source: VALUES lists must all be the same length in INSERT statement
ca: Les llistes VALUES han de tenir totes la mateixa longitud en les declaracions INSERT
ro: Listele VALUES trebuie să aibă toate aceeași lungime în comanda INSERT
tr: VALUES listesi, INSERT ifadesi ile aynı uzunlukta olmak zorundadır
uk: У інструкції INSERT списки VALUES мають бути однакової довжини

source: SELECT does not contain any expression
ca: SELECT no conté cap expressió
ro: SELECT nu conține nicio expresie
tr: SELECT herhangi bir ifade barındırmaz
uk: SELECT не містить жодного виразу

source: SELECT can't have a DISTINCT expression if DISTINCT is not set
ca: SELECT no pot tenir una expressió DISTINCT si DISTINCT no està establert
ro: SELECT nu poate avea o expresie DISTINCT dacă DISTINCT nu este stabilită
tr: SELECT ifadesi, DISTINC ayarlanmamış ise bir DISTINCT ifadesine sahip olamaz
uk: SELECT не може містити виразу DISTINCT, якщо не встановлено DISTINCT

source: SELECT can't have a HAVING without GROUP BY
ca: SELECT no pot tenir un HAVING sense un GROUP BY
ro: SELECT nu poate avea un HAVING fără GROUP BY
tr: SELECT ifadesi GROUP BY olmadan HAVING barındıramaz
uk: SELECT не може містити HAVING без GROUP BY

source: SELECT can't have a limit offset without a limit
ca: SELECT no pot tenir un «limit offset» sense un límit
ro: SELECT nu poate avea o decalaj de limită fără o limită
tr: SELECT ifadesi, limit olmadan bir limit değerine sahip olamaz
uk: SELECT не може містити відступу обмеження без обмеження

source: Multiple targets named or aliased '%s'
ca: Hi ha diverses destinacions anomenades «%s»
ro: Destinații multiple numite sau cu alias „%s”
tr: Birden çok hedef adlandırılmış veya takma ad konulmuş '%s'
uk: Декілька цілей із назвою або альтернативною назвою «%s»

source: UPDATE statement needs a table to update data
ca: La declaració UPDATE requereix una taula per a actualitzar les dades
ro: Comanda UPDATE are nevoie de o tabelă pentru a actualiza datele
tr: UPDATE ifadesi veri güncelleyecek tabloya gereksiniyor
uk: В інструкції UPDATE має бути вказано таблицю, у якій слід оновити дані

source: UPDATE statement does not have the same number of target columns and expressions
ca: La instrucció UPDATE no té el mateix nombre de columnes de destinació i expressions
ro: Comanda UPDATE nu are același număr de coloane de destinație și expresii
tr: UPDATE ifadesi, aynı hedef sütun sayısına ve ifadesine sahip değil
uk: У інструкції UPDATE немає тієї самої кількості стовпчиків і виразів призначення

source: UPDATE statement does not have any target columns to update
ca: La declaració UPDATE no té cap columna de destinació per a actualitzar
ro: Comanda UPDATE nu are coloane de destinație de actualizat
tr: UPDATE ifadesi, güncellenecek herhangi bir hedef sütuna sahip değil
uk: У інструкції UPDATE немає жодного стовпчика призначення для оновлення

source: The GMainContext passed when gda_signal_connect() was called is not owned by any thread, you may expect some undesired behaviours, use g_main_context_acquire()
ca: El GMainContext transmès quan es va cridar a gda_signal_connect() no és propietat de cap fil, pots esperar alguns comportaments no desitjats, usa g_main_context_acquire()
ro: GMainContext furnizat când gda_signal_connect() a fost apelat nu este deținut de niciun fir de execuție, puteți aștepta comportamente nedorite, utilizați g_main_context_acquire()
tr: GMainContext, da_signal_connect() kendinin olmayan başka bir iş parçacığınca çağrıldığında geçilmiş olur, bazı istenmeyen davranışlar görülebilir, g_main_context_acquire() kullanın
uk: Передане значення GMainContext при виклику gda_signal_connect() не належить жодному потоку обробки; можливо, результати будуть небажаними — скористайтеся g_main_context_acquire()

source: Could not find signal named "%s"
ca: No s'ha pogut trobar el senyal anomenat «%s»
ro: Nu s-a putut găsi semnalul cu numele „%s”
tr: "%s" adlı sinyal bulunamadı
uk: Не вдалося знайти сигналу із назвою «%s»

source: Possible memory leak as no destroy function provided to free value returned by the worker thread
ca: Possible fuga de memòria al no existir una funció de destrucció del valor lliure retornat pel fil de treball
ro: Scurgere de memorie posibilă pentru că nicio funcție de distrugere nu a fost oferită pentru a elibera valoarea returnată de firul de execuție
tr: İş parçacığınca döndürülen boşaltma değeri ile yoketme fonksiyonu olası bir bellek taşması belirtiyor
uk: Можливий витік пам'яті, оскільки немає функції destroy для вивільнення значення, яке повернуто потоком обробника

source: Unknown requested job %u
ca: Treball %u sol·licitat desconegut
tr: Bilinmeyen istenmiş iş %u
uk: Запит на невідоме завдання %u

source: Job %u has been cancelled
ca: S'ha cancel·lat el treball %u
tr: %u işi iptal edildi
uk: Завдання %u скасовано

source: Job %u is being processed
ca: S'està processant el treball %u
tr: %u işi işlenmiş
uk: Завдання %u обробляється

source: Job %u has not yet been processed
ca: Encara no s'ha processat el treball %u
tr: %u işi henüz işlenmemiş
uk: Завдання %u ще не оброблено

source: Job %u has already been processed
ca: El treball %u ja s'ha processat
tr: %u işi zaten işlenmiş
uk: Завдання %u вже оброблено

source: Cannot build inter thread communication device
ca: No es pot construir la comunicació inter-fils entre dispositius
ro: Nu s-a putut construi un dispozitiv de comunicare între firele de execuție
tr: İş parçacıkları arası iletişim aygıtı oluşturulamıyor
uk: Не вдалося побудувати пристрій для обміну даними між потоками обробки

source: GdaWorker internal error
ca: Error intern GdaWorker
tr: GdaWorker iç hatası
uk: Внутрішня помилка GdaWorker

source: Error
tr: Hata
uk: Помилка

source: Select file to load
ca: Seleccioneu el fitxer que voleu carregar
ro: Selectează fișier de încărcat
tr: Yüklenecek dosyayı seçin
uk: Виберіть файл для завантаження

source: _Open
ca: _Obre
ro: D_eschide
tr: _Aç
uk: _Відкрити

source: Could not load the contents of '%s'
ca: No s'ha pogut carregar el contingut de «%s»
tr: '%s' içeriği yüklenemedi
uk: Не вдалося завантажити вміст «%s»

source: Select a file to save data to
ca: Seleccioneu un fitxer on guardar les dades
ro: Selectează un fișier la care să salvezi datele
tr: Verinin kaydedileceği bir dosya seçin
uk: Виберіть файл для збереження даних

source: Could not save data to '%s'
ca: No s'han pogut desar les dades a «%s»
tr: Veri '%s' üzerine yazılamadı
uk: Не вдалося зберегти дані до «%s»

source: Load data from file
ca: Carregar dades del fitxer
tr: Dosyadan veri yükle
uk: Завантаження даних з файла

source: Save data to file
ca: Desa les dades al fitxer
tr: Veriyi dosyaya kaydet
uk: Збереження даних до файла

source: Clear data
ca: Esborrar dades
tr: Veriyi temizle
uk: Вилучити дані

source: Open with...
ca: Obre amb...
ro: Deschide cu...
tr: Birlikte aç...
uk: Відкрити за допомогою…

source: %lu Byte
ro: %lu octet
tr: %lu Bayt
uk: %lu байт

source: Unknown size
ca: Mida desconeguda
ro: Dimensiune necunoscută
tr: Bilinmeyen boyut
uk: Невідомий розмір

source: Could not create temporary directory
ca: No s'ha pogut crear el directori temporal
tr: Geçici dizin oluşturulamadı
uk: Не вдалося створити тимчасовий каталог

source: Could not run selected application
ca: No s'ha pogut executar l'aplicació seleccionada
tr: Seçilen uygulama çalıştırılamadı
uk: Не вдалося запустити вибрану програму

source: Could not export data
ca: No s'han pogut exportar les dades
tr: Veri dışa aktarılamadı
uk: Не вдалося експортувати дані

source: Open with
ca: Obre amb
ro: Deschide cu
tr: Birlikte aç
uk: Відкрити за допомогою

source: Value
ca: Valor
ro: Valoare
tr: Değer
uk: Значення

source: GValue to render
ca: GValue per a presentar
ro: GValue de randat
tr: Gerçeklenecek GValue
uk: GValue для обробки

source: Editable
ro: Editabil
tr: Düzenlenebilir
uk: Можна редагувати

source: Could not find icon file bin-attachment.png in resources please report error to https://gitlab.gnome.org/GNOME/libgda/issues. Error message: %s
ca: No s'ha pogut trobar el fitxer icona bin-attachment.png als recursos. Informeu-vos d'errors a https://gitlab.gnome.org/GNOME/libgda/issues. Missatge d'error: %s
tr: Kaynaklarda bin-attachment.png simge dosyası bulunamadı, lütfen https://gitlab.gnome.org/GNOME/libgda/issues adresine hata bildirin. Hata mesajları: %s
uk: Не вдалося знайти файл піктограми bin-attachment.png у ресурсах. Будь ласка, повідомте про цю помилку на https://gitlab.gnome.org/GNOME/libgda/issues. Повідомлення про помилку: %s

source: The toggle button can be activated
ca: Es pot activar el botó de commutació
ro: Butonul de comutare poate fi activat
tr: Seçim düğmesi etkinleştirilebilir
uk: Кнопку-перемикач може бути активовано

source: Values limited to PK fields
ca: Valors limitats als camps PK
ro: Valori limitate la câmpurile PK
tr: Değerler PK alanları ile sınırlı
uk: Значення обмежено до полів PK

source: GList of GValue to render, limited to PK fields
ca: Glist de GValue per a presentar, limitat als camps PK
ro: GList cu GValue de randat, limitat la câmpurile PK
tr: Gerçeklemek için GValue nin Glist i, PK alanları için sınırlı
uk: GList з GValue для обробки, обмежено до полів PK

source: Values
ca: Valors
ro: Valori
tr: Değerler
uk: Значення

source: GList of GValue to render, not limited to PK fields
ca: Glist de GValue per a presentar, no limitat als camps PK
ro: GList cu GValue de randat, nu este limitat la câmpurile PK
tr: Gerçeklemek için GValue nin Glist i, PK alanları için sınırlı
uk: GList з GValue для обробки, не обмежено до полів PK

source: The information and status changer can be activated
ca: El canviador d'informació i estat pot ser activat
ro: Modificatorul de informații și stare poate fi activat
tr: Bilfi ve durum değiştirici aktif olabilir
uk: Може бути задіяно засіб зміни відомостей і стану

source: string truncated because too long
ca: cadena truncada perquè és massa llarga
ro: șirul a fost trunchiat deoarece este prea lung
tr: karakter dizisi kesilmiş çünkü çok uzun
uk: рядок обрізано через надмірну довжину

source: Data cell renderer's specified type (%s) differs from actual value to display type (%s)
ca: El tipus especificat del renderitzador de la cel·la de dades (%s) difereix del valor real del tipus a mostrar (%s)
ro: Tipul specificat al randorului pentru celula de date (%s) diferă de valoarea actuală pentru a afișa tipul (%s)
tr: Veri hücresi gerçekleyicinin belirtilen türü (%s) geçerli gösterilecek değerin türünden (%s) başkadır
uk: Вказати тип для обробника комірки (%s) відрізняється від справжнього значення для показу типу (%s)

source: Data cell renderer asked to display values of different data types, at least %s and %s, which means the data model has some incoherencies
ca: El renderitzador de la cel·la de dades ha demanat mostrar valors de tipus de dades diferents, almenys %s i %s, el que vol dir que el model de dades té algunes incoherències
ro: Randorul pentru celula de date a cerut afișarea valorilor cu tipuri de date diferite, cel puțin %s și %s, ceea ce înseamnă că modelul de date are niște incoerențe
tr: Veri hücresi gerçekleyicisi, farklı veri türlernin değerlerini göstermek için sordu, en az %s ve %s, bunun anlamı veri modeli bazı tutarsızlıklar barındırıyor
uk: Обробнику комірки даних наказано показати значення у різних типах даних, принаймні %s і %s, що означає, що у моделі даних є певні неузгодженості

source: No data
ca: No hi ha dades
ro: Fără date
tr: Veri yok
uk: Немає даних

source: Invalid UTF-8 format!
ca: El format UTF-8 no és vàlid!
ro: Format UTF-8 nevalid!
tr: Geçersiz UTF-8 biçimi!
uk: Некоректний формат UTF-8!

source: Expected format is %s Time is relative to local time (%s)
ca: El format previst és %s L'hora es refereix a l'hora local (%s)
ro: Formatul așteptat este %s Timpul este relativa la timpul local (%s)
tr: %s, umulan biçimdir Saat, yerel saate bağlıdır (%s)
uk: Очікуваним форматом є %s Час є відносним щодо місцевого часу (%s)

source: Can't set value to entry: Invalid Data Type for Entry Wrapper Time
ca: No es pot establir valor a l'entrada: tipus de dades no vàlid per al Entry Wrapper Time
ro: Nu s-a putut stabili valoarea la intrare: Tip de date nevalide pentru Timpul de încadrare a intrării
tr: Girdiye değer ayarlanamıyor: Giriş Sarmalayıcı Süresi için Geçersiz Veri Türü
uk: Не вдалося встановити значення для запису: некоректний тип даних для обгортки часу запису

source: Can't get value from entry: Invalid Data Type for Entry Wrapper Time
ca: No es pot obtenir valor des de l'entrada: tipus de dades no vàlid per al Entry Wrapper Time
ro: Nu s-a putut obține valoarea din intrare: Tip de date nevalide pentru Timpul de încadrare a intrării
tr: Girişten değer alınamıyor: Giriş Sarmalayıcı Süresi için Geçersiz Veri Türü
uk: Не вдалося отримати значення з запису: некоректний тип даних для обгортки часу запису

source: Use 1000s separators
ca: Utilitza separador de milers 1000
ro: Utilizează separatori de 1000
tr: 1000 ler ayıracı kullan
uk: Використовувати роздільники тисяч

source: Use thousands separator as specified by current locale
ca: Utilitza separador de milers especificat per la configuració local actual
ro: Utilizează separatorul pentru mii așa cum este specificat de configurația curentă
tr: Mecvut yerelde belirtildiği gibi binler ayırıcı kullan
uk: Використовувати роздільник тисяч, як їх визначено у поточній локалі

source: Currency symbol
ca: Símbol de divisa
ro: Simbol valutar
tr: Döviz sembolü
uk: Знак грошової одиниці

source: A currency symbol
ca: Un símbol de divisa
ro: Un simbol valutar
tr: Bir döviz sembolü
uk: Символ валюти

source: Decimals
ro: Zecimale
tr: Ondalık basamaklar
uk: Знаків після коми

source: Number of decimals
ca: Nombre de decimals
ro: Număr de zecimale
tr: Ondalıkların sayısı
uk: Кількість десяткових знаків

source: Unspecified
ca: Indefinit
ro: Nespecificat
tr: Belirtilmemiş
uk: Не вказано

source: Default
ca: Per defecte
ro: Implicit
tr: Öntanımlı
uk: Типове

source: Default (unspecified)
ca: Per defecte (Indefinit)
tr: Öntanımlı (belirtilmemiş)
uk: Типове (не вказано)

source: Invalid
ca: No vàlid
tr: Geçersiz
uk: Некоректне

source: Edit
ca: Edita
ro: Editare
tr: Düzenle
uk: Змінити

source: Define as unspecified
ca: Definiu com a indeterminat
tr: Belirtilmemiş olarak tanımla
uk: Визначити як невказане

source: Define as default
ca: Definiu com a predeterminat
tr: Öntanımlı olarak tanımla
uk: Визначити як типове

source: Reset
ca: Reinicia
ro: Restabilește
tr: Sıfırla
uk: Скинути

source: Widget of class '%s' does not have any associated GdaDataHandler, (to be set using the 'handler' property) expect some mis-behaviours
ca: El giny de la classe «%s» no està associat a GdaDataHandler, (que s'ha d'establir utilitzant la propietat "handler") s'espera algun comportament maligne
ro: Controlul de clasă „%s” nu are asociat niciun GdaDataHandler (pentru a fi configurat folosind proprietatea „operator”) așteptați-vă la niște greșeli de comportament
tr: '%s' sınıfının parçacığı, herhangi bir yardımcı GdaDataHandler sahibi değil, ('handler' özelliği kullanarak ayarlanır) bazı yanlış davranışlar bekleniyor
uk: Віджет класу «%s» не пов'язано із жодним GdaDataHandler (має бути встановлено за допомогою властивості «handler»); результати можуть бути неочікуваними

source: Maximum length
ca: Llargada màxima
ro: Lungimea maximă
tr: Azami uzunluk
uk: Максимальна довжина

source: Maximum acceptable length of the text
ca: Longitud màxima acceptable del text
ro: Lungimea maximă acceptată a textului
tr: Metinin kabul edilebilir azami uzunluğu
uk: Максимальна прийнятна довжина тексту

source: Multiline
ca: Línies múltiples
ro: Multilinie
tr: Çoklu satır
uk: Багаторядковий

source: Display only one line, or a complete text editor
ca: Mostra només una línia o un editor de text complet
ro: Afișează numai o linie, sau un editor de text complet
tr: Yalnızca bir satırı ya da tüm metin düzenleyiciyi göster
uk: Показати лише один рядок або повний текстовий редактор

source: Hidden
ca: Ocult
ro: Ascuns
tr: Gizli
uk: Приховано
