Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Database provider does not support savepoints
ca: El proveïdor de bases de dades no és compatible amb punts de recuperació
ro: Furnizorul bazei de date nu suportă puncte de salvare
tr: Veri tabanı sağlayıcısı kaydetme noktası özelliğini desteklemiyor
uk: У надавачі даних бази даних не передбачено підтримки точок збереження

source: Delaying distributed transaction for %u ms
ca: Retardant la transacció distribuïda %u ms
ro: Se întârzie tranzacția distribuită pentru %u milisecunde
tr: Dağıtık işlem gecikmesi %u ms
uk: Затримуємо розподілену операцію на %u мс

source: Database provider does not support distributed transactions
ca: El proveïdor de bases de dades no admet transaccions distribuïdes
ro: Furnizorul bazei de date nu suportă tranzacții distribuite
tr: Veri tabanı sağlayıcısı dağıtık işlemleri desteklemiyor
uk: У надавачі даних бази даних не передбачено підтримки розподілених операцій

source: %s() does not handle values of type '%s'.
ca: %s() no gestiona valors de tipus «%s».
ro: %s() nu gestionează valori de tip „%s”.
tr: %s(), '%s' türündeki değerleri işleyemez.
uk: %s() не працює зі значеннями типу «%s».

source: GdaHolder with ID '%s' not found in set
ca: No s'ha trobat el GdaHolder amb ID «%s» en el conjunt
ro: GdaHolder cu ID-ul „%s” nu a fost găsit în set
tr: '%s' ID ile GdaHolder ayarda bulunamadı
uk: GdaHolder з ідентифікатором «%s» не знайдено у наборі

source: Could not parse '%s': XML data import validation will not be performed (some weird errors may occur)
ca: No s'ha pogut analitzar «%s»: la validació de la importació de dades XML no es realitzarà (podrien ocórrer errors estranys)
ro: Nu s-a putut analiza „%s”. Validarea importării de date XML nu va fi executată (niște erori ciudate s-ar putea să apară)
tr: '%s' ayrıştırılamadı: XML veri içeri aktarma doğrulaması çalışmayacak (bazı garip hatalar oluşabilir)
uk: Не вдалося обробити «%s»: перевірку імпортованих даних XML не буде виконано (у результаті можуть статися неочікувані помилки)

source: Spec's root node != 'data-set-spec': '%s'
ca: Node arrel de les especificacions != 'data-set-spec': «%s»
ro: Nodul de administrare ale specificațiilor != „data-set-spec”: „%s”
tr: Tanımlamanın kök düğümü != 'data-set-spec': '%s'
uk: Кореневий вузол специфікації != «data-set-spec»: «%s»

source: Missing node <parameters>: '%s'
ca: Manca el node <parameters>: «%s»
ro: Lipsește nodul <parameters>: „%s”
tr: Eksik düğüm <parameters>: '%s'
uk: Пропущено вузол <parameters>: «%s»

source: Data set does not allow modifications
ca: El conjunt de dades no permet modificacions
ro: Setul de date nu permite modificări
tr: Veri kümesi değişikliklere izin vermiyor
uk: Набір даних не дозволяє внесення змін

source: GdaHolder needs to have an ID
ca: GdaHolder necessita tenir un ID
ro: GdaHolder necesită un ID
tr: GdaHolder bir kimliğe (ID) sahip olması gerekir
uk: GdaHolder повинен мати ідентифікатор

source: One or more values are invalid
ca: Un o més valors no són vàlids
ro: Una sau mai multe valori nu sunt valide
tr: Bir ya da birden fazla değer geçersiz
uk: Одне або декілька значень є некоректними

source: Replacing data model must have the same characteristics as the data model it replaces
ca: La substitució del model de dades ha de tenir les mateixes característiques que el model de dades que substitueix
ro: Modelul de date care înlocuiește trebuie să aibă aceleași caracteristici ca modelul pe care îl înlocuiește
tr: Veri modeli değiştirme, değişeceği veri modeli ile aynı karaktere sahip olmak zorundadır
uk: Модель-замінник даних повинна мати ті самі характеристики, що і модель, яку вона замінює

source: Unknown part ID %u
ca: La part amb ID és desconeguda %u
ro: Parte de ID necunoscută %u
tr: Bilinmeyen ID kısmı %u
uk: Невідомий ідентифікатор частини %u

source: Unknown part type
ca: Tipus de part desconegut
ro: Tip de parte necunoscut
tr: Bilinmeyen kısım türü
uk: Невідомий тип частини

source: SqlBuilder is empty
ca: SqlBuilder és buit
ro: SqlBuilder este gol
tr: SqlBuilde boş
uk: SqlBuilder є порожнім

source: Wrong statement type
ca: Tipus de declaració erroni
ro: Tip de comandă incorectă
tr: Yanlış ifade türü
uk: Помилковий тип інструкції

source: Could not convert value to type '%s', value not defined
ca: No s'ha pogut convertir el valor al tipus «%s», valor no definit
ro: Nu s-a putut converti valoarea la tipul „%s”, valoarea nu este definită
tr: Değer, '%s' türüne dönüştürülemedi, değer tanımlı değil
uk: Не вдалося перетворити значення до типу «%s», значення не визначено

source: Unknown left part target ID %u
ca: Es desconeix l'ID de destinació de la part esquerra %u
ro: ID de destinație necunoscut %u pentru partea stângă
tr: Bilinmeyen sol kısım hedef ID %u
uk: Невідомий ідентифікатор лівої частини призначення, %u

source: Unknown right part target ID %u
ca: Es desconeix l'ID de destinació de la part dreta %u
ro: ID de destinație necunoscut %u pentru partea dreaptă
tr: Bilinmeyen sağ kısım hedef ID %u
uk: Невідомий ідентифікатор правої частини призначення, %u

source: Could not determine GType for parameter '%s'
ca: No s'ha pogut determinar GType per al paràmetre «%s»
ro: Nu s-a putut determina GType pentu parametrul „%s”
tr: '%s' parametresi için GType belirlenemedi
uk: Не вдалося визначити GType для параметра «%s»

source: Unnamed
ca: Sense nom
ro: Fără nume
tr: Adlandırılmamış
uk: Без назви

source: Can't handle default value of type '%s'
ca: No pot gestionar el valor per defecte de tipus «%s»
ro: Nu poate gestiona valoarea implicită de tipul „%s”
tr: '%s' türünün öntanımlı değeri işlenemez
uk: Не вдалося обробити типове значення типу «%s»

source: Missing SQL code
ca: Manca el codi SQL
ro: Lipsește codul SQL
tr: SQL kodu eksik
uk: Пропущено код SQL

source: No data handler for type '%s'
ca: No hi ha un gestor de dades per al tipus «%s»
ro: Niciun operator de date pentru tipul „%s”
tr: '%s' türü için veri işleyicisi yok
uk: Немає обробника даних для типу «%s»

source: Wrong parameter type for '%s': expected type '%s' and got '%s'
ca: Tipus de paràmetre incorrecte per a «%s»: tipus esperat «%s» s'obté «%s»
ro: Tip de parametru incorect pentru „%s”: s-a așteptat tipul „%s” și s-a obținut „%s”
tr: '%s' için yanlış parametre türü: beklenen tür '%s' ve alınan '%s'
uk: Помилковий тип параметра для «%s»: мав бути тип «%s», маємо — «%s»

source: Missing parameter '%s'
ca: Manca el paràmetre «%s»
ro: Lipsește parametrul „%s”
tr: '%s' parametresi eksik
uk: Пропущено параметр «%s»

source: Parameter '%s' is invalid
ca: El paràmetre «%s» no és vàlid
ro: Parametrul „%s” nu este valid
tr: '%s' parametresi geçersiz
uk: Параметр «%s» не некоректним

source: Unnamed parameter
ca: Paràmetre sense nom
ro: Parametru fără nume
tr: Adlandırılmamış parametre
uk: Параметр без назви

source: Malformed table name
ca: Nom de taula incorrecte
ro: Nume de tabelă greșit
tr: Kusurlu tablo adı
uk: Помилкове форматування назви таблиці

source: Join is not in a FROM statement
ca: La part «JOIN» no està en una declaració «FROM»
ro: Asociere nu se află într-o comandă FROM
tr: Birleştirme, FROM ifadesi içinde değil
uk: Долучення поза інструкцією FROM

source: Could not find target the join is for
ca: No s'ha pogut trobar el destí per al JOIN
ro: Nu s-a putut găsi destinația de unde provine asocierea
tr: Birleştirilecek hedef bulunamadı
uk: Не вдалося знайти цілі для об'єднання

source: Tells if the GdaTree is a list or a tree
ca: Indica si el GdaTree és una llista o un arbre
ro: Spune dacă GdaTree este o listă sau un arbore
tr: GdaTree bir liste ya da ağaç ise söyler
uk: Повідомляє, чим є GdaTree, списком чи ієрархією

source: Path format error: %s
ca: Error de format de camí: %s
ro: Eroare la formatul căii: %s
tr: Yol biçimi hatası: %s
uk: Помилка форматування шляху: %s

source: No connection and no GdaMetaStore specified
ca: No s'ha especificat cap connexió i no s'ha especificat cap GdaMetaStore
ro: Nicio conexiune și niciun GdaMetaStore specificat
tr: Belirtilmiş bir bağlantı ve GdaMetaStore yok
uk: Немає з'єднання і не вказано GdaMetaStore

source: No schema specified
ca: No s'ha especificat cap esquema
ro: Nicio schemă specificată
tr: Şema belirtilmedi
uk: Не вказано схеми

source: No table specified
ca: No s'ha especificat cap taula
ro: Nicio tabelă specificată
tr: Belirtilmiş tablo yok
uk: Не вказано таблиці

source: Unable to get column name
ca: No es pot obtenir el nom de la columna
ro: Nu s-a putut obține numele coloanei
tr: Sütun adı alınamadı
uk: Не вдалося отримати назву стовпчика

source: No name
ca: Sense nom
ro: Fără nume
tr: Adsız
uk: Без назви

source: Unable to get schema name
ca: No es pot obtenir el nom de l'esquema
ro: Nu s-a putut obține numele schemei
tr: Şema adı alınamadı
uk: Не вдалося отримати назву схеми

source: Could not get SELECT statement's parameters: %s
ca: No es van poder obtenir els paràmetres de la declaració SELECT: %s
ro: Nu s-au putut obține parametrii comenzii SELECT: %s
tr: SELECT ifadesinin parametreleri alınamadı: %s
uk: Не вдалося отримати параметри інструкції SELECT: %s

source: Could not bind SELECT statement's parameter '%s' to provided parameters: %s
ca: No es van poder vincular els paràmetres «%s» No es van poder vincular els paràmetres: %s
ro: Nu s-a putut lega parametrul „%s” al comenzii SELECT la parametrii furnizați: %s
tr: SELECT ifadesinin parametresi '%s', sağlanan parametrelere bağlanamadı: %s
uk: Не вдалося прив'язати параметр інструкції SELECT «%s» до наданих параметрів: %s

source: No connection specified
ca: No s'ha especificat cap connexió
ro: Nicio conexiune specificată
tr: Bağlantı belirtilmemiş
uk: Не вказано з'єднання

source: No SELECT statement specified
ca: No s'ha indicat cap declaració SELECT
ro: Nicio comandă SELECT specificată
tr: Belirtilmiş bir SELECT ifadesi yok
uk: Не вказано інструкції SELECT

source: No value specified for parameter '%s'
ca: Cap valor especificat per al paràmetre «%s»
ro: Nicio valoare specificată pentru parametrul „%s”
tr: '%s' parametresi için belirtilen bir değer yok
uk: Не вказано значення для параметра «%s»

source: Unable to get iterator's value
ca: No es pot obtenir el valor de l'iterador
ro: Nu s-a putut obține valoarea iteratorului
tr: Yineleyicinin değeri alınamıyor
uk: Не вдалося отримати значення ітератора

source: Unable to get table name
ca: No es pot obtenir el nom de la taula
ro: Nu s-a putut obține numele tabelei
tr: Tablo adı alınamıyor
uk: Не вдалося отримати назву таблиці

source: Field number %d not found in source named '%s'
ca: Número de camp %d no es troba a origen de les dades anomenat «%s»
ro: Numărul câmpului %d nu a fost găsit în sursa cu numele „%s”
tr: %d adlandırılmış kaynakta '%s' alan numarasın bulunamadı
uk: Поля із номером %d не знайдено у джерелі з назвою «%s»

source: SELECT statement has no FROM part
ca: La declaració SELECT no té part FROM
ro: Comanda SELECT nu are o parte FROM
tr: SELECT ifades FROM kısmına sahip değil
uk: У інструкції SELECT немає частини FROM

source: SELECT statement involves more than one table or expression
ca: La consulta SELECT involucra més d'una taula o expressió
ro: Comanda SELECT implică mai mult de o tabelă sau o expresie
tr: SELECT ifadesi bir tablo ya da ifadeden fazlasını içerir
uk: До інструкції SELECT включено декілька таблиць або виразів

source: Can only build modification statement for tables
ca: Només pot construir modificacions de consultes per a taules
ro: Se pot construi doar comenzi de modificare pentru tabele
tr: Yalnızca tablolar için değişim ifadesi oluşturulabilir
uk: Може побудувати інструкцію внесення змін лише для таблиць

source: Table does not have any primary key
ca: La taula no té cap clau primària
ro: Tabela nu are o cheie primară
tr: Tablo, herhangi bir birincil anahtara sahip değil
uk: У таблиці немає жодного основного ключа

source: Table's primary key is not part of SELECT
ca: La clau principal de la taula no forma part de SELECT
ro: Cheia primară a tabelei nu face parte din SELECT
tr: Tablonun birincil anahtarı SELECT ifadesinin bir parçası değil
uk: Основний ключ таблиці не є частиною SELECT

source: Table does not have any column
ca: La taula no té cap columna
ro: Tabela nu are nicio coloană
tr: Tabla her hangi bir sütuna sahip değil
uk: У таблиці немає жодного стовпчика

source: Table's column '%s' is not part of SELECT
ca: La columna de la taula «%s» no forma part de SELECT
ro: Coloana „%s” a tabelei nu face parte din SELECT
tr: Tablonun sütunu '%s' SELECT ifadesinin bir parçası değil
uk: Стовпчик «%s» не є частиною SELECT

source: Could not compute any field to insert into
ca: No s'ha pogut calcular cap camp on inserir-lo
ro: Nu s-a putut calcula orice câmp în care se poate insera
tr: Eklenecek bir alan hesaplanamadı
uk: Не вдалося обчислити жодного поля для вставлення

source: Missing table name in UPDATE statement
ca: Falta el nom de la taula en la declaració UPDATE
ro: Lipsește numele tabelei în comanda UPDATE
tr: UPDATE ifadesinde tablo adı eksik
uk: В інструкції UPDATE пропущено назву таблиці

source: Can't rewrite UPDATE statement to handle default values
ca: No es pot reescriure la declaració UPDATE per a gestionar els valors predeterminats
ro: Nu se poate rescrie comanda UPDATE pentru a gestiona valori implicite
tr: Öntanımlı değerleri işlemek için UPDATE ifadesi yeniden yazılamaz
uk: Не можна перезаписувати інструкцію UPDATE для обробки типових значень

source: Can't rewrite statement which is not INSERT or UPDATE
ca: No es pot reescriure una sentència que no sigui INSERT o UPDATE
ro: Nu se poate rescrie comanda care nu este INSERT sau UPDATE
tr: INSERT ya da UPDATE olmayan bir ifade yeniden yazılamıyor
uk: Не можна перезаписувати інструкцію, яка не є інструкцією INSERT або UPDATE

source: Missing parameter '%s' to execute query
ca: Falta paràmetre «%s» per a executar la consulta
ro: Lipsește parametrul „%s” pentru executarea interogării
tr: Sorgu çalıştırmak için '%s' parametresi eksik
uk: Пропущено параметр «%s» для виконання запиту

source: The 'first', 'second' and 'third' arguments must be different
ca: Els arguments 'primer', 'segon' i 'tercer' han de ser diferents
ro: Argumentele „primul”, „al doilea” și „al treilea” trebuie să fie diferite
tr: 'Birinci', 'ikinci' ve 'üçüncü' değişkenler farklı olmalıdır
uk: Аргументи «first», «second» і «third» мають бути різними

source: Invalid separator '%c'
ca: Separador «%c» no vàlid
ro: Separator nevalid „%c”
tr: Geçersiz ayırıcı '%c'
uk: Некоректний роздільник «%c»

source: Invalid null separator
ca: Separador nul no vàlid
ro: Separator nevalid de tip null
tr: Geçersiz boş ayırıcı
uk: Некоректний порожній роздільник

source: Unknown GDateDMY value %u
ca: Valor %ude GDateDMY no vàlid
ro: Valoare GDateDMY necunoscută %u
tr: Bilinmeye GDateDMY değeri %u
uk: Невідоме значення GDateDMY %u

source: Global transaction ID can not have more than 64 bytes
ca: La ID de transacció global no pot tenir més de 64 bytes
ro: ID-ul de tranzacție global nu poate avea mai mult de 64 de octeți
tr: Genel işlem ID 64 bayttan fazla olamaz
uk: Ідентифікатор загальної операції не може бути довшим за 64 байтів

source: Connection branch cannot exceed 63 bytes
ca: La branca de connexió no pot superar els 63 bytes
ro: Ramura de conexiune nu poate depăși 63 de octeți
tr: Bağlantı dalı 63 baytı geçemez
uk: Гілка з'єднання не може перевищувати 63 байтів

source: Connection already registered with another GdaXaTransaction object
ca: La connexió ja s'ha registrat amb un altre objecte GdaXaTransaction
ro: Conexiunea s-a înregistrat deja cu alt obiect GdaXaTransaction
tr: Bağlantı, GdaXaTransaction nesnes ile zaten kayıtlı
uk: З'єднання вже зареєстровано із іншим об'єктом GdaXaTransaction

source: Connection does not support distributed transaction
ca: La connexió no és compatible amb les transaccions distribuïdes
ro: Conexiunea nu suportă tranzacția distribuită
tr: Bağlantı dağıtık işlemleri desteklemiyor
uk: У з'єднанні не передбачено підтримки розподіленої операції

source: Cannot unregister connection not registered with GdaXaTransaction object
ca: No es pot destruir la connexió, no es va registrar amb un objecte GdaXaTransaction
ro: Nu se poate șterge înregistrarea pentru conexiunea care nu a fost înregistrată cu obiectul GdaXaTransaction
tr: GdaXaTransaction ile bağlanılmış bağlantı kesilemez
uk: Неможливо скасувати реєстрацію з'єднання, яке не зареєстровано за допомогою об'єкта GdaXaTransaction

source: Binary representation
ca: Representació binària
ro: Reprezentare binară
tr: İkili gösterim
uk: Двійкове представлення

source: Boolean representation
ca: Representació booleana
ro: Reprezentare logică
tr: Boole gösterimi
uk: Булеве представлення

source: Numerical representation
ca: Representació numèrica
ro: Reprezentare numerică
tr: Sayısal gösterim
uk: Числове представлення

source: Strings representation
ca: Representació de cadenes
ro: Reprezentare cu șiruri
tr: Karakter dizisi gösterimi
uk: Представлення рядків

source: Large String representation
ca: Representació de cadenes grans
tr: Büyük Dize gösterimi
uk: Представлення у форматі Large String

source: DD
tr: GG
uk: ДД

source: MM
tr: AA
uk: ММ

source: Time data handler can create an SQL representation of a value not holding time type.
ca: El gestor de dades de temps pot crear una representació SQL d'un valor que no tingui el tipus temps.
ro: Agentul de date de timp poate crea o reprezentare SQL a unei valori ce nu conține tipul timp.
tr: Zaman veri işleyicisi, zaman türünü tutmayan bir değerin SQL gösterimini oluşturabilir.
uk: Обробник даних часу може створювати SQL-представлення значення, яке не містить типу часу.

source: Time, Date and TimeStamp representation
ca: Representació d'hora, data i marca de temps
ro: Reprezentarea de oră, dată și marcaj de timp
tr: Time, Date ve TimeStamp gösterimi
uk: Представлення у форматі Time, Date і TimeStamp

source: Gda type representation
ca: Representació tipus Gda
ro: Reprezentare de tip Gda
tr: Gda türü gösterimi
uk: Представлення типу Gda

source: Could not find the '%s' program
ca: No s'ha pogut trobar el programa «%s»
ro: Nu s-a putut găsi programul „%s”
tr: '%s' programı bulunamadı
uk: Не вдалося знайти програму «%s»

source: Could not find the DocBook XSL stylesheet for HTML
ca: No s'ha pogut trobar el full d'estils DocBook XSL per a HTML
ro: Nu s-a putut găsi foaia de stiluri DocBook XSL pentru HTML
tr: HTML için DocBook XSL stili bulunamadı
uk: Не вдалося знайти таблицю стилів XSL DocBook для HTML

source: Could not find the DocBook XSL stylesheet for Formatting Objects
ca: No s'ha pogut trobar el full d'estils DocBook XSL per a formatar objectes
ro: Nu s-a putut găsi foaia de stiluri DocBook XSL pentru formatarea de obiecte
tr: Nesneleri biçimlendirmek için DocBook XSL stili bulunamadı
uk: Не вдалося знайти таблицю стилів XSL DocBook для об'єктів форматування

source: Object type '%s' cannot be declared in this context
ca: El tipus d'objecte «%s» no es pot declarar en aquest context
ro: Tipul de obiect „%s” nu poate fi declarat în acest context
tr: İçerikte '%s' nesne türü tanımlanamaz
uk: Тип об'єктів «%s» не можна оголошувати у цьому контексті

source: An object with the '%s' name has already been declared
ca: Ja s'ha declarat un objecte amb el nom «%s»
ro: Un obiect cu numele „%s” a fost declarat deja
tr: '%s' adlı bir nesne zaten tanımlanmış
uk: Об'єкт із назвою «%s» вже оголошено

source: Object type '%s' cannot be requested in this context
ca: No es pot requerir el tipus d'objecte «%s» a aquest context
ro: Tipul de obiect „%s” nu poate fi cerut în acest context
tr: İçerikte '%s' nesne türü istenemez
uk: Тип об'єктів «%s» не можна запитувати у цьому контексті

source: Unknown query '%s'
ca: Consulta «%s» desconeguda
ro: Interogare necunoscută „%s”
tr: Bilinmeyen sorgu '%s'
uk: Невідомий запит «%s»

source: No connection named '%s' found
ca: No s'ha trobat cap connexió anomenada «%s»
ro: Nu s-a găsit o conexiune cu numele „%s”
tr: Bulunmuş '%s' adlı bir bağlantı yok
uk: Не знайдено з'єднання із назвою «%s»

source: Query is not specified (not named and not defined)
ca: No s'ha especificat la consulta (sense nom i sense definició)
ro: Interogarea nu este specificată (nu este numită și definită)
tr: Sorgu belirtilmemiş (adlandırılmamış ve tanımlanmamış)
uk: Запит не вказано (не має назви або не визначено)

source: Unknown parameter '%s'
ca: Paràmetre «%s» desconegut
ro: Parametru necunoscut „%s”
tr: Bilinmeyen parametre '%s'
uk: Невідомий параметр «%s»

source: Parameter name not specified
ca: No s'ha especificat el nom del paràmetre
ro: Numele parametrului nu este specificat
tr: Parametde adı belirtilmemiş
uk: Не вказано назви параметра

source: No expression specified
ca: No s'ha especificat cap expressió
ro: Nicio expresie specificată
tr: İfade belirtilmemiş
uk: Не вказано виразу

source: Cannot cast value from type '%s' to type '%s'
ca: No es pot executar un «cast» sobre el paràmetre del tipus «%s» al tipus «%s»
ro: Nu se poate distribui valoarea de la tipul „%s” la tipul „%s”
tr: Değer, '%s' türünden '%s' türüne çevrilemiyor
uk: Не можна приводити значення з типу «%s» до типу «%s»

source: Cannot cast parameter from type '%s' to type '%s'
ca: No es pot executar un «cast» sobre el paràmetre del tipus «%s» al tipus «%s»
ro: Nu se poate distribui parametrul de la tipul „%s” la tipul „%s”
tr: Parametre, '%s' türünden '%s' türüne çevrilemiyor
uk: Не можна приводити параметр з типу «%s» до типу «%s»

source: Expression '%s' should return exactly one value
ca: L'expressió «%s» hauria de tornar exactament un valor
ro: Expresia „%s” ar trebui să întoarcă exact o valoare
tr: '%s' ifadesi tam bir değer dönürmesi gerekir
uk: Вираз «%s» має повертати точно одне значення

source: Binary data
ca: Dada binària
ro: Date binare
tr: İkili veri
uk: Двійкові дані

source: link
ca: enllaç
ro: legătură
tr: bağlantı
uk: Посилання

source: Document not specified
ca: Document no especificat
ro: Documentul nu este specificat
tr: Belge belirtilmemiş
uk: Не вказано документа

source: Cannot create temporary file
ca: No es pot crear un fitxer temporal
ro: Nu se poate crea fișierul temporar
tr: Geçici dosya oluşturulamıyor
uk: Не вдалося створити тимчасовий файл

source: Execution of the %s program failed: %s
ca: L'execució del programa %s ha fallat: %s
ro: Executarea programului %s a eșuat: %s
tr: %s programı çalıştırılamadı: %s
uk: Помилка під час виконання програми %s: %s

source: This report document does not handle %s output
ca: Aquest document d'informe no gestiona sortides en %s
ro: Acest document de raport nu gestionează ieșirea %s
tr: Bu rapor belgesi %s çıktısını işleyemez
uk: У цьому документі звіту не передбачено обробки виведення %s

source: Internal error, creating table in SQLite provider
ca: S'ha produït un error intern en crear la taula al proveïdor SQLite
tr: SQLite sağlayıcısında tablo oluşturma iç hatası
uk: Внутрішня помилка, створення таблиці у засобі надання даних SQLite

source: No fields are defined for CREATE TABLE operation
ca: No hi ha camps definits per a l'operació CREATE TABLE
ro: Niciun câmp u a fost definit pentru operația CREATE TABLE
tr: CREATE TABLE işlemi için tanımlanmış alan yok
uk: Не визначено полів для дії CREATE TABLE

source: No field specified in foreign key constraint
ca: No existeix el camp especificat en la restricció de la clau externa
ro: Nu este specificat un câmp în restricția cheii străine
tr: Yabancı anahtar kısıtında alan belirtilmemiş
uk: Не вказано поля у обмеженні стороннього ключа

source: Table to create must have at least one field
ca: La taula a crear ha de tenir almenys un camp
tr: Oluşturulacak tablonun en az bir alanı olmalı
uk: Створена таблиця має містити принаймні одне поле

source: SQLite binary representation
ca: Representació binària SQLite
ro: Reprezentare binară SQLite
tr: SQLite ikili gösterim
uk: Двійкове представлення SQLite
