Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: Create table only if it does not yet exist
ca: Crear taula només si encara no existeix
ro: Creează tabelă doar dacă nu există încă
tr: Yalnızca henüz yoksa tablo oluştur
uk: Створити таблицю, лише якщо її ще не існує

source: Table's columns
ca: Columnes de la taula
ro: Coloanele tabelei
tr: Tablonun sütunları
uk: Стовпчики таблиці

source: Auto increment
ro: Mărire automată
tr: Otomatik artış
uk: Автозбільшення

source: Unique
ca: Únic
ro: Unic
tr: Eşsiz
uk: Унікальна

source: Primary key
ca: Clau primària
ro: Cheie primară
tr: Birincil anahtar
uk: Первинний ключ

source: Default value
ca: Valor per defecte
ro: Valoare implicită
tr: Öntanımlı değer
uk: Значення без обумовлення

source: Conflict
ca: Conflicte
tr: Çakışma
uk: Конфлікт

source: Conflict resolution method (ROLLBACK|ABORT|FAIL|IGNORE|REPLACE)
ca: Mètode de resolució de conflictes (ROLLBACK|ABORT|FAIL|IGNORE|REPLACE)
ro: Metodă de rezolvare a conflictului (ROLLBACK|ABORT|FAIL|IGNORE|REPLACE)
tr: Çakışma çözme yöntemi (ROLLBACK|ABORT|FAIL|IGNORE|REPLACE)
uk: Спосіб вирішення конфліктів (ROLLBACK|ABORT|FAIL|IGNORE|REPLACE)

source: Foreign key
ca: Clau externa
ro: Cheie străină
tr: Yabancı anahtar
uk: Зовнішній ключ

source: Referenced table
ca: Taula referenciada
ro: Tabelă referețiată
tr: Başvurulan tablo
uk: Еталонна таблиця

source: Fields
ca: Camps
ro: Câmpuri
tr: Alanlar
uk: Поля

source: Fields in the foreign key
ca: Camps en la clau externa
ro: Câmpurile din cheia străină
tr: Yabancı anahtardaki alanlar
uk: Поля у сторонньому ключі

source: Field
ca: Camp
ro: Câmp
tr: Alan
uk: Поле

source: Referenced field
ca: Camp referenciat
ro: Câmp referențiat
tr: Başvurulan alan
uk: Еталонне поле

source: Match type
ca: Tipus de coincidència
ro: Potrivește tip
tr: Eşleştirme türü
uk: Тип відповідності

source: Matching method if more than one field involved
ca: Mètode de coincidència si hi ha més d'un camp afectat
ro: Metoda de potrivire dacă mai mult de un câmp este implicat
tr: Birden fazla alanla ilişkili ise eşleştirme yöntemi
uk: Спосіб встановлення відповідності, якщо стосується декількох полів

source: On update action
ca: Acció en actualitzar
ro: La acțiunea actualizare
tr: Hareket güncellemede
uk: Дія при оновленні

source: On delete action
ca: Acció en esborrar
ro: La acțiunea ștergere
tr: Silme hareketinde
uk: Дія при вилученні

source: Global constraints
ca: Restriccions globals
ro: Restricții globale
tr: Evrensel kısıtlamalar
uk: Загальні обмеження

source: View's description
ca: Descripció de la vista
ro: Descrierea vizualizării
tr: Görünüm açıklaması
uk: Опис перегляду

source: View's name
ca: Nom de la vista
ro: Numele vizualizării
tr: Görünüm adı
uk: Назва перегляду

source: Temporary view
ca: Vista temporal
ro: Vizualizare temporară
tr: Geçici görünüm
uk: Тимчасовий перегляд

source: Create view only if it does not yet exist
ca: Crear una vista només si encara no existeix
ro: Creează vizualizare numai dacă nu există încă
tr: Yalnızca henüz yoksa görünüm oluştur
uk: Створити перегляд, лише якщо його не існує

source: View's definition
ca: Definició de la vista
ro: Definiția vizualizării
tr: Görünüm tanımlaması
uk: Визначення перегляду

source: Index
ca: Índex
ro: Indice
tr: İndeks
uk: Покажчик

source: Index to delete
ca: Índex per a eliminar
ro: Indice ce trebuie șters
tr: Silinecek indeks
uk: Покажчик для вилучення

source: If exists
ca: Si existeix
ro: Dacă există
tr: Varsa
uk: Якщо існує

source: Drop index only if it exists
ca: Eliminar l'índex només si existeix
ro: Renunță la indice doar dacă există
tr: Yalnızca varsa indeksi sil
uk: Скинути покажчик, лише якщо він існує

source: Table to delete
ca: Taula a eliminar
ro: Tabelă ce trebuie ștearsă
tr: Silinecek tablo
uk: Таблиця для вилучення

source: Drop table only if it exists
ca: Eliminar la taula només si existeix
ro: Renunță la tabelă doar dacă există
tr: Yalnızca varsa tabloyu sil
uk: Скинути таблицю, лише якщо вона існує

source: View
ca: Visualitza
ro: Vizualizare
tr: Görünüm
uk: Відображення

source: View to delete
ca: Vista a eliminar
ro: Vizualizare ce trebuie ștearsă
tr: Silinecek görünüm
uk: Перегляд, який слід вилучити

source: Drop view only if it exists
ca: Eliminar la vista només si existeix
ro: Renunță la vizualizare doar dacă există
tr: Yalnızca varsa görünümü sil
uk: Скинути перегляд, лише якщо він існує

source: The name of a database to use (without the .db)
ca: El nom d'una base de dades a utilitzar (sense el .db)
ro: Numele unei baze de date de utilizat (fără .db)
tr: Kullanılacak veri tabanının adı (.db olmadan)
uk: Назва бази даних, якою слід скористатися (без .db)

source: Append '.db'
ca: Afegir '.db'
ro: Adaugă „.db”
tr: '.db' ekle
uk: Дописати «.db»

source: Defines if the '.db' extension need to be appended to the DB_NAME argument
ca: Defineix si cal afegir l'extensió ".db" a l'argument DB_NAME
ro: Definește dacă extensia „.db” trebuie să fie adăugată la argumentul NUME_DB
tr: '.db' uzantısının DB_NAME değişkenine eklenmesi gerektiğini tanımlar
uk: Визначає, чи слід дописувати суфікс назви «.db» слід до аргументу DB_NAME

source: Extra functions
ca: Funcions extres
ro: Funcții suplimentare
tr: Fazlada fonksiyonlar
uk: Додаткові функції

source: Enable usage of extra functions (gda_upper, ...)
ca: Habilita l'ús de funcions addicionals (gda_upper, ...)
ro: Permite utilizarea funcțiilor suplimentare (gda_upper,...)
tr: Fazladan fonksiyonların kullanımını etkinleştir (gda_upper, ...)
uk: Дозволити використання додаткових функцій (gda_upper, ...)

source: Define REGEXP
ca: Definir REGEXP
ro: Definește REGEXP
tr: REGEXP tanımla
uk: Визначити REGEXP

source: Define the REGEXP function
ca: Definir la funció REGEXP
ro: Definește funcția REGEXP
tr: REGEXP fonksiyonu tanıma
uk: Визначити функцію REGEXP

source: Localized comparisons
ca: Comparacions per localització
ro: Comparații localizate
tr: Yerel karşılaştırmalar
uk: Локалізовані порівняння

source: Enable usage of extra collation methods (LOCALE and DCASE)
ca: Habilita l'ús de mètodes d'intercalació addicionals (LOCALE i DCASE)
ro: Permite utilizarea de metode suplimentare de ordonare alfabetică (LOCALE și DCASE)
tr: Fazladan karşılaştırma yöntemlerinin kullanımını etkinleştir (LOCALE ve DCASE)
uk: Увімкнути використання додаткових способів злиття (LOCALE і DCASE)

source: With foreign keys
ca: Amb claus externes
ro: Cu chei străine
tr: Yabancı anahtarlar ile
uk: Без сторонніх ключів

source: Enforce foreign keys
ca: Forçar claus externes
ro: Folosește chei străine
tr: Yabancı anahtarları zorla
uk: Примусові сторонні ключі

source: Allow extensions
ca: Permetre extensions
ro: Permite extensii
tr: Eklentilere izin ver
uk: Дозволити суфікси назв

source: Allow SQLite to load extensions using the load_extension() function
ca: Permet que SQLite carregui les extensions usant la funció load_extension()
ro: Permite SQLite să încarce extensii utilizând funcția load_extension()
tr: SQLilte 'ın load_extension() fonksiyonunu kullanarak eklenti yüklemesine izin ver
uk: Дозволити SQLite завантажувати розширення за допомогою функції load_extension()

source: Table to rename
ca: Taula a canviar de nom
ro: Tabelă de redenumit
tr: Yeniden adlandırılacak tablo
uk: Таблиця для перейменування

source: New name
ca: Nom nou
ro: Nume nou
tr: Yeni ad
uk: Нова назва

source: New table name
ca: Nom nou de la taula
ro: Nume de tabelă nouă
tr: Yeni tablo adı
uk: Назва нової таблиці

source: Can't find libdb_sql-5.
ca: No es pot trobar la libdb_sql-5.
ro: Nu se poate găsi libdb_sql-5.
tr: libdb_sql-5 bulunamıyor.
uk: Не вдалося знайти libdb_sql-5.

source: Provider for Berkeley DB SQL databases
ca: Proveïdor de bases de dades SQL Berkeley DB
tr: Berkeley DB SQL veritabanları için sağlayıcı
uk: Постачальник для баз даних Berkeley SQL DB

source: The name of a database to connect to (without the .fdb)
ca: El nom d'una base de dades per a connectar-se (sense el .fdb)
ro: Numele unei baze de date la care să se conecteze (fără .db)
tr: Bağlanılacak veri tabanının adı (.fdb olmadan)
uk: Назва бази даних, якою слід скористатися (без .db)

source: Provider for Firebird databases
ca: Proveïdor de bases de dades Firebird
ro: Furnizor pentru bazele de date Firebird
tr: Firebird veritabanları için sağlayıcı
uk: Надавач даних для баз даних Firebird

source: Provider for embedded Firebird databases
ca: Proveïdor de bases de dades Firebird incrustades
ro: Furnizor pentru bazele de date înglobate Firebird
tr: Gömülü Firebir veritabanları için Sağlayıcı
uk: Надавач даних для вбудованих баз даних Firebird

source: Invalid argument: NULL
ca: Argument no vàlid: NULL
ro: Argument nevalid: NULL
tr: Geçersiz değişken: NULL
uk: Некоректний аргумент: NULL

source: Can't read BLOB
ca: No es pot llegir el BLOB
ro: Nu se poate citi BLOB
tr: BLOB okunamıyor
uk: Не вдалося прочитати BLOB

source: Table to create must have at least one row
ca: La taula a crear ha de tenir almenys una fila
ro: Tabela de creat trebuie să aibă cel puțin un rând
tr: Oluşturulacak tablo en az bir satıra sahip olmalıdır
uk: Створена таблиця має містити принаймні один рядок

source: Missing parameters to open database connection
ca: Falten paràmetres per a obrir la connexió a la base de dades
ro: Lipsesc parametrii pentru deschiderea unei conexiuni la baza de date
tr: Veri tabanı bağlantısı açmak için parametreler eksik
uk: Не вказано параметри для відкриття з'єднання бази даних

source: Invalid date: year %d, month %d and day %d
ca: Data no vàlida: any %d, mes %d i dia %d
ro: Dată nevalidă: ziua %d, luna %d și anul %d
tr: Geçersiz tarih: yıl %d, ay %d ve gün %d
uk: Некоректна дата: рік %d, місяць %d і день %d

source: Can't get BLOB's size
ca: No es pot obtenir la mida del BLOB
ro: Nu se poate obține dimensiunea BLOBului
tr: BLOB boyutu alınamıyor
uk: Не вдалося отримати розмір BLOB

source: The name of a database to connect to
ca: El nom d'una base de dades per a connectar-se
ro: Numele unei baze de date pentru a se conecta la
tr: Bağlanılacak veri tabanının adı
uk: Назва бази даних, якою слід скористатися

source: Instance
ca: Instància
ro: Instanță
tr: Örnek
uk: Екземпляр

source: The instance to connect to, if not specified, a connection to the default instance is made
ca: Si no s'especifica, es fa una instància per a connectar-se a una instància predeterminada
ro: Instanța la care să se conecteze, dacă nu e specificată, o conexiune la instanța implicită este făcută
tr: Bağlanılacak durum, eğer belirtilmemiş ise, öntanımlı duruma bir bağlantı yapılmıştır
uk: Екземпляр для з'єднання. Якщо не вказано, буде встановлено з'єднання із типовим екземпляром

source: Database server
ca: Servidor de bases de dades
ro: Server pentru baza de date
tr: Veri tabanı sunucusu
uk: Сервер бази даних

source: Host on which the database server is running or leave this field empty
ca: Amfitrió on s'està executant el servidor de base de dades o deixeu aquest camp buit
ro: Gazdă pe care rulează serverul pentru baza de date sau lăsați acest câmp gol
tr: Veri tabanı sunucunun koştuğu makine veya bu alanı boş bırakın
uk: Вузол, на якому запущено сервер бази даних, можна не заповнювати

source: Port
tr: Bağlantı Noktası
uk: Порт

source: Database server port, 1433 by default
ca: Port de servidor de base de dades, per defecte 1433
ro: Portul serverului pentru baza de date, implicit 1433
tr: Veri tabanı sunucusu bağlantı noktası, öntanımlı 1433
uk: Порт сервера бази даних, типово 1433

source: Connection URL
ca: Connexió URL
ro: URL de conexiune
tr: Bağlantı adresi
uk: Адреса з'єднання

source: Connection string required by the JDBC driver, refer to the used JDBC driver for its contents and format
ca: Cadena de connexió requerida pel driver JDBC, referit al driver JDBC usat per al seu contingut i format
ro: Șirul de conexiune necesar de driverul JDBC, consultați driverul JDBC folosit pentru conținutul și formatul lui
tr: Bağlantı dizgesi JDBC tarafında isteniyor, içeriği ve biçimi için JDBC tarafından kullanılacak
uk: Для драйвера JDBC потрібен рядок з'єднання, ознайомтеся із документацією до використаного драйвера JDBC щодо його даних та формату

source: Can't get list of installed JDBC drivers: %s
ca: No es pot obtenir la llista de controladors JDBC instal·lats: %s
ro: Nu se poate obține lista unităților JDBC instalate: %s
tr: Kurulu JDBC sürücülerinin listesi alınamıyr: %s
uk: Не вдалося отримати список встановлених JDBC: %s

source: Could not find Libgda's JAR (gdaprovider-6.0.jar), JDBC provider is unavailable.
ca: No s'ha pogut trobar el JAR de Libgda (gdaprovider-6.0.jar), el proveïdor de JDBC no està disponible.
tr: Libgda JAR dosyası (gdaprovider-6.0.jar) bulunamadı, JDBC sağlayıcısı yok.
uk: Не вдалося знайти JAR Libgda (gdaprovider-6.0.jar), надавач даних JDBC є недоступним.

source: Can't create JAVA virtual machine: %s
ca: No es pot crear una màquina virtual JAVA: %s
ro: Nu se poate crea mașina virtuală JAVA: %s
tr: JAVA sanal makinası oluşturulamıyor: %s
uk: Не вдалося створити віртуальну машину JAVA: %s

source: Could not find the JVM runtime (libjvm.so), JDBC provider is unavailable.
ca: No s'ha pogut trobar el temps d'execució de JVM (libjvm.so). El proveïdor de JDBC no està disponible.
ro: Nu s-a putut executa JVM (libjvm.so), furnizorul JDBC nu este disponibil.
tr: JVM çalışma zamanı (libjvm.so) bulunamadı, JDBC sağlayıcı yok.
uk: Не вдалося знайти середовище виконання JVM (libjvm.so), надавач даних JDBC є недоступним.

source: Dummy GdaDataModelLdap object: if you see this message in your application then it's likely that there is an installation problem with the LDAP provider. In any case the GdaDataModelLdap object won't be useable.
ca: Objecte Dummy GdaDataModelLdap: si veieu aquest missatge a l'aplicació, és probable que hi hagi un problema d'instal·lació amb el proveïdor LDAP. En qualsevol cas, l'objecte GdaDataModelLdap no serà útil.
ro: Obiect GdaDataModelLdap temporar: dacă vedeți acest mesaj în cererea dumneavoastră, atunci este probabil să existe o problemă de instalare cu furnizorul LDAP. În orice caz obiectul GdaDataModelLdap nu va fi utilizabil.
tr: Yapay GdaDataModelLdap nesnesi: Eğer uygulamanızda bu iletiyi görürseniz, büyük ihtimalle LDAP sağlayıcısının bir yükleme problemi var demektir. Herhangi bir durumda GdaDataModelLdap nesnesi kullanılabilir olmayacaktır.

source: Error storing list of created LDAP tables: %s
ca: S'ha produït un error en emmagatzemar la llista de taules LDAP creades: %s
ro: Eroare la stocarea listei de tabele LDAP create: %s
tr: Oluşturulmuş LDAP tablolarının hata saklama listesi: %s
uk: Помилка під час спроби зберегти список створених таблиць LDAP: %s

source: File used to store startup data
ca: Fitxer que s'utilitza per a emmagatzemar dades d’inici
ro: Fișier utilizat pentru a stoca date de pornire
tr: Başlangıç verisini depolamak için kullanılan dosya
uk: Файл, який використовують для зберігання даних для запуску

source: Error recreating LDAP tables: %s
ca: S'ha produït un error en tornar a crear taules LDAP: %s
ro: Eroare la refacerea tabelelor LDAP: %s
tr: LDAP tabloları yeniden oluşturulurken hata: %s
uk: Помилка під час спроби повторного створення таблиць LDAP: %s

source: Can't remove non LDAP virtual table
ca: No es pot eliminar la taula virtual que no sigui LDAP
ro: Nu se poate elimina tabela virtuală non LDAP
tr: LDAP olmayan sanal tablo silinemiyor
uk: Не можна вилучати віртуальні таблиці, які не є таблицями LDAP

source: Can't describe non LDAP virtual table
ca: No es pot descriure cap taula virtual que no sigui LDAP
ro: Nu se poate descrie tabela virtuală non LDAP
tr: LDAP olmayan sanal tablo tanımlanamıyor
uk: Неможливо описати віртуальну таблицю, яка не є таблицею LDAP

source: Unknown LDAP virtual table
ca: Taula virtual LDAP desconeguda
ro: Tablă virtuală LDAP necunoscută
tr: Bilinmeyen LDAP sanal tablosu
uk: Невідома віртуальна таблиця LDAP

source: The connection string must contain the DB_NAME value
ca: La cadena de connexió ha de contenir el valor de DB_NAME
ro: Șirul de conexiune trebuie să conțină valoarea DB_NAME
tr: Bağlantı dizgesi DB_NAME değerine sahip olmalıdır
uk: Рядок з'єднання має містити значення DB_NAME

source: Invalid value for 'TLS_REQCERT'
ca: El valor no és vàlid per a «TLS_REQCERT»
ro: Valoare nevalidă pentru „TLS_REQCERT”
tr: 'TLS_REQCERT' için geçersiz değer
uk: Некоректне значення для «TLS_REQCERT»

source: Too many arguments
ca: Massa arguments
ro: Prea multe argumente
tr: Çok fazla değişken
uk: Забагато аргументів

source: Unknown
ca: Desconegut
ro: Necunoscut
tr: Bilinmeyen
uk: Невідомо

source: Parameter
ca: Paràmetre
ro: Parametru
tr: Parametre
uk: Параметр

source: near "%s": syntax error
ca: prop de «%s»: error de sintaxi
ro: lângă „%s”: eroare de sintaxă
tr: "%s" yakınlarında: sözdizimi hatası
uk: поряд із «%s»: синтаксична помилка

source: LDAP server returned more than one entry with DN '%s'
ca: El servidor LDAP ha retornat més d'una entrada amb DN «%s»
ro: Serverl LDAP a returnat mai multe intrări cu DN „%s”
tr: LDAP sunucusu, DN '%s' ile birden fazla girdi döndürdü
uk: Сервером LDAP повернуто декілька записів із DN «%s»

source: Could not parse distinguished name returned by LDAP server
ca: No s'ha pogut analitzar el nom distintiu retornat pel servidor LDAP
ro: Nu s-a putut analiza numele distins returnat de serverul LDAP
tr: LDAP sunucusunca döndürülen eşsiz ad ayrıştırılamadı
uk: Не вдалося обробити розпізнавану назву, яку було повернуто сервером LDAP

source: Unexpected data type '%s' for objectClass attribute!
ca: Tipus de dades inesperat «%s» per a l'atribut objectClass.
ro: Tip de date neașteptat „%s” pentru atributul objectClass!
tr: objectClass özniteliği için beklenmedik veri türü '%s'!
uk: Неочікуваний тип даних «%s» для атрибута objectClass!

source: No LDAP connection specified
ca: No s'ha especificat cap connexió LDAP
ro: Nicio conexiune LDAP specificată
tr: LDAP bağlantısı belirtilmemiş
uk: Не вказано з'єднання LDAP

source: Distinguished name
ca: Nom distintiu
ro: Nume distins
tr: Eşsiz ad
uk: Розпізнавана назва

source: Relative distinguished name
ca: Nom distintiu relatiu
ro: Nume relativ distins
tr: İlişkili eşsiz ad
uk: Відносна розпізнавана назва

source: Multiple value LDAP attribute does not fit into a single value
ca: L'atribut LDAP de valor múltiple no s'ajusta a un únic valor
ro: Atributul LDAP cu valori multiple nu se încadrează într-o sigură valoare
tr: Çoklu değer LDAP özniteliği, tek bir değerin içine sığmıyor
uk: Атрибут LDAP із декількох значень не вміщується до одного значення

source: Truncated result because LDAP server limit encountered
ca: Resultat truncat perquè s'ha trobat el límit del servidor LDAP
ro: Rezultatul trunchiat deoarece s-a atins limita serverului LDAP
tr: Kesilmiş sonuç, çünkü LDAP sunucusu sınırına aşıldı
uk: Обрізаний результат через перевищення обмежень сервера LDAP

source: No GdaLdapEntry specified
ca: No s'ha especificat cap GdaLdapEntry
ro: Nicio GdaLdapEntry specificată
tr: GdaLdapEntry belirtilmemiş
uk: Не вказано GdaLdapEntry

source: Unknown GdaLdapModificationType %d
ca: GdaLdapModificationType desconegut %d
ro: GdaLdapModificationType %d necunoscut
tr: Bilinmeyen GdaLdapModificationType %d
uk: Невідомий GdaLdapModificationType %d

source: No GdaLdapEntry specified to compare attributes
ca: No s'ha especificat cap GdaLdapEntry per a comparar atributs
ro: Nicio GdaLdapEntry specificată pentru a compara atributele
tr: Özniteliklerin kıyaslamasında bir GdaLdapEntry belirtilmemiş
uk: Не вказано GdaLdapEntry для порівняння атрибутів

source: GdaLdapEntry specified to compare have different DN
ca: Les GdaLdapEntry especificades per a comparar tenen DN diferents
ro: GdaLdapEntry specificată pentru comparație are DN-uri diferite
tr: Farklılık gösteren DN karşılatırması için GdaLdapEntry belirtilmiş
uk: Вказаний GdaLdapEntry для порівняння має інший DN

source: User name, as a DN or simple user name, for Active Directory may be username@DOMAIN or DOMAIN\username
ca: El nom d'usuari, com a DN o nom d'usuari senzill, del directori actiu pot ser usuari@DOMINI o DOMINI\usuari
ro: Numele de utilizator, ca un DN sau nume de utilizator simplu, pentru Directorul Activ poate fi numedeutilizator@DOMENIU sau DOMENIU\ numedeutilizator (fără spațiu)
tr: Kullanıcı adı, bir DN ya da basit bir kullanıcı adı, Active Directory kullanici_adi@ALANADI ya da ALANADI\kullanici_adi şeklinde olabilir
uk: Ім'я користувача, як DN або просте ім'я користувача, для Active Directory може записуватися у формі користувач@ДОМЕН або ДОМЕН\користувач

source: Base name
ca: Nom base
ro: Nume de bază
tr: Taban adı
uk: Базова назва

source: Base distinguished name, starting point for the searches
ca: Nom base distintiu, punt de partida per a les recerques
ro: Nume distins de bază, punct de plecare pentru căutări
tr: Taban ayırt edici adı, aramalar için başlangıç noktasıdır
uk: Базова розпізнавана назва, початкова точка для пошуків

source: Host on which the LDAP server is running
ca: Amfitrió on s'està executant el servidor LDAP
ro: Gazdă pe care se execută serverului LDAP
tr: LDAP sunucusunun çalıştığı makine
uk: Вузол, на якому запущено сервер LDAP

source: Database server port (leave this field empty to use the default port)
ca: Port del servidor de base de dades (deixeu aquest camp buit per a utilitzar el port predeterminat)
ro: Portul serverului de baze de date (lăsați acest câmp liber pentru a folosi portul implicit)
tr: Veritabananı sunucu bağlantı noktası (öntanımlı bağlantı noktasını kullanmak için, bu alanı boş bırakın)
uk: Порт сервера бази даних (не заповнюйте, якщо слід використовувати типовий порт)

source: Require SSL
ca: Requereix SSL
ro: Necesită SSL
tr: SSL gerekli
uk: Потребує SSL

source: Whether or not to use SSL to establish the connection
ca: Determina si s'utilitza SSL per a establir la connexió
ro: Dacă să se folosească sau nu SSL pentru stabilirea conexiunii
tr: Bağlantı kurmak için SSL olsun ya da olmasın
uk: Визначає, чи слід використовувати SSL для встановлення з'єднання

source: Certificate check type
ca: Tipus de comprovació de certificat
ro: Tipul de verificare a certificatului
tr: Sertifika denetim türü
uk: Тип перевірки сертифіката

source: Specifies what checks to perform on server certificates in a SSL/TLS session
ca: Especifica les comprovacions de certificats de servidor que es porten a terme en una sessió SSL/TLS
ro: Specifică ce să se verifice la certificatele de server într-o sesiune SSL/TLS
tr: SSL/TLS oturumunda, sunucu sertifikalarında yapılacak denetimleri belirler
uk: Визначає перелік перевірок, які слід виконати для сертифікатів серверів у сеансі SSL/TLS

source: Certificates file
ca: Fitxer de certificats
ro: Fișierul certificatelor
tr: Sertifikalar dosyası
uk: Файл сертифіката

source: Specifies the file that contains certificates for all of the recognized Certificate Authorities, in a SSL/TLS session
ca: Especifica el fitxer que conté certificats per a totes les autoritats de certificat reconegudes, en una sessió SSL / TLS
ro: Specifică fișierul care conține certificate pentru toate Autoritățile de certificare recunoscute, într-o sesiune SSL/TLS
tr: SSL/TLS oturumunda, tanınan tüm Sertifika Otoriteleri için içerilecek sertifikaların dosyasını belirler
uk: Визначає файл, який містить сертифікати для всіх розпізнаних служб сертифікації у сеансі SSL/TLS

source: Cache server data
ca: Memòria cau
ro: Adaugă datele serverului în cache
tr: Ön bellek sunucusu verisi
uk: Кешувати дані сервера
