Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: If set to TRUE, characters are all displayed using a single 'invisible' character, suitable to enter passwords
ca: Si està en TRUE, tots els caràcters es mostren utilitzant un únic caràcter «invisible», apropiat per a introduir contrasenyes
ro: Dacă este stabilit la TRUE, caracterele sunt afișate utilizând un singur caracter „invizibil”, portrivit pentru introducerea de parole
tr: Eğer TRUE olarak ayarlanırsa, karakterler tek bir 'görünmez' karakter kullanarak gösterilecek, parola girmeye uygun olacak
uk: Якщо встановлено значення TRUE, символи буде показано за допомогою єдиного «невидимого» символу, який пасує для введення паролів

source: Unknown format character starting at %s
ca: Caràcter de format desconegut a partir de %s
ro: Caracter de format necunoscut începând de la %s
tr: Şurada bilinmeyen biçim karakter başlangıcı: %s
uk: Невідомий символ форматування, що починається з %s

source: Type %s is not numerical
ca: El tipus %s no és numèric
ro: Tipul %s nu este numeric
tr: %s türü sayısal değil
uk: Тип %s не є числовим

source: Decimal separator cannot be the '%c' character
ca: El separador decimal no pot ser el caràcter «%c»
ro: Separatorul zecimal nu poate fi caracterul „%c”
tr: Ondalık ayırıcı '%c' karakteri olamaz
uk: Роздільником дробової частини не може бути символ «%c»

source: Decimal thousands cannot be the '%c' character
ca: El separador de milers no pot ser el caràcter «%c»
ro: Separatorul zecimal de mii nu poate fi caracterul „%c”
tr: Ondalık binler '%c' karakteri olamaz
uk: Роздільником тисяч не може бути символ «%c»

source: Empty data
ro: Date libere
tr: Boş veri
uk: Порожні дані

source: Unhandled type of data
ca: Tipus de dades no manipulat
ro: Tip de date negestionat
tr: İşlenemeyen veri türü
uk: Непридатний до обробки тип даних

source: Error while interpreting data as an image: %s
ca: S'ha produït un error en interpretar dades com a imatge: %s
ro: Eroare în timpul interpretării datelor ca o imagine: %s
tr: Veri resim olarak yorumlanırken hata: %s
uk: Помилка під час спроби обробити дані як зображення: %s

source: _Copy image
ca: _Copia la imatge
ro: _Copiază imaginea
tr: Resim _Kopyala
uk: _Копіювати зображення

source: _Load image from file
ca: _Carregar la imatge des del fitxer
ro: Înc_arcă imagine din fișier
tr: Dosyadan resim _yükle
uk: З_авантажити зображення з файла

source: _Save image
ca: _Desar la imatge
ro: _Salvează imagine
tr: Resmi _kaydet
uk: З_берегти зображення

source: Select image to load
ca: Seleccioneu la imatge que voleu carregar
ro: Selectează imagine de încărcat
tr: Yüklenecek resmi seçin
uk: Виберіть зображення для завантаження

source: Image format
ca: Format de la imatge
ro: Format imagine
tr: Resim biçimi
uk: Формат зображення

source: Format image as:
ca: Format de la imatge com:
ro: Formatează imagine ca:
tr: Resmi şu şekilde biçimlendir:
uk: Форматувати зображення як:

source: Current format
ca: Format actual
ro: Format curent
tr: Geçerli biçim
uk: Поточний формат

source: Select a file to save the image to
ca: Seleccioneu un fitxer on guardar la imatge
ro: Selectează un fișier în care se salvează imaginea
tr: Resmin kaydedileceği dosyayı seçin
uk: Виберіть файл для збереження зображення

source: _Save
ca: _Desar
ro: _Salvează
tr: _Kaydet
uk: З_берегти

source: Could not save the image to '%s'
ca: No s'ha pogut desar la imatge a «%s»
tr: Resim '%s'e kaydedilemedi
uk: Не вдалося зберегти зображення до «%s»

source: Sources
ca: Fonts
ro: Surse
tr: Kaynaklar
uk: Джерела

source: Comment
ca: Comentari
ro: Comentariu
tr: Açıklama
uk: Коментар

source: Floating Point
ca: Punt flotant
ro: Virgulă mobilă
tr: Kayan Noktalı Sayı
uk: З рухомою комою

source: String
ca: Cadena
ro: Șir
tr: Karakter dizisi
uk: Рядок

source: Keyword
ca: Paraula clau
ro: Cuvânt cheie
tr: Anahtar sözcük
uk: Ключове слово

source: Function
ca: Funció
ro: Funcție
tr: Fonksiyon
uk: Функція

source: Decimal
ro: Zecimal
tr: Ondalık
uk: Десяткове

source: Data Type
ca: Tipus de dades
ro: Tip de date
tr: Veri Türü
uk: Тип даних

source: Variable
ro: Variabilă
tr: Değişken
uk: Змінна

source: No idea what it is
ca: Ni idea de què es tracta
ro: Nicio idee despre ce este asta
tr: Ne olduğu belirsiz
uk: Не маємо гадки щодо того, що це

source: Set to host mask
ca: Estableix la màscara de l'amfitrió
ro: Stabilește la masca de gazdă
tr: Makine maskesi ayarla
uk: Встановити у маску вузла

source: Set to class %c network
ca: Estableix la xarxa de classe %c
ro: Stabilește la rețeaua de clasa %c
tr: %c sınıfı ağ ayarla
uk: Встановити у мережу класу %c

source: Choose a file
ca: Trieu un fitxer
ro: Selectează un fișier
tr: Bir dosya seçin
uk: Виберіть файл

source: Choose a directory
ca: Trieu un directori
ro: Selectează un dosar
tr: Bir dizin seçin
uk: Виберіть каталог

source: _Apply
ca: _Aplicar
ro: _Aplică
tr: _Uygula
uk: Заст_осувати

source: Choose
ca: Trieu
ro: Selectează
tr: Seç
uk: Вибрати

source: Selection model
ca: Model de selecció
ro: Model de selecție
tr: Seçim modeli
uk: Модель вибору

source: Specifies what the user will be allowed to select
ca: Especifica què se li permetrà seleccionar a l'usuari
ro: Specifică ce anume va putea utilizatorul să selecteze
tr: Seçme için kullanıcının alacağı izni belirler
uk: Визначає, що саме користувачу можна буде вибирати

source: Only let the user pick an existing file
ca: Deixa que l'usuari triï un fitxer existent
ro: Permite utilizatorului doar să aleagă un fișier existent
tr: Yalnızca kullanıcı var olan bir dosyayı seçtiğinde izin ver
uk: Дозволити користувачу вибирати лише наявний файл

source: Let the user pick an existing file, or type in a new filename
ca: Deixa que l'usuari triï un fitxer existent o escrigui un nom de fitxer nou
ro: Permite utilizatorului să aleagă un fișier existent, sau să tasteze un nume de fișier nou
tr: Kullanıcı var olan bir dosyayı seçtiğinde izin ver veya yeni bir dosya adı gir
uk: Дозволити користувачу вибирати наявний файл або вводити назву нового файла

source: Let the user pick an existing folder
ca: Deixa que l'usuari triï una carpeta existent
ro: Permite utilizatorului să aleagă un dosar existent
tr: kullanıcı var olan bir klasörü seçtiğinde izin ver
uk: Дозволити користувачу вибирати наявну теку

source: Let the user name an existing or new folder
ca: Deixa que l'usuari nomeni una carpeta existent o nova
ro: Permite utilizatorului să numească un dosar existent sau unul nou
tr: Kullanıcı adına var olan ya da yeni klasör için izin ver
uk: Дозволити користувачу вказувати назву наявної або нової теки

source: Format
tr: Biçim
uk: Формат

source: Allowed characters at each position('0':digit, '9': digit except 0, '@':alpha, '^':upper cased alpha, '#':alphanumeric, '*':any character, any other character will be left unmodified)
ca: Caràcters permesos en cada posició («0»:dígit, «9»: dígit excepte 0, «@»:alpha, «^»:majúscules, «#»:alphanumeric, «*»:qualsevol caràcter; qualsevol altre caràcter es deixarà sense modificar)
ro: Caractere permise la fiecare poziție('0':cifră, '9': cifră cu excepția lui 0, '@':alfa, '^':majuscule alfa, '#':alfanumeric, '*':orice caracter, orice alt caracter va fi lăsat nemodificat)
tr: Her konumdaki izinli karakterler ('0':sayı, '9': sayı 0 hariç, '@':alfanümerik, '^':büyük harf, '#':alfanümerik, '*':her hangi bir karakter, değiştirilmemiş herhangi bir karakter)

source: Mask
ca: Màscara
ro: Mască
tr: Maske
uk: Маска

source: Writing mask for corresponding characters in format ('_': writable, '-':writable, removed from actual value, ' ': not writable)
ca: Escrivint la màscara per als caràcters corresponents en format («_»: escrivible, «-»:escrivible, eliminat del valor real, « »: no escrivible)
ro: Se scrie masca corespunzătoare caracterelor în format ('_': inscripționabil, '-':inscripționabil, eliminat de la valoare, ' ': neinscripționabil)
tr: Karakterlere karşılın gelenler için maske yazma biçimi ('_': yazılabilir, '-': yazılabilir, gerçek değerden silinir, ' ' yazılabilir değil)
uk: Запис маски для відповідних символів у форматі ('_': придатний до запису, '-': придатний до запису, вилучено зі справжнього значення, ' ': непридатний до запису)

source: Encoding
ca: Codificació
ro: Codare
tr: Kodlama
uk: Кодування

source: How password should be encoded
ca: Com s'hauria de codificar la contrasenya
ro: Cum ar trebui să fie codată parola
tr: Parola nasıl kodlanmalı
uk: Спосіб кодування пароля

source: MD5 Sum
ca: Suma MD5
ro: Sumă MD5
tr: MD5 Özeti
uk: Сума MD5

source: No encoding
ca: Sense codificació
ro: Fără codare
tr: Kodlama yok
uk: Немає кодування

source: No data to display
ca: No hi ha dades a mostrar
ro: Fără date de afișat
tr: Gösterilecek veri yok
uk: Немає даних для показу

source: Encoding used to convert binary data to the string
ca: Codificació que s'utilitza per a convertir les dades binàries a la cadena
ro: Codare utilizată pentru convertirea datelor binare în șir
tr: İkili veriyi karakter dizisine dönüştürmek için kullanılan kodlama
uk: Кодування, яке буде використано для перетворення двійкових даних на рядок

source: Lines wrapping
ca: Ajust de línies
ro: Încadrare linii
tr: Satırları bölme
uk: Перенесення рядків

source: Defines how long lines are wrapped
ca: Defineix com s'ajusten en les línies llargues
ro: Definește modul în care se încadrează liniile lungi
tr: Kaydırılmış satırların uzunluğunu tanımlar
uk: Визначає, на якій позицій слід переносити рядки

source: Programming language
ca: Llenguatge de programació
ro: Limbaj de programare
tr: Programlama dili
uk: Мова програмування

source: Define to enable syntactical colourisation
ca: Definir per a activar la coloració sintàctica
ro: Definește pentru a activa colorizarea sintactică
tr: Sözdizimsel renklendirme etkinleştirmesi tanımla
uk: Визначте, щоб увімкнути синтаксичне розфарбовування

source: Do not wrap lines
ca: No ajustar les línies
ro: Nu încadra liniile
tr: Satırları kaydırma
uk: Не переносити рядки

source: break lines anywhere the cursor can appear
ca: Saltar línies sempre que pugui aparèixer el cursor
ro: linii de întrerupere oriunde poate apărea cursorul
tr: imlecin görünebileceği her yerde satır kes
uk: розривати рядки всюди, де може бути розташовано курсор

source: Break lines in between words
ca: Trencar les línies entre paraules
ro: Linii de întrerupere între cuvinte
tr: Kelimeler arası satır sonları
uk: Розривати рядки між словами

source: Break lines in between words or graphemes
ca: Salta línies entre paraules o grafemes
ro: Linii de întrerupere între cuvinte sau grafeme
tr: Kelimeler veya grafemler arası satır sonu
uk: Розривати рядки між словами або графемами

source: Missing spec. file '%s'
ca: Falta el fitxer spec. «%s»
ro: Lipsește fișierul de specificație „%s”
tr: Eksik tanımlama dosyası '%s'
uk: Не вистачає файла специфікації «%s»

source: General
tr: Genel
uk: Загальне

source: Columns
ca: Columnes
ro: Coloane
tr: Sütunlar
uk: Стовпчики

source: Foreign keys
ca: Claus externes
ro: Chei străine
tr: Yabancı anahtarlar
uk: Сторонні ключі

source: Constraints
ca: Restriccions
ro: Restricții
tr: Kısıtlamalar
uk: Обмеження

source: Can't find demo database file: %s
ca: No s'ha pogut trobar el fitxer de base de dades de demostració: %s
ro: Nu se poate găsi fișierul mostră de bază de date: %s
tr: Veri tabanı tanıtım dosyası bulunamıyor: %s
uk: Не вдалося знайти демонстраційний файл бази даних: %s

source: Error opening the connection for file '%s': %s
ca: S'ha produït un error en obrir la connexió per al fitxer «%s»: %s
ro: Eroare la deschiderea conexiunii pentru fișierul „%s”: %s
tr: '%s' dosyası için bağlantı açma hatası: %s
uk: Помилка під час спроби відкрити з'єднання для файла «%s»: %s

source: Libgda-ui Code Demos
ca: Demostracions de codi libgda-ui
ro: Coduri mostră Libgda
tr: Libgda-ui Kod Tanıtımları
uk: Демонстрації коду libgda-ui

source: <b><big>Note: </big></b>Many of the demonstrated items use an opened connection to the SQLite using the '%s' file. In the source code shown here, the <i>demo_cnc</i> and <i>demo_parser</i> objects are created by the framework and made available to all the demonstrated items. To illustrate that calls are non blocking, there is a spinner at the top (which must never stop spinning), and a 1 second delay is added whenever the connection is used.
ca: <b><big>Nota: </big></b>Molts dels elements de demostració utilitzen una connexió oberta a l'SQLite usant el fitxer «%s». En el codi font que es mostra aquí, els objectes <i>demo_cnc</i> i <i>demo_parser</i> són creats pel marc i posats a disposició de tots els elements demostrats. Per a il·lustrar que les trucades no es bloquegen, hi ha un rotàmetre a la part superior (que mai ha de deixar de girar), i s'afegeix un retard d'1 segon cada vegada que s'utilitza la connexió.
tr: <b><big>Not: </big></b>Gösterilen ögelerin bir çoğu, '%s' dosyası kullanarak, SQLite açılmış bağlantı kullanır. Şurada gösterilen kaynak kodda, <i>demo_cnc</i> ve <i>demo_parser</i> nesneleri çatıca oluşturulmuş ve tüm gösterilen ögeler kullanılabilir yapılmıştır. Aramaların engellenmediğini göstermek için, yukarıda bir döndürücü olur (bu döndürücüyü asla durdurmaz) ve her bağlantı kullanıldığında 1 saniye gecikme eklenir.
uk: <b><big>Зауваження: </big></b>У багатьох продемонстрованих записах використано відкрите з'єднання із SQLite за допомогою файла «%s». У показаному тут початковому коді об'єкти <i>demo_cnc</i> і <i>demo_parser</i> створено оболонкою і зроблено доступними усім записам із демонстрації. Щоб продемонструвати те, що виклики виконуються без блокування, у верхній частині вікна показано обертальний індикатор (який не зупиняє оберти) і додано односекундну затримку при використанні з'єднання.

source: Pointer to an XML layout specification (as an xmlNodePtr to a <gdaui_form> node)
ca: Punter a una especificació de distribució de dades XML (com un xmlNodePtr cap a un node <gdaui_form> )
ro: Indicator la o specificație de aranjament XML (ca un xmlNodePtr pentru un nod <gdaui_form>)
tr: XML düzen tanımlamasına işaretçi (xmlNodePtr olarak <gdaui_form> düğümüne)
uk: Вказівник на специфікацію компонування XML (як xmlNodePtr на вузол <gdaui_form>)

source: List of parameters to show in the form
ca: Llista de paràmetres a mostrar en el formulari
ro: Listă de parametri de afișat în formular
tr: Form içinde gösterilecek parametre listesi
uk: Список параметрів, які слід показати у формі

source: Entries Auto-default
ca: Entrades autopredeterminades
ro: Intrări implicite automat
tr: Girdiler Otomatik-öntanımlı
uk: Автотипові записи

source: TRUE if expanding the form vertically makes sense
ca: TRUE si té sentit ampliar el formulari verticalment
ro: TRUE dacă a extinde formularul vertical are sens
tr: Formun dikey olarak büyümesi mantıklı geliyorsa TRUE yapın
uk: TRUE, якщо розгортання форми вертикально має сенс

source: Shown data entries
ca: Entrades de dades mostrades
ro: Intrările de date afișate
tr: Veri girdilerini göster
uk: Показані записи даних

source: There are more entries than expected in group. Found %d
ca: Hi ha més entrades de les esperades en el grup. Trobat %d
ro: Sunt mai multe intrări în grup decât așteptate. S-a găsit %d
tr: Grupta beklenenden daha fazla giriş var. %d bulundu
uk: У групі більше записів, ніж очікувалося. Знайдено %d

source: Can't find data entry for GdaHolder
ca: No es pot trobar l'entrada pel GdaHolder
ro: Nu se poate găsi intrarea de date pentru GdaHolder
tr: GdaHolder için veri girdisi bulunamıyor
uk: Не вдалося знайти запис для GdaHolder

source: Values to be defined
ca: Valors a definir
ro: Valori de definit
tr: Tanımlanmış değerler
uk: Значення, які слід визначити

source: _Ok
ca: _D'acord
tr: _Tamam
uk: _Гаразд

source: '%s' document not parsed successfully
ca: «%s» document no analitzat correctament
ro: Documentul „%s” nu a fost analizat cu succes
tr: '%s' belgesi düzgün ayrıştırılamadı
uk: Документ «%s» не вдалося успішно обробити

source: size group was not taken into account using gdaui_basic_form_add_to_size_group()
ca: la mida del grup no es va tenir en compte, usant gdaui_basic_form_add_to_size_group()
ro: grupul de dimensionare nu a fost luat în considerare utilizând gdaui_basic_form_add_to_size_group()
tr: boyut grubu, gdaui_basic_form_add_to_size_group() kullanılarak hesaba sokulmamış
uk: розмір групи не було взято до уваги при використанні gdaui_basic_form_add_to_size_group()

source: Wrong column type for label: expecting a string and got a %s
ca: Tipus de columna incorrecte per a l'etiqueta: s'esperava una cadena i es va obtenir %s
ro: Tip de coloană incorect pentru etichetă: s-a așteptat un șir și s-a obținut un %s
tr: Etiket için yanlış sütun türü: beklenen karakter dizisi, gelen %s
uk: Помилковий тип стовпчика для мітки: мав бути рядок, а маємо %s

source: Find:
ca: Cerca:
ro: Găsește:
tr: Bul:
uk: Знайти:

source: The data model to display
ca: El model de dades a mostrar
ro: Modelul de date de afișat
tr: Gösterilecek veri modeli
uk: Модель даних для показу

source: Display popup as list
ca: Mostra les finestres emergents com una llista
ro: Afișează popup ca listă
tr: Açılanları liste olarak göster
uk: Показувати контекстну підказку як список

source: Filter failed:
ca: El filtre ha fallat:
ro: Filtrul a eșuat:
tr: Süzgeç başarısız:
uk: Помилка фільтрування:

source: Filter
ca: Filtra
ro: Filtru
tr: Süzgeç
uk: Фільтр

source: any valid SQL expression
ca: qualsevol expressió SQL vàlida
ro: orice expresie SQL validă
tr: herhangi bir geçerli SQL ifadesi
uk: будь-який коректний вираз SQL

source: Columns can be referenced by their name or more easily using <b><tt>_&lt;column number&gt;</tt></b>. For example a valid expression can be: <b><tt>_2 like 'doe%'</tt></b> to filter rows where the 2nd column starts with <tt>doe</tt>.
ca: Les columnes es poden referenciar pel seu nom o, més fàcilment, usant <b><tt>_&lt;número de columna&gt;</tt></b>. Un exemple d'expressió vàlida pot ser: <b><tt>_2 like 'doe%'</tt></b> per a filtrar files en què la 2a columna comença per <tt>doe</tt>.
ro: Coloanele pot fi referențiate prin numele lor sau mai ușor utilizând <b><tt>_&lt;numărul coloanei&gt;</tt></b>. De exemplu o expresie validă poate fi: <b><tt>_2 like 'doe%'</tt></b> pentru a filtra rândurile unde a doua coloană începe cu <tt>doe</tt>.
tr: Sütunlar, kendi adları kullanılarak veya daha kolayca <b><tt>_&lt;sütun numarasıgt;</tt></b> ile belirtilebilirler. Örneğin geçerli bir ifade: <b><tt>_2 like 'doe%'</tt></b> 2. satırdan başlar ve satırları <tt>doe</tt> ile başlıyorsa süzer.
uk: На стовпчики можна посилатися за назвою або, що простіше, за допомогою запису <b><tt>_&lt;номер стовпчика&gt;</tt></b>. Наприклад, коректним виразом може бути такий: <b><tt>_2 like 'doe%'</tt></b> для фільтрування рядків, де другий стовпчик починається з <tt>doe</tt>.

source: Set filter
ca: Activar el filtre
ro: Configurează filtru
tr: Süzgeç ayarla
uk: Встановити фільтрування

source: Clear filter
ca: Buida el filtre
ro: Curăță filtru
tr: Süzgeçi temizle
uk: Зняти фільтрування

source: GdauiAction is not supported by this GdauiDataProxy interface
ca: GdauiAction no està suportat per aquesta interfície de GdauiDataProxy interface
tr: GdauiAction, bu GdauiDataProxy arayüzünce desteklenmiyor
uk: Підтримки GdauiAction у цьому інтерфейсі GdauiDataProxy не передбачено

source: Insert new data
ca: Inserir dades noves
tr: Yeni veri ekle
uk: Вставити нові дані

source: Commit the changes
ca: Efectuar els canvis
tr: Değişiklikleri kaydet
uk: Внести зміни

source: Delete the selected entry
ca: Suprimir l'entrada seleccionada
ro: Șterge intrarea selectată
tr: Seçili girdiyi sil
uk: Вилучити позначений запис

source: Cancel any modification
ca: Cancel·lar qualsevol modificació
tr: Tüm değişiklikleri iptal et
uk: Скасувати усі зміни

source: Move to first entry
ca: Moveu a la primera entrada
tr: İlk girdiye taşı
uk: Перейти до першого запису

source: Move to previous entry
ca: Moveu a l'entrada prèvia
tr: Önceki girdiye taşı
uk: Перейти до попереднього запису

source: Move to next entry
ca: Moveu a l'entrada propera
tr: Sonraki girdiye taşı
uk: Перейти до наступного запису

source: Move to last entry
ca: Moveu a l'última entrada
tr: Son girdiye taşı
uk: Перейти до останнього запису

source: Show first chunk of data
ca: Mostra el primer fragment de dades
tr: İlk veri yığınını göster
uk: Показати перший фрагмент даних

source: Show previous chunk of data
ca: Mostra el fragment de dades previ
tr: Önceki veri yığınını göster
uk: Показати попередній фрагмент даних

source: Show next chunk of data
ca: Mostra el fragment de dades següent
tr: Sonraki veri yığınını göster
uk: Показати наступний фрагмент даних

source: Show last chunk of data
ca: Mostra l'últim fragment de dades
tr: Son veri yığınını göster
uk: Показати останній фрагмент даних

source: Filter data
ca: Filtrar dades
tr: Veriyi süz
uk: Фільтрувати дані

source: Undelete the selected entry
ca: Recuperar l'entrada seleccionada
ro: Restaurează intrarea selectată
tr: Seçili girdiyi geri al
uk: Скасувати вилучення позначеного запису

source: Invalid column number %d
ca: El número de columna %d no és vàlid
ro: Număr de coloană %d nevalid
tr: Geçersiz sütun sayısı %d
uk: Некоректний номер стовпчика %d

source: Data model
ca: Model de dades
ro: Model de date
tr: Veri modeli
uk: Модель даних

source: Internal GdaDataProxy data model
ca: Model de dades GdaDataProxy intern
ro: Model de date intern GdaDataProxy
tr: İç GdaDataProxy veri modeli
uk: Внутрішня модель даних GdaDataProxy

source: Can't modify row while data model is being reset
ca: No s'ha pogut modificar una fila mentre es restableix el model de dades
ro: Nu se poate modifica rândul în timp ce modelul de date este restabilit
tr: Veri modeli sıfırlanmışken satır değiştirilemiyor
uk: Не можна вносити зміни до рядка, доки виконується відновлення початкового стану моделі даних

source: Trying to modify a read-only row
ca: Intentant modificar una fila de només lectura
ro: Se încearcă modificarea unui rând protejat la scriere
tr: Salt okunur satır değiştirilmeye çalışılıyor
uk: Спроба внесення змін до придатного лише для читання рядка

source: Can't access row while data model is being reset
ca: No es pot accedir a una fila mentre es restableix el model de dades
ro: Nu se poate accesa rândul în timp ce modelul de date este restabilit
tr: Veri modeli sıfırlanırken satıra erişilemez
uk: Не можна отримувати доступ до рядка, доки виконується відновлення початкового стану моделі даних

source: Error parsing CSS: %s
ca: Error a l'analitzar el CSS: %s
tr: CSS ayrıştırılırken hata: %s
uk: Помилка під час обробки CSS: %s

source: Attempt to initialize an already initialized library
ca: S'ha intentat inicialitzar una biblioteca que ja estava inicialitzada
ro: Încercare de a inițializa o bibliotecă deja inițializată
tr: Başlatılmak istenen kütüphane zaten başlamış
uk: Спроба ініціалізувати вже ініціалізовану бібліотеку

source: Could not open plugins directory, no plugin loaded.
ca: No s'ha pogut obrir la carpeta de complements, no hi ha cap complement carregat.
ro: Nu s-a putut deschide dosarul de module, niciun modul încărcat.
tr: Eklenti dizini açılamadı, yüklenmiş eklenti yok.
uk: Не вдалося відкрити каталог додатків. Додатки не завантажено.

source: Error: %s
ro: Eroare: %s
tr: Hata: %s
uk: Помилка: %s

source: Loading file %s...
ca: Carregant el fitxer %s...
ro: Se încarcă fișierul %s...
tr: %s dosyası yükleniyor...
uk: Завантажуємо файли %s...

source: Plugins load warning: %s
ca: Avís de càrrega dels complements:: %s
ro: Avertisment încărcare modul: %s
tr: Eklenti yükleme uyarısı: %s
uk: Попередження щодо завантаження додатків: %s

source: Use data source:
ca: Usar font de dades:
ro: Utilizează sursa de date:
tr: Veri kaynağı kullan:
uk: Використовувати джерело даних:

source: Specify connection:
ca: Especificar connexió:
ro: Specificare conexiune:
tr: Bağlantı belirt:
uk: Вкажіть з'єднання:
