Repository: GNOME/libgda
Catalog: po/*.po
Languages: ca, ro, tr, uk

source: File used to store any information associated to this connection (favorites, descriptions, ...)
ca: Fitxer utilitzat per a emmagatzemar qualsevol informació associada a aquesta connexió (favorits, descripcions, ...)
ro: Fișier utilizat pentru a stoca orice informație asociată cu această conexiune (favorite, descrieri, ...)
tr: Bu bağlantı ile ilişkili tüm bilgiyi tutacak dosya (favoriler, tanımlamalar, ...)

source: Opened connections
ca: Connexions obertes
ro: Conexiuni deschise
tr: Açılmış bağlantılar
uk: Відкриті з'єднання

source: List of opened connections
ca: Llista de connexions obertes
ro: Lista conexiunilor deschise
tr: Açılmış bağlantıların listesi
uk: Список відкритих з'єднань

source: Connections
ca: Connexions
ro: Conexiuni
tr: Bağlantılar
uk: З'єднання

source: Connection's properties
ca: Propietats de la connexió
ro: Proprietăți conexiune
tr: Bağlantının özellikleri
uk: Властивості з'єднання

source: Close connection
ca: Tancar la connexió
ro: Închide conexiunea
tr: Bağlantıyı kapat
uk: Закрити з'єднання

source: Close selected connection
ca: Tanqueu la connexió seleccionada
ro: Închide conexiunea selectată
tr: Seçilen bağlantıyı kapat
uk: Закрити вибране з'єднання

source: Connect
ca: Connecta
ro: Conectează
tr: Bağlan
uk: З'єднати

source: Open a new connection
ca: Obre una connexió nova
ro: Deschide o conexiune nouă
tr: Yeni bir bağlantı aç
uk: Відкрити нове з'єднання

source: LDAP browser
ca: Visor d'LDAP
ro: Browser LDAP
tr: LDAP tarayıcısı
uk: Навігатор LDAP

source: Fetch Meta Data
ca: Recupera les metadades
tr: Üst Veri Getir
uk: Отримати метадані

source: Connection properties
ca: Propietats de la connexió
ro: Proprietăți conexiune
tr: Bağlantı özellikleri
uk: Властивості з'єднання

source: Display options
ca: Mostra les opcions
tr: Görüntü seçenekleri
uk: Параметри показу

source: Rollback transaction
ca: Transacció de retorn
tr: Toplu işlemi geri al
uk: Відкотити транзакцію

source: Commit transaction
ca: Fer transacció
tr: Toplu işlemi kaydet
uk: Надіслати транзакцію

source: Begin transaction
ca: Iniciar transacció
tr: Toplu işleme başla
uk: Почати транзакцію

source: Fullscreen
ca: Pantalla completa
tr: Tam ekran
uk: На весь екран

source: Open Connection
ca: Connexió oberta
tr: Bağlantı Aç
uk: Встановити з'єднання

source: Bind Connections
ca: Vincular connexions
tr: Bağlantı Bağla
uk: Пов'язати з'єднання

source: Connections List
ca: Llista de connexions
tr: Bağlantıların Listesi
uk: Список з'єднань

source: New Window
ca: Finestra nova
ro: Fereastră nouă
tr: Yeni Pencere
uk: Нове вікно

source: About
ca: Quant a
ro: Despre
tr: Hakkında
uk: Про програму

source: Help
ca: Ajuda
ro: Ajutor
tr: Yardım
uk: Довідка

source: Quit
ca: Surt
ro: Părăsește
tr: Çık
uk: Вийти

source: Perspectives
tr: Perspektifler
uk: Перспективи

source: Hit the F11 key to leave the fullscreen mode
ca: Premeu F11 per a sortir del mode de pantalla completa
tr: Tam ekran kipinden çıkmak için F11 tuşuna bas
uk: Натисніть клавішу F11, щоб полишити повноекранний режим

source: Do you want to close the '%s' connection?
ca: Voleu tancar la connexió «%s»?
ro: Doriți să închideți conexiunea „%s”?
tr: '%s' bağlantısını silmek istiyor musunuz?
uk: Хочете закрити з'єднання «%s»?

source: Error starting transaction: %s
ca: S'ha produït un error en iniciar la transacció: %s
ro: Eroare la pornirea tranzacției: %s
tr: Toplu işleme başlama hatası: %s
uk: Помилка під час спроби розпочати транзакцію: %s

source: Error committing transaction: %s
ca: S'ha produït un error en enviar la transacció: %s
ro: Eroare la comiterea tranzacției: %s
tr: Toplu işlemi kaydetme hatası: %s
uk: Помилка під час спроби внести транзакцію: %s

source: Error rolling back transaction: %s
ca: S'ha produït un error en desfer la transacció: %s
ro: Eroare la anularea tranzacției: %s
tr: Toplu işlemi geri alma hatası: %s
uk: Помилка під час спроби відкотити транзакцію: %s

source: Error updating bound connection: %s
ca: S'ha produït un error en actualitzar la connexió contenidora: %s
ro: Eroare la actualizarea conexiunii de legătură: %s
tr: Bağlı bağlantı güncelleme hata: %s
uk: Помилка під час спроби оновлення пов'язаного з'єднання: %s

source: Error updating meta data for connection: %s
ca: S'ha produït un error en actualitzar les metadades per a la connexió: %s
tr: Bağlantı için üst veri güncellenirken hata: %s
uk: Помилка під час спроби оновлення метаданих для з'єднання: %s

source: Error Updating Meta Data: %s
ca: S'ha produït un error en actualitzar les metadades: %s
tr: Üst Veri Güncelleme Hatası:% s
uk: Помилка під час спроби оновити метадані: %s

source: Don't show this message again
ca: No mostris més aquest missatge
ro: Nu arăta acest mesaj din nou
tr: Bu iletiyi tekrar gösterme
uk: Не показувати надалі

source: _Close
ca: Tan_ca
ro: În_chide
tr: _Kapat
uk: З_акрити

source: The current perspective has changed to the '%s' perspective, you can switch back to previous perspective through the 'Perspective/%s' menu, or using the '%s' shortcut
ca: La perspectiva actual ha canviat a la perspectiva «%s». Podeu tornar a la perspectiva anterior a través del menú «Perspectiva/%s» o utilitzant la drecera «%s»
ro: Perspectiva curentă s-a schimbat la perspectiva „%s”, puteți să o modificați la perspectiva precedentă prin meniul „Perspectivă/%s”, sau utilizând scurtătura „%s”
tr: Geçerli persfektif, '%s' persfektifi ile değişti, 'Perspektif/%s' menüsünü veya '%s' kısayolunu kullanarak önceki perfektife geri dönebilirsiniz

source: Zoom in
ca: Apropar-se
ro: Apropie
tr: Yakınlaştır
uk: Збільшити

source: Zoom out
ca: Allunyar-se
ro: Depărtează
tr: Uzaklaştır
uk: Зменшити

source: Adjusted zoom
ca: Zoom ajustat
ro: Zoom ajustat
tr: Ayarlanmış yakınlaştırma
uk: Коригований масштаб

source: Linear layout
ca: Disposició lineal
ro: Aranjament liniar
tr: Çizgisel yerleşim
uk: Лінійне компонування

source: Radial layout
ca: Disposició radial
ro: Aranjament radial
tr: Dairesel yerleşim
uk: Радіальне компонування

source: Save as
ca: Desa com a
ro: Salvează ca
tr: Farklı kaydet
uk: Зберегти як

source: Print
ca: Imprimeix
ro: Tipărire
tr: Yazdır
uk: Надрукувати

source: Save diagram as
ca: Anomena i desa el diagrama
ro: Salvează diagramă ca
tr: Diyagramı farklı kaydet
uk: Зберегти діаграму як

source: PNG Image
ca: Imatge PNG
ro: Imagine PNG
tr: PNG Dosyası
uk: зображення PNG

source: SVG file
ca: Fitxer SVG
ro: Fișier SVG
tr: SVG dosyası
uk: файл SVG

source: Failed to create SVG file
ca: No s'ha pogut crear el fitxer SVG
ro: A eșuat crearea fișierului SVG
tr: SVG dosyası oluşturulamadı
uk: Не вдалося створити файл SVG

source: File format to save to is not recognized.
ca: No es reconeix el format amb què es vol desar.
ro: Formatul fișierului în care se salvează nu este recunoscut.
tr: Kaydedilecek dosya biçimi bilinmiyor.
uk: Не вдалося розпізнати формат файлів, який слід використати для збереження даних.

source: Failed to create PNG file
ca: No s'ha pogut crear el fitxer PNG
ro: A eșuat crearea fișierului PNG
tr: PNG dosyası oluşturulamadı
uk: Не вдалося створити файл PNG

source: Type: %s
ca: Tipus: %s
ro: Tip: %s
tr: Tür: %s
uk: Тип: %s

source: Remove from graph
ca: Suprimeix de la gràfica
ro: Elimină din graf
tr: Grafikten kaldır
uk: Вилучити з графу

source: Add referenced tables to graph
ca: Afegeix a la gràfica les taules referenciades
ro: Adaugă tabele referențiate în graf
tr: Referanslı tabloları grafiğe ekle
uk: Додати таблиці, на які посилається, до графу

source: Add tables referencing this table to graph
ca: Afegeix a la gràfica les taules que referencien a aquesta taula
ro: Adaugă tabele care fac referință la această tabelă în graf
tr: Tabloları bu tabloyu kaynak alarak grafiğe ekle
uk: Додати таблиці, які посилаються на цю таблицю до графу

source: Declare foreign key for this table
ca: Declara una clau externa per a aquesta taula
ro: Declară cheie străină pentru această tabelă
tr: Bu tablo için yabancı anahtar belirt
uk: Оголосити сторонній ключ для цієї таблиці

source: Failed to declare foreign key: %s
ca: No s'ha pogut declarar la clau externa: %s
ro: Declararea cheii străine a eșuat: %s
tr: Yabancı anahtar belirtilemedi: %s
uk: Не вдалося оголосити сторонній ключ: %s

source: Successfully declared foreign key
ca: S'ha declarat la clau externa
ro: Cheia străină a fost declarată cu succes
tr: Yabancı anahtar başarıyla belirtildi
uk: Успішно оголошено сторонній ключ

source: Add tables
ca: Afegeix taules
ro: Adaugă tabele
tr: Tablolar ekle
uk: Додати таблиці

source: Add one table
ca: Afegeix una taula
ro: Adaugă o tabelă
tr: Bir tablo ekle
uk: Додати одну таблицю

source: Add all tables
ca: Afegeix totes les taules
ro: Adaugă toate tabelele
tr: Tüm tabloları ekle
uk: Додати усі таблиці

source: Add all tables in schema
ca: Afegeix totes les taules a l'esquema
ro: Adaugă toate tabelele în schemă
tr: Şema içindeki tüm tabloları ekle
uk: Додати усі таблиці у схемі

source: Select tables to add to diagram
ca: Seleccioneu les taules que s'afegiran al diagrama
ro: Selectează tabelele de adăugare la diagramă
tr: Diyagrama eklemek için tablo seç
uk: Виберіть таблиці для додавання до діаграми

source: Declared foreign key
ca: Clau externa declarada
ro: Cheia străină s-a declarat
tr: Tanımlanmış yabancı anahtar
uk: Оголошено сторонній ключ

source: Policy on UPDATE
ca: Política quan s'actualitza (UPDATE)
ro: Politica pentru UPDATE
tr: UPDATE politikası
uk: Правила для UPDATE

source: Policy on DELETE
ca: Política quan se suprimeix (DELETE)
ro: Politica pentru DELETE
tr: DELETE politikası
uk: Правила для DELETE

source: Failed to undeclare foreign key: %s
ca: No s'ha pogut suprimir la declaració de la clau externa: %s
ro: Eliminarea cheii străine a eșuat: %s
tr: Yabancı anahtarın belirtmesi kaldırılamadı: %s
uk: Не вдалося скасувати оголошення стороннього ключа: %s

source: Successfully undeclared foreign key
ca: S'ha suprimit la declaració de la clau externa
ro: Cheia străină s-a eliminat cu succes
tr: Yabancı anahtar başarıyla kaldırıldı
uk: Успішно скасовано оголошення стороннього ключа

source: Remove this declared foreign key
ca: Suprimeix aquesta declaració de clau externa
ro: Elimină această cheie străină declarată
tr: Bu belirtilmiş yabancı anahtarı sil
uk: Вилучити цей оголошений сторонній ключ

source: Page size and zoom
ca: Mida de la pàgina i escalat
ro: Dimensiunea paginii și focalizarea
tr: Sayfa boyutu ve yakınlaştırma
uk: Розмір і масштаб сторінок

source: Page %d of %d horizontally and %d of %d vertically
ca: Pàgines de %d a %d horitzontalment i de %d a %d verticalment
ro: Pagina %d din %d orizontal și %d din %d vertical
tr: Sayfa %d, %d yatay ve %d, %d dikey
uk: Сторінка %d з %d горизонтально і %d з %d вертикально

source: Adjust page's size and orientation
ca: Ajusta la mida i l'orientació de la pàgina
ro: Ajustează orientarea și dimensiunea paginii
tr: Sayfanın boyutunu ve yönünü ayarla
uk: Скоригувати розмір і орієнтацію сторінок

source: <b>Zoom</b>
ca: <b>Escalat</b>
ro: <b>Focalizare</b>
tr: <b>Yakınlaştır</b>
uk: <b>Масштаб</b>

source: Number of pages used:
ca: Nombre de pàgines utilitzades:
ro: Numărul de pagini utilizate:
tr: Kullanılan sayfaların sayısı:
uk: Кількість використаних сторінок:

source: horizontally
ca: horitzontalment
ro: orizontal
tr: yatay olarak
uk: горизонтально

source: vertically
ca: verticalment
ro: vertical
tr: dikey olarak
uk: вертикально

source: Zoom factor:
ca: Factor d'escalat:
ro: Factor de focalizare:
tr: Yakınlaştırma oranı:
uk: Коефіцієнт масштабування:

source: <b>Page numbers</b>
ca: <b>Números de pàgina</b>
ro: <b>Numere pagină</b>
tr: <b>Sayfa numaraları</b>
uk: <b>Номери сторінок</b>

source: Print page numbers
ca: Imprimeix els números de pàgina
ro: Tipărește numerele paginii
tr: Sayfa numaralarını yazdır
uk: Виводити номери сторінок

source: New virtual connection
ca: Nova connexió virtual
ro: Conexiune virtuală nouă
tr: Yeni sanal bağlantı
uk: Нове віртуальне з'єднання

source: Create connection
ca: Crear connexió
ro: Creează o conexiune
tr: Bağlantı oluştur
uk: Створити з'єднання

source: _Help
ca: A_juda
ro: _Ajutor
tr: _Yardım
uk: _Довідка

source: Virtual connection's properties
ca: Propietats de la connexió virtual
ro: Proprietățile conexiunii virtuale
tr: Sanal bağlantının özellikleri
uk: Властивості віртуального з'єднання

source: Virtual connection's properties.
ca: Propietats de la connexió virtual.
tr: Sanal bağlantının özellikleri.
uk: Властивості віртуального з'єднання.

source: The virtual connection you are about to define can bind tables from an existing connection as well as bind a data set which will appear as a table (importing CSV data for example). You can add as many binds as needed
ca: La connexió virtual que definiu pot vincular taules des d'una connexió existent així com vincular un conjunt de dades que apareixerà com una taula (important dades CVS, per exemple). Podeu afegir tots els vincles que necessiteu
ro: Conexiunea virtuală pe care o veți defini poate lega tabele dintr-o conexiune existentă precum și lega un set de date care va apărea ca o tabelă (importarea de date CSV, de exemplu). Puteți să adăugați cât de multe legături aveți nevoie
tr: Tanımladığınız sanal bağlantı, tabloları var olan bağlantı ile tablo olarak görünen veri kümesi kadar iyi bir şekilde bağlayabilir (Örneğin: CSV verisinin içeri aktarılması). Gerektiği kadar bir bağ ekleyebilirsiniz

source: Add binding
ca: Afegir vinculació
ro: Adaugă legătură
tr: Bağlama ekle
uk: Додати прив'язку

source: Bind a connection
ca: Vincular una connexió
ro: Leagă o conexiune
tr: Bir bağlantı bağla
uk: Пов'язати з'єднання

source: Bind a data set
ca: Vincular un conjunt de dades
ro: Leagă un set de date
tr: Bir veri kümesine bağla
uk: Пов'язати набір даних

source: Bind a data set as a table:
ca: Vincular un conjunt de dades com una taula:
ro: Leagă un set de date ca o tabelă:
tr: Bir veri kümesine tablo olarak bağla:
uk: Пов'язати набір даних як таблицю:

source: Import a data set and make it appear as a table
ca: Importeu un conjunt de dades i feu que aparegui com a taula
ro: Importă un set de date și fă-l să apară ca o tabelă
tr: Bir veri kümesini içeri aktar ve onu tablo olarak görünmesi sağla
uk: Імпортувати набір даних і сформатувати його до таблиці

source: Remove this bind
ca: Elimina aquest enllaç
ro: Elimină această legătură
tr: Bu bağı sil
uk: Вилучити цю прив'язку

source: Invalid schema name
ca: Nom d'esquema no vàlid
ro: Nume de schemă nevalid
tr: Geçersiz şema adı
uk: Некоректна назва схема

source: Bind all tables of a connection using a schema prefix:
ca: Vincular totes les taules d'una connexió fent servir un prefix d'esquema:
ro: Leagă toate tabelele unei conexiuni folosind un prefix de schemă:
tr: Şema ön eki kullanarak bir bağlantının tüm tablolarını bağla:
uk: Пов'язати усі таблиці з'єднання за допомогою префікса структури:

source: Each table in the selected connection will appear as a table in the virtual connection using the specified schema as a prefix
ca: Cada taula de la connexió seleccionada apareixerà com una taula de la connexió virtual amb l'esquema especificat com a prefix
ro: Fiecare tabelă din conexiunea selectată va apărea în conexiunea virtuală folosind schema specificată ca un prefix
tr: Seçili bağlantıdaki her tablo, belirtilen şema ön eki kullanılarak sanal bağlantı içinde tablo olarak görünür

source: Connection
ca: Connexió
ro: Conexiune
tr: Bağlantı
uk: З'єднання

source: Connection to get tables from in the schema
ca: Connexió per a obtenir les taules de l'esquema
ro: Conexiune pentru a obține tabele din schemă
tr: Şemadan tablo almak için bağlantı
uk: З'єднання для отримання таблиць у схемі

source: Schema
ca: Esquema
ro: Schemă
tr: Şema
uk: Схема

source: Name of the schema the tables will be in
ca: El nom de l'esquema en el qual estaran les taules
ro: Numele schemei în care va fi tabela
tr: Tabloların içinde olduğu şemanın adı
uk: Назва структури, яку буде використано для таблиць

source: Obtain referenced data in table %s from
ca: Obteniu dades de referència des de la taula %s
tr: %s tablosundaki başvurulan verileri al
uk: Отримати дані, на які посилається таблиці %s з

source: column number %d (
ca: número de columna %d (
tr: sütun sayısı %d (
uk: номер стовпчика %d (

source: List referencing data in %s.
ca: Llista les dades de referència a %s.
tr: %s içindeki referans verilerini listele.
uk: Вивести список посилань на дані у %s.

source: Error adding new data source: %s
ca: S'ha produït un error en afegir una font de dades nova: %s
ro: Eroare la adăugarea unei surse de date noi: %s
tr: Yeni veri kaynağı ekleme hatası: %s
uk: Помилка при додаванні джерела даних: %s

source: Data Manager
ca: Gestor de dades
ro: Administrator de date
tr: Veri Yöneticisi
uk: Засіб керування даних

source: Unsaved
ca: No desat
ro: Nesalvat
tr: Kaydedilmemiş
uk: Не збережено

source: Variables' values:
ca: Valors de les variables:
ro: Valorile variabilelor:
tr: Değişkenlerin değerleri:
uk: Значення змінних:

source: Reset the editor's contents
ca: Restabliu el contingut de l'editor
ro: Restabilește conținuturile editorului
tr: Düzenleyicinin içeriğini sıfırla
uk: Скинути вміст редактора

source: Add a new data source
ca: Afegir una nova font de dades
ro: Adaugă o sursă de date nouă
tr: Yeni bir veri kaynağı ekle
uk: Додати нове джерело даних

source: Variables
ro: Variabile
tr: Değişkenler
uk: Змінні

source: Show variables needed
ca: Mostra les variables necessàries
ro: Afișează variabilele necesare
tr: Gerekli değişkenleri göster
uk: Показати потрібні змінні

source: Execute
ca: Executa
ro: Execută
tr: Yürüt
uk: Виконати

source: Execute specified data manager
ca: Executeu el gestor de dades especificat
ro: Execută administratorul de date specificat
tr: Belirtilen veri yöneticisini çalıştır
uk: Виконати вказаний засіб керування даними

source: View XML
ca: Veure XML
ro: Vizualizează XML
tr: XML Görüntüle
uk: Переглянути XML

source: View specifications as XML (advanced)
ca: Vegeu les especificacions com XML (avançat)
ro: Vizualizează specificațiile ca XML (avansat)
tr: Özellikleri XML olarak görüntüle (gelişmiş)
uk: Переглянути специфікації як XML (розширений режим)

source: '%s' data manager
ca: Gestor de dades «%s»
ro: administrator de date „%s”
tr: '%s' veri yöneticisi
uk: Засіб керування даними «%s»

source: Data manager
ca: Gestor de dades
ro: Administrator de date
tr: Veri yöneticisi
uk: Засіб керування даних

source: Could not save data manager
ca: No s'han pogut desar el gestor de dades
ro: Nu s-a putut salva administratorul de date
tr: Veri yöneticisi kaydedilemedi
uk: Не вдалося зберегти засіб керування даними

source: Data manager's name
ca: Nom del gestor de dades
ro: Numele administratorului de date
tr: Veri yöneticisinin adı
uk: Назва засобу керування даними

source: Save
ca: Desar
ro: Salvează
tr: Kaydet
uk: Зберегти

source: source%d
ca: font%d
ro: sursă%d
tr: kaynak%d
uk: джерело%d

source: Data source from SQL
ca: Font de dades de SQL
ro: Sursa de date din SQL
tr: SQL üzerinden veri kaynağı
uk: Джерело даних з SQL

source: In schema '%s'
ca: En esquema «%s»
ro: În schema „%s”
tr: '%s' şeması içinde
uk: У схемі «%s»

source: For table: %s
ca: Per taula: %s
ro: Pentru tabela: %s
tr: Şu tablo için: %s
uk: Для таблиці: %s

source: Switching to execution mode. Hit the Escape key to return to the compose mode
ca: Passant al mode d'execució. Feu clic a la tecla Escape per a tornar al mode de redacció
ro: Se schimbă la modul de executare. Apăsați tasta Escape pentru a vă întoarce în modul de compunere
tr: Çalıştırma kipine dön. Escape tuşuna basarak oluşturma kipine dönebilirsiniz
uk: Перемикаємося на режим виконання. Натисніть клавішу Esc, щоб повернутися до режиму редактора

source: Switch between compose and execute modes
ca: Canviar entre modes de redacció i execució
ro: Schimbă între modurile de compunere și de executare
tr: Oluşturma ve çalıştırma kipleri arasında geçiş yap
uk: Перемикання між режимами редагування і виконання

source: Could not remove favorite: %s
ca: No s'ha pogut eliminar el preferit: %s
ro: Nu s-a putut elimina preferata: %s
tr: Favori kaldırılamadı: %s
uk: Не вдалося вилучити вибраний запис: %s

source: Could not add favorite: %s
ca: No s'ha pogut afegir el preferit: %s
ro: Nu s-a putut adăuga preferata: %s
tr: Favori eklenemedi: %s
uk: Не вдалося додати вибраний запис: %s

source: Favorite's properties
ca: Propietats del preferit
ro: Proprietățile preferatei
tr: Favorinin özellikleri
uk: Властивості вибраного запису

source: Specifications
ca: Especificacions
ro: Specificații
tr: Tanımlamalar
uk: Специфікації

source: _Properties
ca: _Propietats
ro: _Proprietăți
tr: _Özellikler
uk: В_ластивості

source: Saved
ca: Desat
ro: Salvat
tr: Kaydedildi
uk: Збережено

source: Unnamed data manager
ca: Gestor de dades sense nom
ro: Administrator de date nedenumit
tr: Adsız veri yöneticisi
uk: Засіб керування даними без назви

source: Show favorites
ca: Mostrar els preferits
tr: Favorileri göster
uk: Показати вибрані

source: New data manager tab
ca: Nova pestanya del gestor de dades
tr: Yeni veri yöneticisi sekmesi
uk: Нова вкладка засобу керування даними

source: Node must be "table" or "query", and is "%s"
ca: El node ha de ser «table» o «query», i és «%s»
ro: Nodul trebuie să fie „tabelă” sau „interogare”, și este „%s”
tr: Düğüm bir "tablo" ya da "sorgu" olmalı ve "%s" olmalıdır
uk: Вузлом має бути "table" або "query", маємо ж «%s»

source: Not ready
ca: No està llest
ro: Nu este gata
tr: Hazır değil
uk: Неготовий

source: Malformed table name "%s"
ca: Nom de taula «%s» incorrecte
ro: Nume de tabelă „%s” greșit
tr: Kusurlu tablo adı "%s"
uk: Помилкове форматування назви таблиці «%s»

source: Could not find the "%s" table
ca: No s'ha pogut trobar la taula «%s»
ro: Nu s-a putut găsi tabela „%s”
tr: "%s" tablosu bulunamadı
uk: Не вдалося знайти таблицю «%s»

source: The "%s" object is not a table
ca: L'objecte «%s» no és una taula
ro: Obiectul „%s” nu este o tabelă
tr: "%s" nesnesi tabloda değil
uk: Об'єкт «%s» не є таблицею

source: Missing attribute "name" for table
ca: Falta l'atribut «name» per a la taula
ro: Lipsește atributul „nume” pentru tabelă
tr: Tablo için 'name' özniteliği eksik
uk: Не вистачає атрибута «name» для таблиці

source: Could not find any foreign key to "%s"
ca: No s'ha pogut trobar cap clau externa cap a «%s»
ro: Nu s-a putut găsi nicio cheie străină la „%s”
tr: "%s" için herhangi bir yabancı anahtar bulunamadı
uk: Не вдалося знайти жодного стороннього ключа до «%s»

source: The fields involved in the foreign key to "%s" are not known
ca: Es desconeixen els camps involucrats en la clau externa cap a «%s»
ro: Câmpurile implicate în cheia străină la „%s” nu sunt cunoscute
tr: "%s" için olan yabancı anahtardaki ilgili alanlar bilinmiyor
uk: Поля, які включено до стороннього ключа до «%s», є невідомими

source: No SELECT statement to execute
ca: Sense declaració SELECT per a executar
ro: Nicio comandă SELECT de executat
tr: Yürütülecek SELECT ifadesi yok
uk: Немає інструкції SELECT для виконання

source: Statement to execute is not a selection statement
ca: La declaració a executar no és una declaració de selecció
ro: Comanda de executat nu este o comandă de selecție
tr: Yürütülecek ifade bir seçim ifadesi değil
uk: Інструкція, яку слід виконати, не є інструкцією вибору

source: Contents of '%s'
ca: Contingut de «%s»
ro: Conținuturile lui „%s”
tr: '%s' içeriği
uk: Вміст «%s»

source: Could not build SELECT statement
ca: No es va poder construir la declaració SELECT
ro: Nu s-a putut construi comanda SELECT
tr: SELECT ifadesi oluşturulamadı
uk: Не вдалося побудувати інструкцію SELECT
